{
  "zZhBiivvN4Iq-hyzS9XvMQ": {
    "user_rating": 4.0, 
    "user_location": "Bozeman, MT", 
    "user_name": "Emma K.", 
    "review_text": "Johnny Nitro featuring the lady sax player whose signature move is to walk around on top of the bar during her \"Mercury Blues\" solo and then... jump off!!!!  This is a classy town.", 
    "review_date": "2006-01-10"
  }, 
  "u7_qkKX5nOm6y5wc5pbmwg": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Alice H.", 
    "review_text": "Go on a Thursday night, when they have a live blues band.  It's an older crowd (30's, even 40's), but a great little place to get your swing on with a date or your bf/gf... no matter how old you are.  Don't be intimidated by the beer wench behind the bar.  She may throw your change at you, no joke, but not to worry... at least you're getting a $2 cold beer.   I went here on my first date with my man (his recommendation) and it was a hit!  I love this bar.", 
    "review_date": "2007-11-28"
  }, 
  "17dx_x9W_7QBT-3oiQQEQQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gabrielle J.", 
    "review_text": "I'm the kind of girl who orders whiskey neat.  This whiskey neat is more of a pint of whiskey neat.  Holy shit.  Most phenomenal blues any night of the week.  I love the patrons here- they break up the monotony and drone of all other bars/clubs in town.", 
    "review_date": "2009-04-20"
  }, 
  "LAYE5MppHHXyGcBSDogsUw": {
    "user_rating": 5.0, 
    "user_location": "Glendale, CA", 
    "user_name": "Tatev S.", 
    "review_text": "Good Blues- check! old school down to earth bartenders- check! dancing to live music- check! good liquor(even the box wine seems ok:)- check! This place has been around since 1861 and it seems nothing much has changed about it! I love SF! I love The Saloon!!!!!", 
    "review_date": "2010-08-03"
  }, 
  "GJsRGdnvfGsG3w0becDD2w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cec D.", 
    "review_text": "One of my favorite dives in the city. Cash only, limited beer selection and kinda stinky inside but the music and dancing can not be beat!!!", 
    "review_date": "2013-10-14"
  }, 
  "r4ZXc4HYIiTyTp2E6BV7WA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liss T.", 
    "review_text": "Old wood, old glass, old regulars and some new youngins from all over the world. I had two of the weirdest bar experiences of my life here. Only enhanced by the atmosphere.    1) Bloody Marys at nearly 10:30 in the morning with people I had just met in a hostel and joke-telling barflies looking well over 70. \"Do you want to hear a joke? This one is just for the ladies. A man walks into a brain store to buy a brain. There are two brains in jars on the shelf. The brain on the left is half the price of the brain on the right. The man asks why. The store clerk replies \"Because its been used.\" Ba-bum-ching!  &amp;  2) A Jazz/Blues band at night with an Australian student, a French teacher from France and a ridiculous aspiring political consultant from Arizona.   All pours were *generous* pours, maybe not the delicate kind of mixology you would get in NY but Sweet  Jesus was there vodka in there.   This bar will always hold a special place in my heart. I searched for 'dive bar' on yelp and the best kind of 'dive bar' Yelp and San Francisco did provide. Your beer options will be limited. PBR will be the only thing on tap and cash only. BUT, you *will* walk out with stories.", 
    "review_date": "2013-01-06"
  }, 
  "tRaVOHBS9l_6hdwSQ0Q5Kg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison M.", 
    "review_text": "I love you Saloon!!  Thank you for your excellent music and total unpretentious-ness.  Yes I made up that word.  If you are kick back and like to have a good time then drop by.  Music is great and people are always friendly.  See you there!", 
    "review_date": "2008-03-07"
  }, 
  "9DVpnoTOOMaDfLCKppI9pA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stitch H.", 
    "review_text": "Cheap cover (when they charge it) - cheap drinks and always a great band.  This place is so much fun and probably the most inexpensive date in North Beach.  Always crowded for a reason and it's great watching the tourists stare=ing gape jawed when the musicians walk across the bar.  Ignore the kids like Alexa, they want video games and TV monitors, this is what a real saloon looks, smells and sounds like.", 
    "review_date": "2009-02-24"
  }, 
  "F01s5dK-Rit8g_SlSkJdTA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ava S.", 
    "review_text": "The first time I came to The Saloon, it was on a date with this guy. It didn't end up working out for us, but I heard later that he used the same three step process for all of his dates. Meet a girl at a classy wine bar in North Beach. Take her across the street to Firenze by Night (where he is conveniently friends with the owners) for dinner, and then take her to The Saloon for some blues music, where he can show off his fabulous dancing skills. Hey, I can't knock his method. It worked on me!  Anyway, I love The Saloon for numerous reasons. The bartenders are totally crabby, but once you're in, you're in. They bring in the most awesome blues bands, and everybody, I mean EVERYBODY, will want to get down and boogie.   Whenever I feel like dancing the blues away, literally, I'll come to The Saloon. It beats any of those crap ass North Beach dance clubs any day.", 
    "review_date": "2009-03-25"
  }, 
  "_zwYMD_flEZ3AJPjrXYc4w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike K.", 
    "review_text": "As I read posts here, I think that one of the biggest issues is expectations.  If you expect to be treated like the King or Queen you think you really are.. by all means go elsewhere.   If you expect to impress a date, you best be over 50 and she best be from New Orleans... If a fine afternoon every once in a while, is sitting back, listening to Etta James or Howling Wolf while chatting with strangers, then any afternoon would be good.  If you don't mind dancing with women who want to dance to the music, rather than trying to impress you with their moves is fun, this place is for you.  For what it is this place is the best, in the City, in the State, and is comparable with  the best blues bars in the South.  We are damned luck to have this place and it deserves our appreciation, and it deserves our respect.  My thanks to Myron Mu for keeping this tradition alive.", 
    "review_date": "2011-12-10"
  }, 
  "Lb37hatAjI3fgHEh2lMNEw": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Josh K.", 
    "review_text": "It always seems bad from the outside. The Saloon has the smell of 100+ years of dried up beer and vomit. The barkeep is kind of mean. The bathroom needs to be buried underground for 200 years before it should be used by any man or woman.  But hey, it's not all bad. The blues are amazing and well worth the cover. My recommendation is to get sloshed for $2 a pint at king of thai noodle house next door first, then come over here and you'll be drunk enough not to notice the smell or want another drink. If you need to pee.. go back to KoTN... please.  P.S. Watch out for the cougars. My friend damn near hooked up with one of them.", 
    "review_date": "2010-11-17"
  }, 
  "-aUOAVRvdLnryQLI4tY8LQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yelena K.", 
    "review_text": "This place is the oldest bsr inn San Francisco and one of the oldest bars in the US. It survived earthquakes, fires and the Prohibition and it definitely looks and acts the part.   The bar, with the wooden panels and mirrors, makes me think of Al Capone time, as if you stepped through a time machine door and are now in the 20s. When you walk inside, it has that 'bar' reek, and to me that's just another sign of authenticity. The staff is laid back (gotta love their 'bouncer'), and the crowd is cool. Nothing pretentious, everyone is just having a great time. The music will make even the squarest of squares get on the dance floor and shake that flat booty of theirs. And the drinks? Stiff, overflowing, and cheap. This is one hell of a place!", 
    "review_date": "2011-01-29"
  }, 
  "s5XJsJNNI944pvNKsb_OeA": {
    "user_rating": 3.0, 
    "user_location": "Carmel Valley Village, CA", 
    "user_name": "George C.", 
    "review_text": "The oldest bar in San Francisco. We had to see it. It looks like the oldest bar in the city. Might even be the original paint and floor coverings. There was live, wild Blues happening when we walked in. Lots of local customers; we stood out as tourists. We visited a few minutes but left. Not our kind of place.", 
    "review_date": "2013-06-04"
  }, 
  "1D5EQITb4hOzPMZT8gDPQQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krista S.", 
    "review_text": "I was dragged here the other night by some friends who were meeting people at The Saloon. My first impression... gross. The place was full of old people dressed in leather and smelled as old as it claims to be. Honestly the place just kind of left a bad taste in my mouth.  That being said, one star for the jazz band playing in the back and one for being the oldest bar in SF.", 
    "review_date": "2008-12-24"
  }, 
  "nYufXwZH9ooB_zjNJf8Xlg": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Morris D.", 
    "review_text": "Never had a bad time here..more of a stop as opposed to a destination, don't set your expectations too high and you'll have a good time. I'm not a big fan of live music, but I find the bands here to be kind of funky and worth checking out especially since they aren't too loud usually. FYI-it's pretty divey and I don't even think they have a TV so keep that in mind as well.,,", 
    "review_date": "2011-05-22"
  }, 
  "cU1n3tkLPW67R8gcfyQtrA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark H.", 
    "review_text": "For me there is a very good reason to come here on a Saturday night.   Ron Hacker, the 65 year old blues guitarist with his band .He plays here once or sometimes twice a month and for $5 you can see and hear this genius. He does a couple of sets starting at 9.30 pm and at the end of each set you can buy a c/d or book by him or even a t-shirt , if you ask politely he will sign your souvenir.  The grisseld  barmen pour a quality drink and are more than fair to one and all.  Check the calender and visit this bar and hear Ron Hacker. It is a privilege.  <a href=\"/redir?url=http%3A%2F%2Fwww.sfblues.net%2FSaloon%2FSaloonschedpage.html&amp;s=d29759efd31da64fa78278f02876e69eca20100fd74c384f219815b834dd6823\" rel=\"nofollow\" target=\"_blank\">sfblues.net/Saloon/Saloo…</a>", 
    "review_date": "2010-08-20"
  }, 
  "BGdFcjoXSDfVRWMgaOOgaw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J. H.", 
    "review_text": "awesome music, great atmosphere, real people, and it scares away tourists. FUCKING AWESOME BAR.", 
    "review_date": "2008-06-12"
  }, 
  "G3QxRKxd0AdzcHyXjPETEA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chrissy S.", 
    "review_text": "I have a love/hate relationship with The Saloon, but mostly I love it.    The love part comes from the live music, and the hilarious people who dance around in front of the stage and don't give a shit whether they look cool or not.  They're just having a good time, and that's exactly what I can't get enough of!    The hate part comes from the long narrow bar area... if you get squeezed in against the wall in that area then it just sucks because you are constantly being pushed up farther against the wall by people coming in and out.. but whatev, it happens.  Also, if you enjoy getting hit on by much, much older people, then this is your spot!  But don't worry, it's all in good fun.  Everytime I come here, without fail, someone in my group gets hit on by someone who is old enough to be our parent.    Bottom line is that The Saloon has lots of character.  The drinks are cheap, the music is fun, and the crowd is eclectic.  I've heard something about it being the oldest bar in San Francisco.. and it definitely looks like it.. in a very good way.", 
    "review_date": "2008-04-08"
  }, 
  "3Ttx_EwurF4tVRn723SIjw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "LaSha G.", 
    "review_text": "I feel a little bad about writing this review because  I've only been here once and it was with a co-worker, it was almost 3 years ago when I worked in the financial district and felt the need to drink heavily and often, and I was so completely hammered when I finally made it here that all I hardly remember being there at all.    But with all that said, I do have a general memory of having a damn good time.  This is my kind of dive--  small, non-touristy (although the patrons are a little on the old side), limited selection of alcoholic beverages (which makes ordering easy for me), features a blues band (with some sort of obvious Southern influence), and has enough room on the dance floor to drunkenly grind with someone in a very offbeat manner, but not too much room on the dance floor where you could easily make a spectacle of yourself.", 
    "review_date": "2008-04-05"
  }, 
  "t-MrwBJmAbxHf4n3-AHO7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin G.", 
    "review_text": "This is seriously one of the best bars in the city.   It's no meat market, it's there for people who want to enjoy kick ass music in a cool atmosphere.  I have seen amazing blues, rock, and rock-a-billy-esque music there and have always had a blast.   Everyone that works there looks like they are from the gold rush (in a good way).  The place makes you want to drink whiskey all night (or their cheap busch) and take in the great tunes.    This place is like a cool test; if you like it, you are cool.  If you can't hang, I don't ever want to be your friend.  Seriously.  If you are looking to spice up your night, on a date or with a group of friends, the saloon is the place to be.  Don't forget the cash my friend!!", 
    "review_date": "2007-08-04"
  }, 
  "Rrj11KKFTDPpjhFlxU7Z6A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anthony Y.", 
    "review_text": "This bar pretty much sucks unless you are old, like bad music, like bad bartenders, and like being packed in like a sardine.  My parents love this place.", 
    "review_date": "2011-11-22"
  }, 
  "YE6MfcqTdqrqPgubWfYJ4g": {
    "user_rating": 4.0, 
    "user_location": "Providence, RI", 
    "user_name": "Rob K.", 
    "review_text": "Great place - one of the best blues bars in the entire country.  I got to see Danny Castro perform here when he recorded his live CD a few years ago - talk about electricity!   If you don't know who Danny Castro is, think Stevie Ray Vaughn meets Eric Clapton with Buddy Guy and Albert King thrown in for extra flavor.  He plays here once every few months and it is always packed to the rafters.  The bar guy Huck pours a mean drink and the door guy Greg makes sure that everybody plays nice.  Guys, watch your head on the way down into the bathroom, if you're over 5'4\" make sure you duck.", 
    "review_date": "2006-11-08"
  }, 
  "PhD6RYScGomuiFvoKjb39g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany S.", 
    "review_text": "The Saloon is a wonderful place, its my favorite bar in San Francisco. The majority of the time there is live music playing, day or night. Anywhere from blues, jazz, rockabilly, &amp;soulful women singing. There is a mini dance floor, the drinks are decently priced. You can definitely go into this bar alone and just chill out while enjoying music; without having to worry about anyone bothering you. Its the perfect place in North Beach to escape the young yuppie crowd. You'll only encounter the elderly, or strange looking people in here &amp; its fantastic.", 
    "review_date": "2012-02-06"
  }, 
  "mRK9h-zY6I3gGt4fxh11MQ": {
    "user_rating": 5.0, 
    "user_location": "Irvine, CA", 
    "user_name": "George U.", 
    "review_text": "I love blue's bars, and I've been to them in Chicago and Los Angeles, but this one ranks up there among the best.    The drinks were stiff and the music was popping.  I didn't have a dull time here and everyone is down.  I love this place!", 
    "review_date": "2010-03-21"
  }, 
  "X-vuPnCWGMRoV3DP7cV0DA": {
    "user_rating": 5.0, 
    "user_location": "Rancho Cordova, CA", 
    "user_name": "Jenny M.", 
    "review_text": "I always enjoy exploring new places when I visit the City. We came across The Saloon yesterday and were temped to venture in because of the lively sounds of Blues music. The drinks were cheap and strong. Huck, the bartender, was amazing! I enjoyed seeing all walks of life enjoying good music. I look forward to coming back on my next visit.", 
    "review_date": "2013-06-08"
  }, 
  "5v6juPIOisfmogp7QSso-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick S.", 
    "review_text": "Dating to 1861, this is amongst the oldest drinking holes in the Bay Area. It's a mix of bikers, blues fans, and genuine characters. There is often some great live music. The bar (with PBR on tap) is cash only. The bartender is a prick. This place quickly gets crowded, so it's better to show up early.", 
    "review_date": "2015-01-24"
  }, 
  "MV7ItoAJaiDpBvdLl8dMNQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M R.", 
    "review_text": "The ultimate dive bar.  Live music.  Ridiculously cheap drinks.  The bartender and guy outside the door checkin ids both look like they've been working there for decades, and they still seem to really enjoy it.  Although, since it is a little hole in the wall and with the live music blaring, it is nearly impossible to hear the person you're talking to.  Overall, a cool place.  Drinks: 4/5 Ambiance: 5/5 Service: 3/5", 
    "review_date": "2012-05-06"
  }, 
  "VuNAe_FRVRn348KbM0Fknw": {
    "user_rating": 5.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Sandra L.", 
    "review_text": "had a great time here! stayed for at least 3 sets of this amazing blues band! bartenders were on point and the dance floor was on fire! I am def coming back next time I'm in San Francisco!!", 
    "review_date": "2014-12-19"
  }, 
  "Un138zBMZ-FviGziY9oLFg": {
    "user_rating": 5.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "kevin b.", 
    "review_text": "GREAT1 I love THIS JOINT1", 
    "review_date": "2010-09-14"
  }, 
  "B4cJvWuf59j7XlTdexnVZw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Marc S.", 
    "review_text": "The ultimate dive.  Old-school bar opened in 1861.  Some real history at this place you can feel in the walls.  I go by this place nearly everyday and think that they must have a special homeless person discount from the characters hanging out outside.  The place has some cheap drinks and live blues music some nights that I think might have a small cover or drink minumum some of the time.  It yuppifies on weekends, so you must go on a weeknight, to really get the true experience.", 
    "review_date": "2005-04-08"
  }, 
  "gILPvBzdDQjVGt6gIdLrew": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Max T.", 
    "review_text": "what a place! steeped in history! an SF classic!", 
    "review_date": "2010-09-14"
  }, 
  "cNqpVwQu8bB6sqTua8Wd5w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexa M.", 
    "review_text": "This place was hilarious considering i looked twelve compared to everyone else. It's cool if you enjoy old school blues and are in hopes for finding some of your old high school teachers. Age range: 31 to at least 110. Yes, 110..i saw Yoda. Thank God I didn't run into my dad.  I'd definitely come here when i'm a Gilf!", 
    "review_date": "2009-02-07"
  }, 
  "9rqJpba4GRF0TZEAdqrvKg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Noir L.", 
    "review_text": "It's truly a San Francisco institution. The place is well over 100 years old.  The bar tenders are old, the band is semi-old, furniture is old...everything is old, except the booze. Drinks are small, comparing to the standard sized drinks you can get at a regular bar, but they're cheap. Two rum and coke, with tips was $9. AND they are were not shy about giving you a bit more rum than coke. The band was great. The night I went they were playing some classic rock. People there are more of an older crowd, but friendly. Stop by when you're around north beach, the experience of bringing back the old good days is worth the trip.", 
    "review_date": "2012-11-28"
  }, 
  "W64mp57Bv35yn269fPGlCQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa S.", 
    "review_text": "Was excited...went for my birthday.  \"Was\" is the key component.  We got there with a group of 8 or so, at around 8pm.  Ordered a few rounds of weak drinks until 9:30 when the bouncer came by and said if we wanted to stay the cover would be $5.00 to see the band.  I did not have any cash on me at that point and my fiance` was in the restroom which I explained to the bouncer.  He came back 5 min later demanding money from us and using several curse words in the process. This was the first encounter my fiance had with the bouncer who said \"what the f---- are you going to do? pay or leave?\" We said we were going to finish our drink, at that point the bouncer had the bartender come over from behind the bar to let us know (my finace` and I) that he would no longer serve us until we gave him $5.00.   Mind you he had just gotten back from the restroom and he had no clue what was going on, this was his first interaction with the bouncer.  Based on principal we did not pay and reminded the bouncer that we were paying customers, with a group of 8 that had been buying drinks for several hours before the cover began.  I have never been to a bar that demands a cover from patrons inside before the posted time on the door when the cover takes effect, nor have I ever paid $5.25 for such a weak pour and lastly I have never been treated so poorly in a bar where I was gladly spending my money.  I would not have hesitated to support local talent if we hadn't been instantly treated with such hostility.", 
    "review_date": "2010-09-05"
  }, 
  "ey-4MP3wXg9byW4QFj2_dg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kimberly K.", 
    "review_text": "after partaking in a bar down the street's middle aged rock and rollers playing covers of the killers, my friends and i stumbled wearily into the saloon after a drunken woman began a conversation with us outside .  she was convincing enough for us to go in, and man, was i glad drunk lady did.    real blues with people who really dig the blues. you couldn't help but move to the music.  sooo good.  a great hole in the wall with interesting characters, fun laughter, and good music.", 
    "review_date": "2007-01-07"
  }, 
  "z9sL9d4kfAiQeGJ1dGmBng": {
    "user_rating": 3.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Allison B.", 
    "review_text": "The only beer on tap is PBR. There's live music, a funky crowd, and the floor reeks of urine. That's all you need to know.", 
    "review_date": "2012-06-11"
  }, 
  "tkubnXf8x7DkfMI6b11VMA": {
    "user_rating": 3.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Veronica B.", 
    "review_text": "Total Dive Bar in North Beach. Went on St. Patricks day, Crazy!!!! This is a small bar. If you go, dont go alone, and try to go with at least a small group, may need the back up. Good luck!!!", 
    "review_date": "2012-10-21"
  }, 
  "afCyyz9-4UaT9RQqCkoCCg": {
    "user_rating": 4.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Clara S.", 
    "review_text": "Stumbled upon this gem  walking to my hostel. Great music didn't mind paying $ 5.00 cover.", 
    "review_date": "2014-11-29"
  }, 
  "bmFdLS5PddDOCsE7ICo79Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Malin P.", 
    "review_text": "Best bar in the city, hands down. The strangest and most fun. Only place you can dance to Johnny Nitro and The Door Slammers, BS with Greg the doorman, get served a Bud Light by the Angel of Death and smoke weed with Roy in the alley while Wille plays the harmonica - all in one night. Not to toot my own horn or anything, but they used to play Good Golly Miss Molly in my honor, even though that is not my name. GO! You get used to the smell after like a minute.", 
    "review_date": "2005-10-05"
  }, 
  "ctHYJSdfkdq_2ZrsqEFN8Q": {
    "user_rating": 5.0, 
    "user_location": "Baltimore, MD", 
    "user_name": "Casey C.", 
    "review_text": "This is one of the coolest dive bars I have ever been to. I was there on a Sunday night but they still had a decent live band. Great mix of people from young to old and the bartender was great. Oh, and the drinks are CHEAP!!! Mixed drinks were $3.50 and I got a shot of Glenlivet 12 yearr for $6.50! That is unheard of for SF, I haven't even seen those kind of prices in Baltimore. Cash only.", 
    "review_date": "2013-05-06"
  }, 
  "2HUQjb9aOyFdkJTe-yyCig": {
    "user_rating": 5.0, 
    "user_location": "El Granada, CA", 
    "user_name": "Ottis M.", 
    "review_text": "Well, I decided to quit drinking a couple of decades ago (thank God!). But on my last night out where did I want to have that last drink?  That's right, the Saloon.  Ah, the dentally challenged bartender. Loved the sign on the door saying no illegal drugs in the alley.  Loved the haggered patrons wearing original (not vintage) Jefferson Airplane t-shirts telling stories of being wasted with Carol Doda. Loved the teasing whiff of vomit coming off the patron next to you.  Loved the drunk girl crying at the end of the bar because she lost a contact lens.   Man, am I glad I quit drinking..... But this place is a great spot to have your last one!", 
    "review_date": "2014-02-24"
  }, 
  "kwLjahEd7YrUHS2c84JfAw": {
    "user_rating": 5.0, 
    "user_location": "Portland, OR", 
    "user_name": "Tracy D.", 
    "review_text": "My favorite bar anywhere. Great blues, great crowd. RIP Johnny Nitro. \"Drinking triples til we're seeing double. Feeling single, and gettin in trouble!\"", 
    "review_date": "2013-10-10"
  }, 
  "0bld5wk4ezKDbM1qEM1rHg": {
    "user_rating": 3.0, 
    "user_location": "Cerritos, CA", 
    "user_name": "Kristina L.", 
    "review_text": "Ended up here while waiting for our table at the Stinking Rose.   Drinks are cheap Dive Bar Sweaty Crowded   **Four stars because drinks are cheap.  Didn't really care for this place but a dive bar is a dive bar so I don't think it deserves to get any points knocked off for it.", 
    "review_date": "2014-05-14"
  }, 
  "nsawcqioX0NDmqsDsM8L4w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Po L.", 
    "review_text": "If you want a place that has the heart of San Francisco look no further.  This place smells as old as it is.  If you are looking to hook up this is not the place for you, unless you like older folk.  This is definitely a locals bar with a very heavy emphasis on music.  If you are in the music scene this is your kind of place especially Jazz and blues.  Andrew, a local, will greet you at the door.  Cheap strong drinks Street parking (which can be hard in N. Beach, try the public lot on Vallejo between Columbus and Stockton) Small Dance Floor Great mix of people Great music 5 Stars for the history this place has", 
    "review_date": "2008-06-12"
  }, 
  "GHQcMkEgiQesfl_2KA8LzA": {
    "user_rating": 3.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Emile K.", 
    "review_text": "Total dive with great prices on drinks.  Always good music.  Got to go if you like dives or blues or cheap drinks or loose girls. ;)", 
    "review_date": "2014-09-02"
  }, 
  "fGkpW1GpmRUQ4E3vEJTn8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sara H.", 
    "review_text": "This is one of my favorite bars in San Francisco!  It's a little gem of a hole in the wall dive.  The bartenders and the regular customers are characters who all have a joke or story to tell.  The music there is usually pretty good and it's so much fun to watch people dance or to get on the dance floor yourself!", 
    "review_date": "2006-10-14"
  }, 
  "Jd1XHglA85pI3H1gXwzwfw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trace D.", 
    "review_text": "This place is dirty, dank and fan-frickin-tastic. The drinks take a wait, especially if it's busy, but everyone waits equally long in the end. The other bar patrons are friendly and loquacious, both with their friends, the bartender, and strangers. The night we visited the band was hoppin' there was dancing and carousing, cabs kept dropping people off at the door and still, no line and no cover. Amazing!  I overheard one of the regulars say this was the busiest they'd seen it in a while, so I can only assume the place is usually far more empty, but I've been in more crowded bars for sure. Highly recommend this joint. Super fun.", 
    "review_date": "2014-01-25"
  }, 
  "Desi-Wiz2gwPLWMXP10Bvw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy E.", 
    "review_text": "The drunk bartender was making googly eyes at me as he mouthed the Billy Holiday song playing in the background and poured our drinks. Yes, we all know this is the oldest bar in SF (with Little Shamrock in the Sunset coming in 2nd) and it is a real dive - in a good way.  I was surprised to see young cute girls arriving the entire time we were there. It seems like a place for old san francisco, you know the down and out and drunk. However, Saturday night it was filled with some real cute girls and several groups of them. I think the bartender was very pleased by this. There was a rock and roll band setting up in the corner. We finished our round of (super cheap by the way) drinks and went on our way. This is a spot we always take out of town guests as it is a real glimpse into the past.", 
    "review_date": "2007-04-02"
  }, 
  "ksonr4xKjpmznXtf_rB2jg": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Kevo M.", 
    "review_text": "The other roomie invited us to watch 'The Eye of Newt' perform at The Saloon last night. Her friend plays the bass in this band and they were performing because of the Blue Bear event. Of course I yelped the Saloon before heading out and read the reviews of it being the oldest bar and smelling like a urinal, but we forged ahead in support of the Newts.   All I can say is that the decor is very interesting. The woodwork was clearly from a bygone era. The bar mantle was dark, appearing smoke stained. Then you notice the faux Christmas tree changing colors from blue to red to pink. And then you see it...a little statue of Amida Buddha above the stage.   There and then you know you're in another world. You're not in San Francisco 2007. You're not even in San Francisco 1950. You're just in another world.   The staff appeared to be rejects from a biker gang complete with long hair, long ZZ-Top beards of grey, and an intoxicated swagger. Johnny Nitro from the Blue Bear School of Music also fit right in.   There was an eclectic mix of patrons that ensured you were either in another world or on acid. There were young hotties hipsters that looked barely old enough to drink. There was a late 20's preppy crowd. There was the hippie looking guy with lace up moccasin boots that didn't match the rest of his apparel. There was a gaggle of older gentlemen who appeared to be there by themselves in their late 40's. And then there were the 70+ crowd that could only have been from the neighborhood. There was a lady who pushed her way past the crowd with her 4'-0\" structure but built like a sherman tank. (Literally) She looked old enough to have opened the bar. And lastly there was the guy in his 50's who stumble out of a cab, mug still full of beer, who could barely talk much less stumble in to the bar. I later saw him hitting on two of the vocalist from the Eye Of Newt. He took the rejection well.   The shots that we got were disappointing. Watching the bartender mix them, he looked like he was still tweaking. He told the drunken one that our friend, \"has great bar tits\" (whatever that means.) Yeah whatever dude. tittays or no tittays, It still took you 10 minutes to get our THREE beers. She might have shown them to you had you got our beers right away.   I know it is supposed to be a dive-bar but it's more like a sunk-durring-the-spanish-inquisition-by-a-cannon-­ball-and-featured-in-the-pirates-of-the-caribbean bar.  If nothing else I can say I drank once at the oldest bar in SF. If that's not enough I can say I drank in the oldest bar in SF and there were Christmas lights, a faux Christmas tree, and a buddha.   4 stars for being smart enough to have Blue Bear and the Eye of Newt perform.", 
    "review_date": "2007-04-23"
  }, 
  "0Chi_CzoTmkw1NvZg0sksg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jennifer B.", 
    "review_text": "Even before it got crowded, this place smelled like a wet homeless cat in heat.  Totally old school and unpretentious, with grey-haired bartenders serving drinks with the shakes, this place has an authenticity people are constantly looking for to exploit and reproduce into a cleaner facimilie.  Not so here, this place clings doggedly to its rugged homeliness.  It's of course cash only and cover-charge-free.  You can hear yourself some gritty blues, drink yourself some strong, cheap whisky, and meet yourself a crazy crosssection of people.", 
    "review_date": "2008-06-10"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "Great music in an old bar with good beer, although I prefer the weekdays to the weekend here...", 
    "review_date": "2006-03-12"
  }, 
  "wRflYcdeaiXE222-hFspdA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt J.", 
    "review_text": "Their claim to fame is that they're the oldest bar in San Francisco. I believe because they're one of the most divey bars in San Francisco that I've come across, which is good thing for me and if you're into dive bars. There's usually good cover band playing, so it's a good place to dance the night away for not as much money as you would pay at a club.", 
    "review_date": "2013-02-13"
  }, 
  "tVwvcuC-mIY53uT_utM_BA": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Devon M.", 
    "review_text": "This place is hilarious.  From the bartender to the people at the bar, everyone has character.  Great music and cheap drinks make me happy and that is exactly what this place has.  Come check it out!", 
    "review_date": "2007-06-29"
  }, 
  "5pp0gsA97_1AazCzmzUYQQ": {
    "user_rating": 5.0, 
    "user_location": "Port Hueneme, CA", 
    "user_name": "Anthony C.", 
    "review_text": "Probably one of the best nights I have ever had in the city!! The husband and wife combo of bar tenders was beyond amazing!  The $5 cover was well worth it because they pour strong!! Please come out!!", 
    "review_date": "2014-12-20"
  }, 
  "iHwqxEYgwk6G3aMwGsaQGQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James B.", 
    "review_text": "This is a gritty blues bar. Stay away if you don't like the faint smell of piss and beer worn into the woodwork. The age and history of this bar is readily apparent. I always find myself slinking away from my friends to wind up here diggin blues with the old men. Quality Blues acts and the history of the place make it the best bar in SF.", 
    "review_date": "2010-06-25"
  }, 
  "DRvGPMHi1tE5gxrfiCFQww": {
    "user_rating": 5.0, 
    "user_location": "San Pedro, CA", 
    "user_name": "Marc C.", 
    "review_text": "When I thought I had already found the best jazz and blues place, I was brought to the Saloon.  On their website you can more or less find out that it is the only place in SF that survived both the earthquake and the fire -- the firemen saved the building to protect the hookers upstairs.  That may be the root of the lingering odor reported by almost everyone reviewing this place.    So with such a reputation to live up to, I go there.  Don't be afraid of the guy at the front door -- he's management.  The cool thing about this place was what I saw over the course of two consecutive nights.  On the second night, everyone that was working behind the bar was on stage, and everyone on stage was behind the bar.    Seeing the sax player come into the crowd then jump on the bar, and play while the bartender rushed to clear all the glasses as she tromped down the length of the saloon was amazing.  Either you like it or you don't.  5 Stars for me.", 
    "review_date": "2008-07-09"
  }, 
  "24yhVSA9aZ8vgEzIE_dDOw": {
    "user_rating": 4.0, 
    "user_location": "American Canyon, CA", 
    "user_name": "Eric M.", 
    "review_text": "Great place to hang out on a Sunday night. Listen to a bit of Jazz from a live band and have a few drinks. Nice atmosphere has the old dive look and feel, mainly because this is the real mcCoy! I agree with the other post of a strange smell inside, but I figure since it is the oldest bar in SF and used to be a Whorehouse as well, the whole thing add character funky smell and all. :) It is a must see.", 
    "review_date": "2009-10-14"
  }, 
  "UiX4CR188mjByb8GeI8jYQ": {
    "user_rating": 1.0, 
    "user_location": "Montara, CA", 
    "user_name": "Neil A.", 
    "review_text": "This is a shit hole even for a dive bar.....  Great location and I'm normally a dive bar fan but this place just blows.  We ran into some wanna be biker dudes who called themselves regulars.....  complete D-bags.  Two taps at the bar and one was kicked.  For Christ sake how hard it is to properly manage the beer inventory when you only have two stinking taps??  And what is with the geriatric bar queen dressing like she's 25?  Very disturbing!", 
    "review_date": "2011-02-06"
  }, 
  "4CPPBkXxL12I5WhzVrzdOQ": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Meghan G.", 
    "review_text": "From Chicago on vacation and we wandered into this gem. Cash only but cheap and they pour em stiff. Perfect place to stop for a few beers after walking around San Francisco's steep roads. Smells likes it's SF's older bar, because it is. If you're in the area and need a relaxing stiff one, be sure to wander into The Saloon!", 
    "review_date": "2014-10-22"
  }, 
  "gjh6da4yHahEpQ73O6DX_Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Albert W.", 
    "review_text": "This place is legit.  From its humble beginnings in 1861, this bar has come a long way to become the oldest bar in San Fran.  It was once even a whorehouse for some time!  It probably got its name because it was THE saloon in town when it opened.  A bunch of locals, music lovers, and dive bar aficionados are the primary clientele here (although our hero hears this bar makes it into some travel guides to attract brave tourists too).  There's definitely a very aged and classic feel to this place and the bar has probably been stained with more alcohol over the past 150+ years than our hero has had in his lifetime.  The locals will pipe in with some stories as well if you ask them.  Even our hero's straight laced friend who'd never been to a dive bar before loved the bar.  Finding broken glass lying around the place on a Sunday morning from what must have been a wild Saturday night beforehand only added to the divey charm of this fine establishment.  PROS: - Historical significance of being the oldest bar in town. - Super cheap drinks.  CONS: - They only have two taps and one of them is PBR. - The beers are served in somewhat small glasses here (perhaps only 10 ounces or so)", 
    "review_date": "2012-12-17"
  }, 
  "OADwxJqXxuI30aB8HvI9QA": {
    "user_rating": 5.0, 
    "user_location": "Tombstone, AZ", 
    "user_name": "Debbie C.", 
    "review_text": "My boyfriend and I were out wandering North Beach for dinner and he spotted THE SALOON across the street from The Stinking Rose (where we had a great dinner).  He had heard that it was one of the best blues bar in the City.  We passed up several bright lit snobby wine bars that day in the City and landed in this oh so divey bar!  What a blast!  Eugene Huggins was playing that night.  We danced our asses off!  Awesome band.  The blind guitarist was phenomenal!  Beers were only $3.50 and no cover charge but be sure and tip the band - they deserve it!  Yes, it's what all the reviewers said before me - dingy, old, scruffy, all walks of life, but intimate, cozy, cold beer and great music.  Ultimate biker bar!", 
    "review_date": "2008-12-29"
  }, 
  "dGy6LmfgfJyftpcHVkPtEw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick B.", 
    "review_text": "Man I felt like crap earlier. Just that life kinda sucks - I need to punch a hole in the wall - type of feeling. As I like my walls without holes I figured I needed something else to take my mind off of things. Booze and Blues? Damn straight.  The best thing about the Saloon is that you can just show up and relax. No primping or fancy dress code needed (not that anyone would notice with the lighting inside); which was good because I was dressed to drink.  Dave Workman (who is just incredible) was laying it down. Exactly one shot and a beer later everything worked into a nice, warm fuzz while the music took the edge off my day. I don't know why people complain about the smell in other reviews. Maybe they just aren't drinking enough? It doesn't really matter. Everything else about the bar outweighs a little odor. It can't be any worse than having some guy in a club, who bathed in Calvin Klien, standing next to you.    After another few glasses I had forgotten why I was pissed off earlier and that is why I love this dive.", 
    "review_date": "2011-09-10"
  }, 
  "Jj5tQCKCQqOTv9H_nwxJng": {
    "user_rating": 4.0, 
    "user_location": "Anaheim, CA", 
    "user_name": "Miriam B.", 
    "review_text": "Man I had been wanting to go to a blues bar/lounge for the longest time.  And this place was one if a kind.  There was a cover charge to get in and they had a live band!  Once I heard the music it was non stop dancing.  The bartenders were awesome as well as the crowd.  The only thing is that the dance area was small.  The whole place was packed.  But that won't stop me from coming again.", 
    "review_date": "2014-11-30"
  }, 
  "97BHRNfBqubPqisKmj46Ww": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clark G.", 
    "review_text": "have never had a bad time in here  an institution as the oldest during the gold rush and surviving the 1906 quake  great live music, small but cheap drinks, filmed in many movies and attracts all sorts of folks", 
    "review_date": "2013-01-12"
  }, 
  "yfG8hiLv0mA0ltTNXERuYQ": {
    "user_rating": 3.0, 
    "user_location": "McKinleyville, CA", 
    "user_name": "Roxanne S.", 
    "review_text": "I love the live music, I love the story that it survived the earthquake, I love how it's small but there's still always some how room even when it's packed with people.  I don't love being treated like an idiot when I ask for a rum and diet coke. Is that really an unreasonable request? If all you have is regular coke then just say it, don't treat me like a jerk and ask \"Why don't you just want a whiskey on the rocks, little girl?\". It was almost embarrassing.  I will probably be back because overall, I like the place, but I'm never asking for anything more than a beer....and will probably make my Husband order it if that same grumpy bartender is there that obviously didn't like a younger looking woman in there.", 
    "review_date": "2013-02-23"
  }, 
  "Q2RsDOhzsCBI-F1oOPe6Lg": {
    "user_rating": 2.0, 
    "user_location": "Pittsburg, CA", 
    "user_name": "Chanelle N.", 
    "review_text": "This place has the WOW factor not so much in a good way. It's truly a saloon. I think it's been here for about 100 years or so.   I've only been here once to judge but it only had one bartender. Plus, there is a designated area to order your drink. Oh, and you can only pay in cash. No music this day I was here, either.   The bathrooms are ancient and confusing. Kinda threw me off.   I just don't want to go to a bar with so many rules to follow. I'm trying to have a good time and not have to worry. Too many other cool places in North Beach to spend too much time here. It's conveniently located on a corner near Columbus but just keep it moving, trust me!", 
    "review_date": "2012-04-04"
  }, 
  "LinyuVqOeiK-nydF3zZrtA": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Bif P.", 
    "review_text": "Great place to hang grab a cold beer and watch some music. Great crowd , nice people.", 
    "review_date": "2012-01-17"
  }, 
  "UMD3tXY7byF8JaOmpTUoDw": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Prescila B.", 
    "review_text": "Free, LIVE music that doesn't suck?! YES PLEASE! We popped in (no cover charge!!) and watched some kick ass rockabilly band playing for small but happy crowd! Cant wait to go back when we can stay longer!!", 
    "review_date": "2014-01-23"
  }, 
  "ApPUuJweItyHwmnHFQVArg": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Heather L.", 
    "review_text": "The oldest bar in SF and it is still serving up cheap drinks, clean ladies room, charismatic \"regulars\" and great live music.  What else can you ask for in a dive?", 
    "review_date": "2012-06-10"
  }, 
  "rde2134fSeCMWd7w0ZPctg": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "greg d.", 
    "review_text": "Damn this place is fun. A solid LIVE band, that's right real musicians, playing real music in a place that is there so you and I can enjoy some good live music, have a few drinks and have some fun.  It's an intimate place, with the front door open, people all over the place and the band shoved in the corner, cranking away on the some great blues, R&amp;B, rocknroll, whatever...its all good.  What I think is really great about the place is that it's an honest to goodness bar that has live music nightly and does not pretend to be anything but a simple bar with good, live music.   So, you might need to duck or move out of the way quickly to avoid a brawl...Not easy to find anymore, but The Saloon has been doing it for years. Thank Goodness!", 
    "review_date": "2008-03-22"
  }, 
  "4EJCDH9ptP-js_TXY1nGyw": {
    "user_rating": 5.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Jessica M.", 
    "review_text": "So the answer to your question is yes I absolutely love Jazz and The Blues.. This is the perfect place to be, outgoing friendly people, warm setting, casual flirty dressy place. A lot of regulars, and new people searching for a place where they could take it easy going and still have a good time!  I guess you'd obviously have to be very open minded to end up here. The setting is very old fashioned, bring cash!", 
    "review_date": "2012-08-06"
  }, 
  "1I1Zr6yuTkyPRiqe8qD5Ow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sabrina L.", 
    "review_text": "The saloon gets five stars because it's a SF institution. It's SF's oldest bar, been in the same spot for 150 years. It's got a beautiful old wooden bar, good drinks and prices, a great older crowd and great live music, what else can you ask for. It's not a huge place so it can get pretty crowded, so be prepared.", 
    "review_date": "2012-07-04"
  }, 
  "QwMbQmeywX9cAb60T9TG5w": {
    "user_rating": 4.0, 
    "user_location": "Campbell, CA", 
    "user_name": "Christie B.", 
    "review_text": "Total Dive bar in every sense of the word. But great music and a really great crowd. The restrooms were even cleaner than I expected. My husband and I had come here during our anniversary weekend and had a blast. We'll be back for sure.", 
    "review_date": "2010-05-17"
  }, 
  "Z-5WllyN_Pb8CrYNR0gZyg": {
    "user_rating": 4.0, 
    "user_location": "Edgewater, FL", 
    "user_name": "Chad P.", 
    "review_text": "Very cool little bar that has cold PBR on tap. Make sure to come when a band is playing. It's a lot more fun.", 
    "review_date": "2011-03-16"
  }, 
  "VEgMc0Jat_HMTrnQ3ZWnEw": {
    "user_rating": 4.0, 
    "user_location": "New Haven, CT", 
    "user_name": "Amy M.", 
    "review_text": "Cash only.  Was in SF for the weekend and my bf and I met some of his friends here.  I agree with others the music is so loud that you cannot hear the person next to you which can be a good thing from time to time.  I really enjoyed kicking back with a beer and listening to the awesome live band.  This place oozes history.  Definitely a place I would like to visit again.", 
    "review_date": "2012-05-15"
  }, 
  "ODSH1it5oAUPu2clIgOvyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phan H.", 
    "review_text": "Awesome little place with live music. We got here just in time for last call and a few last songs. The crowd here is older, but definitely a fun crowd, including the bartender who was having more fun than I was! Cool place to come hang, watch a live music performance, and do a little dancing.", 
    "review_date": "2012-03-03"
  }, 
  "eurIEcpGa_tTi1LMWa1pUA": {
    "user_rating": 4.0, 
    "user_location": "Lufkin, TX", 
    "user_name": "Wes T.", 
    "review_text": "Nice crowd, if not a bit funky at times ... Decent selection of brew on tap and good staff. My date wanted hot tea and he gave it to her for free. You earned a big tip, my friend.   The place oozes history (which is a clever way to say that it smells funky sometimes), and it was featured in a movie with Reese Witherspoon! Could you ask for more?", 
    "review_date": "2006-12-23"
  }, 
  "wVpwTZ0ynSgHWn_tgzx2vg": {
    "user_rating": 3.0, 
    "user_location": "New Orleans, LA", 
    "user_name": "Kerry P.", 
    "review_text": "Alright scratch that.  After living around the corner from the Saloon for months now, I am totally OVER the hoards of drunk people pissing and shitting and puking and doing god knows what else all over this corner.  I get it, ok?  \"It's funky, it's a landmark, it's old school\"  IT'S NASTY.  I'm sick and tired of stepping over all the drunk people passed out in the ally outside of this place.  Oh I'm sorry to wake you from your beauty sleep, Mr. Passed-Out, Strung-Out Saloon Patron, but you seem to be face down in the blacktop.  JEESH. ******* I live around the corner from The Saloon, and I'm always amazed at the amount of drunk people outside at any time of the day, seven days a week.  Great music, affordable drinks, and definitely not your everyday crowd of bar patrons.  There's surprisingly a lot of space inside too.  Definitely a funky place.  I lived in New Orleans for 4 years and The Saloon definitely has a Big Easy feel.", 
    "review_date": "2007-08-10"
  }, 
  "fYX66QrOI6OGTWaUhNkprQ": {
    "user_rating": 3.0, 
    "user_location": "Fullerton, CA", 
    "user_name": "Marilu R.", 
    "review_text": "i was told that this place is the oldest bar in the city and back in the day there was a brothel upstairs. i thought cool. old dive bar filled with the ghosts and whores of Charles Bukowskis'. i just had to check it out. especially, since i'm a fan of dive bars. so i dragged along my sister and friend.  as i walked up to the door, the ghost of some old gold miner sat quietly at his post. he didn't say much to me, nodded his head and signaled me to go in like i was some child being lured into the greatest place in the world. he smiled behind his large beard and didn't charge me the $5 cover posted on the door. when i turned around he was gone.  i didn't make it too far in. I didn't get eaten by wolves, or take a bite of that delicious red apple. i made it as far up to the bar and that's when i saw my sister holding up a scarf to her face. yep she was gagging and so was the girl who came in after us. now me, i was taking it in like most do dive bars, but the sister and friend wanted out. pronto. and out we went.   dark bar. yes. cheap drinks. i'm sure. good music? i imagine so. but man, this place smells like straight up funk. piss, sweat, tears and blood collected throughout the years. my sister and friend will never come back here. as for me, maybe. i think after a certain amount of time you kinda get used to the smell. i wouldn't dare use the restroom though. maybe i'll come back when i am pretty drunk already and the smell doesn't bother me a whole lot.  it is a neat looking bar. i just wish it didn't smell THIS bad.", 
    "review_date": "2009-09-14"
  }, 
  "aNKbZV7sTLqeZau7hf7fJQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yowz A.", 
    "review_text": "my favorite dive in the city, and it has the best consistent (and nightly) blues in the country, IMHO.  re: the smell...i believe that 10% of all women who enter have a gene that triggers an I-can't-stand-the-smell-of-this-place reaction. it's funny to watch them: they walk in, crinkle their face, hold their nose, and walk out.  oh yeah, don't forget to check out the Reese Witherspoon autograph in the men's room.", 
    "review_date": "2009-10-26"
  }, 
  "tmxIsLKcNd9qG6nbL6ONbg": {
    "user_rating": 3.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Stephen S.", 
    "review_text": "Live music, slightly order crowd. Ended up with a pabst because it was the only beer on draft. But you're not coming here fir the drinks.", 
    "review_date": "2010-11-11"
  }, 
  "TS2j_gt5qugbmQ1R_fq6TA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jim B.", 
    "review_text": "I have tried to give this place a chance on two occasions. Actually, I even made it to their bathroom which makes the bathrooms on a 737 seem spacious. The second time, the smell from the multiple borderline homeless customers was too much for us to take, so we were on our way....", 
    "review_date": "2011-12-25"
  }, 
  "BwTPj8XS_iqdSTLPBVMs1w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie Anne N.", 
    "review_text": "Was it me? or did it smell like tinkle as you walk in here?  Bleh, who cares. I love my bars that way...nice and wet. The bartender here was this older lady. She explained why the drinks were cheap (CASH only) and that they get more expensive after 9:30pm. Fine with me since it was only 9pm. Had a beer, listened to some band tune their music and left. Great hole in the wall once you get passed the smell.", 
    "review_date": "2009-08-01"
  }, 
  "gsWHMddVl6HrF5QPmBkprw": {
    "user_rating": 5.0, 
    "user_location": "Wellesley, MA", 
    "user_name": "Allan S.", 
    "review_text": "Outstanding dive bar!  It's cash only so come well provisioned.  Blues beer &amp; scotch (though not a wide selection of scotch) &amp; dancing to live bands .  Friendly bar tender.", 
    "review_date": "2014-08-28"
  }, 
  "VvMDnYfkfwyLXfl_ei37Vg": {
    "user_rating": 4.0, 
    "user_location": "Stockton, CA", 
    "user_name": "Lee M.", 
    "review_text": "a little hole in the wall right in heart of North Beach! quaint bar with live blues music and people cutting a rug all over the place! it is definitely one of San Francisco's landmarks! if its fun times your looking for, this is the spot! don't go here if you have somewhere to be after wards. You'll want to hang out here all night!!!", 
    "review_date": "2007-03-19"
  }, 
  "umte1cjoM-Bnh2gOR3GQCg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caitlyn G.", 
    "review_text": "I continue to hear amazing things about the saloon, and I continue to sweet talk my way past the bouncer to see what all of the fuss is about, but I have yet to last more than 10 minutes in here. For as much dive bar charm as it has, and as great as the music is, I CANNOT get  past the smell!! I don't consider myself sensitive when it comes to bad smells, but this place has such a high temperature from all the dancing people crammed into a small space that I feel like I can literally see the smell rising off of peoples backs. I'll probably keep going to see what everyone else raves about, but so far, 3 stars.", 
    "review_date": "2012-11-04"
  }, 
  "XUm4bJy5seRuG_OELvRGGQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher F.", 
    "review_text": "Hey if you don't \"GET\" this place.  You just ain't cool.", 
    "review_date": "2011-01-27"
  }, 
  "cMoQqT_j_FD1gO6EEZzOIg": {
    "user_rating": 1.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Mitch E.", 
    "review_text": "Does being the oldest bar in town mean you have to have geriatric employees who behave like bitter grandparents who never hear from their family?  What a major disappointment.   I figured I'd make this my last stop on my bar crawl but the experience was too bad I needed to get that awful taste out of my mouth. (That awful taste was a warm Budweiser)   I got here at 1 o'clock, band was playing, good number of people and seemed like a good vibe.   I approached the bar to order drinks. The lady behind the bar wasn't the kindest of people. I ordered some beers and she informed me they didn't have anymore of what I wanted. I then asked what they did have. She gives me this death look and then makes a gesture that I should look around. Seeing how I did that and that the tap I wanted was kicked, I wanted to know what else I had before I asked again. After discussing it with my friend, I ordered some Stellas. She then informed me that had no more Stella. Typical. Then I asked again, what they did have? She tried mumbling something. I told her to just let me get some Budweisers. She poured our drinks and made some comment that I should smile more. I smile, plenty lady.  Right after getting our drinks the band wraps up. That's cool. Then the lights come on. That's fine. It's still 1:20. Then this guy comes. The old guy who is cleaning up the bar is just harassing people. And what may not have been but felt like it, especially me. Listen dude, it's 1:20. If I want, I can guzzle four beers in forty minutes. Don't rush me for my one beer. It's still early. This guy was relentless. Trying to talk to my friends was impossible, with how often he would come over. It wasn't even 1:30 and this dude is up our behinds.   In the end, we finished our beers in no time and left. Hope harassing us to make sure you left maybe 5 minutes earlier was worth losing business.   Never come here.", 
    "review_date": "2014-03-05"
  }, 
  "wQ9t5kwmgT0ZER7P5_yKxA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julia K.", 
    "review_text": "favorite bar in san francisco. hands down. the bands are always incredible. the drinks are the cheapest and stiffest in san francisco. the bartenders are helpful and hilarious. this place has been open since 1861 (longer than any bar in sf) and was saved during the fires because of the well known prostitutes living upstairs.   go to this bar and pretend it's 1861.", 
    "review_date": "2008-05-29"
  }, 
  "V-rbYViHmecQGapze7bQYg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Applejack W.", 
    "review_text": "despite all the negative comments by those agist, sexist, elitist shallow minded folks, the Saloon is the oldest operating bar in SF and is also the home of the blues 365 days a year. thank your lucky stars that it exists!", 
    "review_date": "2008-11-20"
  }, 
  "r_bKgZFD761MvvZcN6qkKA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fabian F.", 
    "review_text": "SF institution. Amazing music. But here's a tip, bartenders are usually wasted by 8, and feel entitled to ignore you for whatever their drunken reason. Come buzzed, enjoy the tunes, walk a block away for drinks and service, and come back and tip the bands. Sounds lame, but service is everything. Not that it matters here.  Awesome music though. Bring a flask.", 
    "review_date": "2012-07-02"
  }, 
  "4LMErvQTSEx6pXVAXAJaQw": {
    "user_rating": 2.0, 
    "user_location": "Jersey City, NJ", 
    "user_name": "Kenny L.", 
    "review_text": "This is a taste of the \"old\" San Francisco.  You know, back in the day when my forebears would have gotten their asses beat if they wandered out of Chinatown in and into North Beach.  Not like today's North Beach with non-Italian Italian restaurants and Chinese businesses deep into North Beach.  Still, I don't appreciate paying a $5 cover for a band that didn't play.  As I walked in, I was assaulted by a sight and a smell.  The sight, an old man passed out sitting on a barstool in a corner.  My liver felt sympathy pains for his cirrhosis.  The smell was like the smell of a urinal, not quite piss, but there was a smell of chemicals (like urine cakes) trying to clean and or mask the smell.  But the drinks are insanely cheap for San Francisco, and it was a delight to see cracked out bartenders pour more whisky on to the bar than into my glass.  Yes, this is authentic, old-school San Francisco.  But sometimes the past should just remain in the past.", 
    "review_date": "2009-03-28"
  }, 
  "F9tOE0d09SLkCIZwt8I-0g": {
    "user_rating": 2.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Patrick N.", 
    "review_text": "Yeah, sure, it's a dive bar, but I've been in better dive bars.  First, it smelled like they hadn't cleaned the place since 1864, and some of the furniture looked downright scary. We didn't dare venture into the restrooms, and left after one drink.  What's disappointing is that here's a place that's \"the oldest bar in San Francisco\", and that alone could bring in more traffic if they fixed up the place -- and I'm not talking a major fix up, just applied some elbow grease.  But it is a drinkin' bar, so if you are looking for a place with cheap drinks and want to drink with the locals, this is it.", 
    "review_date": "2008-07-21"
  }, 
  "Zcr90BeQ8QWV32XIqpH82A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Blake W.", 
    "review_text": "What a great, great dive bar.  Honestly.  They dont' come much better.   I can't believe I have not reviewed this place yet.   My friend Tom, who loves all things divey, swears that this is the best bar in the City.  I might not go that far, but this is a gem.   I was most recently here after the North Beach festival and they had a killer band, Second Hand Smoke, playing.  We danced the entire time.  And I think I have maybe danced 12-14 times in my life.  I hate dancing.  When I do, I usually feel like a monkey dressed in women's clothes (I'm a male monkey) standing on a barrel and doing a gig for the amusement of drunk sailors.  Seriously.  I felt like this at my wedding.  But at the saloon, man, it felt great.   That's a good bar.", 
    "review_date": "2007-06-21"
  }, 
  "5Xp1puM4TMVPvwox_ryu6A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Otay B.", 
    "review_text": "Hey, at least it doesn't smell like barf, the way the Irish bars out in the Avenues do! What's a little piss among friends?  This is where to loosen your tie and/or corsets and just have a good ol time.  Enjoy!", 
    "review_date": "2009-09-05"
  }, 
  "Ht6UsXDORUmtMNcDqosaPQ": {
    "user_rating": 5.0, 
    "user_location": "Columbus, OH", 
    "user_name": "April K.", 
    "review_text": "As an Ohioan I appreciate Dave Workman playing at the Saloon twice a month.  SF is lucky.  Saloon reminds me of Dick's Den in Columbus, OH.  Dirt cheap drinks and as many characters as you can fit in a bar.  I hope this place never closes and stays the same.", 
    "review_date": "2014-12-22"
  }, 
  "-ZNZxzThcTlJfDFWPWIX3w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brett N.", 
    "review_text": "The Saloon, arguably the best bar in San Francisco, maybe in all of the Western Hemisphere.  The neon lights and smell of delicious beverages captivates passers-by on a nightly basis.  The 1 drink minimum ensures that the riffraff stay away, the drinks are priced right, and the vibe is so alluring.  All in all, the Saloon makes House Party look like House Party 2.", 
    "review_date": "2010-09-22"
  }, 
  "Jj-G6cxvYGcoffIKsfWGuA": {
    "user_rating": 4.0, 
    "user_location": "Cincinnati, OH", 
    "user_name": "Mark W.", 
    "review_text": "A really fun place to go and a must-see if you are visiting from out-of-state. I hear it's very historical. Bring cash they do not accept credit cars.   Oldest bar in San Francisco.", 
    "review_date": "2011-07-17"
  }, 
  "sRQu5rrkNXe5yXjKvPqWrQ": {
    "user_rating": 4.0, 
    "user_location": "California, CA", 
    "user_name": "E P.", 
    "review_text": "Dark and dingy, with cheap drinks, and great live music.  This place is chock full of friendly regulars and the bartenders are really nice. There beer list is pedestrian but the ambiance is really worth a PBR.", 
    "review_date": "2009-08-20"
  }, 
  "V8j4lrXSzSt_F29zhhGQ8w": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Tina L.", 
    "review_text": "The Saloon is one of the last authentic bars where you can dance, drink and see the best in Bay Area blues.  The musicians are all pros and give a great show full of flavor and down-home humor.   If you're looking for a squeaky clean gentrified restaurant/bar were you can chit chat over fancy drinks and nachos, then stay in the burbs!", 
    "review_date": "2011-04-25"
  }, 
  "7EzKV5tGQFOuuJCx4rbDHw": {
    "user_rating": 5.0, 
    "user_location": "Apex, NC", 
    "user_name": "Steve G.", 
    "review_text": "The place is a true dive, the bartenders seem to be always altered, but it is fantastic.  The music is always good, the regulars look out for each other and as long as you go with the flow, you will have a wonderful time.  A true gem in San Fran...uptight people need not apply.", 
    "review_date": "2013-04-20"
  }, 
  "pgHCj7DSqI8NWx7WucnH3w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew S.", 
    "review_text": "I've lived in North Beach for 5 years and finally getting around to writing a review on The Saloon? Shame on me.  The Saloon is a staple in SF, the oldest bar around, and worth going just for its history, but its more than that. They also legitimately host some of the best live Blues music you'll find in the Bay. And its all free.  Yeah, you're not gonna be treated like you're a unique and valued customer. And no, you're not gonna love going to the bathroom. But you know what you're signing up for. And thats a no-nonsense, authentic fun time at a kickin bar thats about havin a good time and couldn't care less about what you think of it.", 
    "review_date": "2013-04-12"
  }, 
  "XJgRdHOsgypEba4oKwAh1w": {
    "user_rating": 5.0, 
    "user_location": "Jersey City, NJ", 
    "user_name": "Augie R.", 
    "review_text": "This place is not for everyone--it's a dive bar in every sense of the word--but it's a great place for people so inclined.  The blue music is great, the bartenders are attentive, the crowd is incredibly diverse and interesting--what's not to love?    Of course, if you like your bars and bathrooms clean, this might not be the best place for you.  But if you're into good music, cheap drinks, and people watching, this is the place!", 
    "review_date": "2010-05-10"
  }, 
  "P7QJ1nKAdc3bWGq9GBjmZQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Rich W.", 
    "review_text": "Down and dirty bar. Great place to sit in the shadows and listen to some good music. Make sure you got cash on hand.", 
    "review_date": "2011-09-24"
  }, 
  "y3HFVx8nbNmomSc-PWOy-g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roy N.", 
    "review_text": "After so many years, I can't believe that I have never reviewed this place before.  The oldest bar in San Francisco, there is a ton of history here.  As such, it is also the last of the real bars.  Everything in this bar, including patrons, is real.  Not for everyone...there is nothing trendy about this place...no poseurs, no see and be seen.  This is an old school drinking establishment with strong drinks and live bands where you go to hang out and drink.  The bartenders have all been there a long time and are always wonderful to me.  Prices are great too, especially in the daytime.    The place has a divey, but fun vive and people are friendly in here...this is not one of those \"let's dress up and go there as a group to look cool before we go home again as a group\" kind of places.  Not by a long shot.  If Mickey Rourke's character from the film Barfly was drinking in the neighborhood, this place would be his bar of choice.  All my biker friends hang out here too which makes it even more fun and interesting.   The Saloon is definitely one of my must stops whenever I'm drinking in North Beach and when barhopping the other night after a UYE (Unofficial Yelp Event...thanks Maureen!), this was my first stop of many that evening.  You get a little bit of everything in here...good times!", 
    "review_date": "2012-01-10"
  }, 
  "xa9wLlbp5U_jXK7xcu_HGg": {
    "user_rating": 3.0, 
    "user_location": "Morganville, NJ", 
    "user_name": "N. M.", 
    "review_text": "Worth a stop for a drink, as it's one of the oldest bars in the US. Interesting decor, dust all over the place, but it's kind of neat. Hopefully you can make it in when there's a band playing. Very dive.  The bartender at the time when I went was nice as pie.  My only personal gripe was that there's only one tap line. But they have a decent selection of liquors and bottled beers.", 
    "review_date": "2012-08-14"
  }, 
  "UCTin7iQ_oR0E11EYemsEw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jesse W.", 
    "review_text": "Not for the faint of heart. A San Francisco staple that stays original.   Bring friends who like blues and grungy places. Avoid it if you're looking for something clean, trendy, or uplifting.", 
    "review_date": "2009-03-25"
  }, 
  "Dry25R78VCRZgn6se-q6_w": {
    "user_rating": 5.0, 
    "user_location": "Ontario, CA", 
    "user_name": "Terry R.", 
    "review_text": "My boyfriend and I visited The Saloon on our trip to SF in 2012 and had the most amazing time!  Great dive bar with awesome music.  We met a man outside just outside The Saloon, and it appeared as though he might have been living on the streets of SF.  His name was Osiris.  If anyone knows anything about him, please let us know.  We had a spiritual encounter with Osiris, and think about him often.  We call him an angel.   My e-mail is <a href=\"mailto:mtkillion@gmail.com\">mtkillion@gmail.com</a>", 
    "review_date": "2015-01-06"
  }, 
  "rXops73qsJgW91oImt7UJA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Broke-Ass Stuart S.", 
    "review_text": "From the outside this spot has a total biker bar look to it, but once you get in you realize that it is more of a 55 year olds getting drunk and dancing sort of spot.  This fabled watering hole is one of the oldest in the City, and didn't burn down during the fire/earthquake of 1906 because the firemen wanted to save what was at the time also one of the City's favorite whorehouses.    Although the whores are gone, the bar is still here serving $3 well drinks and having live, mostly blues, music every night.  Make sure to check out the stained glass windows near the front.  Last night the bartender carded my friends and after they explained that they were carded at the door, the barkeep answered, \"By who?  That guy doesn't work here.\"  So what if the crowd is old, smells a little, and is usually shit-faced drunk, the Saloon might just be the bar that all other dive bars are trying to emulate.", 
    "review_date": "2009-04-06"
  }, 
  "sSFgjECKS4NIw-e_Vx9UuA": {
    "user_rating": 4.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Castro G.", 
    "review_text": "After starting at Gino and Carlo we arrived at the Saloon to catch the end of a jamming group playing some fine blues.  We were early (sun hadn't yet set) but it was still quite busy.  The door guy was very helpful and friendly, the drinks cheap, but the bar tender got pretty occupied.  This, the oldest SF bar, is a must on any North Beach tour.", 
    "review_date": "2012-07-06"
  }, 
  "xupIYrEgJHC7hkEx8KDQCw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jim b.", 
    "review_text": "Unpretentious. Unapologetic. Straight-up bar, saloon, honky-tonk dive; call it what you will. What it reeks of is authenticity. Anyone reviewing this place who gives it five stars is a good person to go out on the town with. IMHO.", 
    "review_date": "2009-05-31"
  }, 
  "E6RTdVTqzim2wOviazV3TQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "M J.", 
    "review_text": "wow, this is a rough place.  all the crazy old men that crowd cafe trieste in the mornings begin and end their nights here :)  Sometimes I'm not sure if its a homeless guy or the doorman asking me for my ID.  All that being said, you can't beat the people watching here -some great characters stumble in and out of this place at all hours of the day/night.  Drinks are cheap, the entertainment (besides the patrons) has been decent so far! I like to end my evenings here.", 
    "review_date": "2008-01-25"
  }, 
  "dim5Svrt-B1jvvQsOIX22A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy Z.", 
    "review_text": "I've been here a few times, and this is definitely my idea of a rowdy Saturday night.  Cheap drinks and great live music.  The crowd tends to be older men who drool over anything in a skirt or cleavage.  The last time we were there, an older gent offered me and my friend drinks as soon as we walked in the joint.  He then told me his kids (who are my age) would kill me if they saw it happening.  Popular place so you might have to wait a few minutes for your drink.  I think it attracts a lot of Bridge and Tunnel people on the weekends so don't say that you weren't warned!", 
    "review_date": "2007-03-05"
  }, 
  "k1pDGshQONPqmEwQLOkD8A": {
    "user_rating": 5.0, 
    "user_location": "Jacksonville, NC", 
    "user_name": "Robert J.", 
    "review_text": "Legit.  Fun.  Historic.  If you are making the rounds of North Beach bars, this is a must visit.  PBR on tap (usually).  Great music.  Greatest customers.  Dance floor.", 
    "review_date": "2014-05-23"
  }, 
  "MjCIBCRp7p4B_ITMWDpKzQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ashley J.", 
    "review_text": "This bar is typically not my scene, but on a random night with a lot of friends, I was able to really enjoy myself here. We ended up here after the Mojito bouncer yelled at us for blocking \"his\" sidewalk. So we left and kind of just wound up here. It's apparently the oldest bar in the city, and the inside didn't smell very wonderful at all. However, the door guy was really chill, and let my girlfriends and I in for free (there's usually a $5 cover). Live jazz &amp; blues, lot's of dancing, and the crowd is definitely on the older end. I think I saw at least 5 Santa look-a-likes inside. I don't think I'd ever hit up this place purposely, but I can imagine I'll end up here again.  FYI... it's cash only", 
    "review_date": "2011-08-22"
  }, 
  "dfYNTBw--CYlZbFz581kYQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meghan P.", 
    "review_text": "Apparently the Saloon is the oldest or one of the oldest bars in SF... I can't confirm or deny this but it definitely is divey. There is a little stage for live music and I often walk by and hear the live music a-playing. I've only been in this bar two or three times even though it's in my neighborhood. The drinks are fairly cheap but there aren't that many choices for what specific type of rum, vodka, or mixer you'd like. There are definitely no fancy SF specialty drinks here either. I'd usually rather head to other spots on Grant such as Tope (they have specialty drinks that are much better), Tupelo (live bands that I know and TV's watching sports games), or Church Key (specialty beer bar). I won't say no if a friend really wants to hit up the Saloon though.", 
    "review_date": "2013-07-14"
  }, 
  "cbPlBWeXVGwy5Kb-LQ9lmQ": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Pete K.", 
    "review_text": "MY FAVORITE BAR!  This place has to be the best bar I've ever been to: - Cheap drinks ($3.50) - Great Blues Music (older and new) - Dancing (various ages from 20s to 50s)  Why try any where else, when you know you'll end up here. Every time I go it's a fun night.  QUICK TIP: When the band takes a break, head outside for some more live music happening in the alley from more musicians.", 
    "review_date": "2013-12-03"
  }, 
  "U-Stpt0SX7OWFYfpAL532w": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Erin C.", 
    "review_text": "Hi ho, Bridge and Tunnel here... but had an SF guide - so thankfully we didn't make TOO much of an arse of ourselves on St Patricks Day.  Live music was cool; bawdy old rock and rollers/bluesmen that they were, but loud as f.  Saloon gets an extra star for letting our drunken-by-3pm, green-clad asses in the door when no one else would.  And an extra star cause the bar keeps didn't look like tranny hookers.  This was the bar that I met this adorable Englishman, and the one my friend was fed a continuous line of small(um think juice glass when you were eight at grandmas), but apparently quite stong vodka tonics by some dorks apparently from IOWA.  WTF?  Baking power?   Then she puked in the bathroom hallway at Figaro's and I stepped in it.  When I found out it was hers (apparently I was being fed a stream of Coronas and didn't  notice the way her face now matched her St Pat's fare) and cleaned her shirt off for her.  Aren't I a nice friend?", 
    "review_date": "2007-03-18"
  }, 
  "PrqhlhGVjq5FuaM9pW6Enw": {
    "user_rating": 5.0, 
    "user_location": "Antioch, CA", 
    "user_name": "Rae'esah N.", 
    "review_text": "Even tho the bartender and patrons looked like extras from the movie \"The Hills Have Eyes\" - I loved it here.  We aren't from these parts and had a tough time finding out where to go where we could: A)  Avoid a cover charge B) Get strong libations C) Not mortgage our home for said libations D( w/in walking distance of Broadway (checking out some strip clubs for next time)  This is the place.  Don't judge the people who are drinking and enjoy your hella cheap, hella strong cocktail.  The bartender looked like a \"rode hard and put away wet\" Bettie Page.  I'm not complaining - cuz she'd probably kick my ass.  Besides, she made some pit bull mean long islands - NIIICE!  Oh yeah - there was a band playing some Rick Springfield music (or something) in any event - they were enjoyed as well!  We WILL be back.  ALOT.  GUARANTEED.", 
    "review_date": "2008-06-01"
  }, 
  "gxoxI92jcOScCT5-Cx702Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren D.", 
    "review_text": "Bad ass bar tender who looks like she could whip you up a great plate of pasta and kick your ass all at the same time.  good live blues music to dance to as soon as you've drank enough. its a bit older crowd, but a refreshing break from the scenesters.", 
    "review_date": "2008-04-19"
  }, 
  "t-YxjWiEuJIHRk0XAH4YkA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kiyoshi F.", 
    "review_text": "i lived above this place for 6 months when i just moved here and.... just wait... the entertainment in the alley outside rivals that music.  i mean i love The Blues and all that but....  c'mon super wasted crack-heads arguing is a close second..   well.. only now that i don't have to hear it everyday.  5 STARS!!!!!!   Dave Workman plays every other Sat in the afternoons.... that the guy to see! trust me, i've heard 'em all.", 
    "review_date": "2008-01-30"
  }, 
  "Fe7ikq0jVy3P4vtu3PQTCw": {
    "user_rating": 1.0, 
    "user_location": "Bay Area", 
    "user_name": "Jenny L.", 
    "review_text": "Warning:  Old white men will try to solicit young females to dance.    Went to this place because the ol music teacher made me review a live band.  Some how, I ended up here.  As the \"bouncer\" was giving me change, this old couple decides to shove me out of the way.  Jerks!  My friends and I akwardly stand about and attempt to order a drink.  The woman bartender notices that I have tits and decides to ignore me.  Then a man who appeared to be the \"bar back\" made my screwdriver, which was really strong by the way.  No complaints regarding the drinks, but the atmosphere was unwelcoming.  They either didn't like a younger crowd...or a younger minority crowd.  I would never go back!", 
    "review_date": "2008-10-21"
  }, 
  "yu-W5WPtzdpsDAfiewAe3A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dana M.", 
    "review_text": "Now this is a bar!    I will continue to elaboarate on my specific experience in just a moment here, but I have to say - I I think this may be my personal version of  heaven.  Not one young attractive man has ever tried to pick me up, the wine is stanky and 3 dollars and I can dance to my crazy hearts content with no fear of realistic booty bumping.  For those of you who know me, you probably also know I'm destined to become your witchy, cat-lovin, music playin, dancin in the garden sort of neighbor that avoids normalacy like the plague.  I'm not so bad yet, but believe me - when a 60 year old man jumps off the bar and lands on his knees while my friend and I are serenaded by 3 white haired saxaphone cooters rolling around on the ground like siezing slugs - I wish I wish I wish I stay there forever.", 
    "review_date": "2008-06-16"
  }, 
  "UXgvagwYM0gr4MRvpgeGOw": {
    "user_rating": 5.0, 
    "user_location": "Brussels, Belgium", 
    "user_name": "Clem R.", 
    "review_text": "I went there a few month ago, Curtis Lawson was playing. I don't know much about blues but I loved it. I liked the atmosphere which was very open, just having beers, enjoying very good music, no show off! Really relax! That's where I started enjoying San Francisco!", 
    "review_date": "2011-07-28"
  }, 
  "HPa7MNIwUyV5QBHVMMXujg": {
    "user_rating": 5.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Michael E.", 
    "review_text": "Hey Alexa...stay away...Zeitgiest has a spot for you and your skinny jeaned boyfriends..  With that said, The Saloon is a great little spot to hit ANY night of the week and find a really cool, dark little watering hole with a live band. The bar itself usually has a door guy checking ID's...go inside and find a bar, a small dance floor and an area for the band....  Its dark, pours a good drink, has a bathroom (which like all in SF are small dirty and full of grafiti...in other words perfect)....there is dancing, live music and a very diverse cool crowd....Im a fan", 
    "review_date": "2009-03-04"
  }, 
  "CQ5h932tp5HoBaEho9L24g": {
    "user_rating": 5.0, 
    "user_location": "Simi Valley, CA", 
    "user_name": "Frank T.", 
    "review_text": "This is my favorite San Francisco bar by along shot. If you're a yuppy or want to meet cuties this is not your kind of place but for jazz or blues with a great vibe it's the best.", 
    "review_date": "2012-10-15"
  }, 
  "9y3amkDxxqvk9oReRmfp-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick C.", 
    "review_text": "Much has been said about the oldest bar in San Francisco. Yes, it's old, yes, it is a dive, and yes, you can have one of the greatest experiences there. There is a doorman that takes your money at the door, a crusty old biker looking dude, but he doesn't discriminate whether your're young or old, rich or poor, the only criteria as far as I can tell, is you need to get ready to have some fun. It's not uncommon to see people there dressed to the nines, shaking and shimmying alongside strippers on their off time, and leather dressed bikers all squeezed in tight together in front of the postage stamp sized bandstand. The place offers some amazing musical talent for a nominal door charge. On any weekend night you can see Barry \"The Fish Melton, Nick Gravenites, Ron Hacker, Tony Perez, and Tommy Castro playing this hallowed blues joint. The place reeks of old school San Francisco and the fantastic musicians who used to play at The Saloon regularly. such as the late John Cipollina from Quicksilver Messenger Service and Johnny Nitro who passed away recently in his apt just above the joint. Nitro was a fixture there every weekend for over 20 years. Say what you want about the place but it's REAL. and it just doesn't get any better on a weekend night in North Beach.", 
    "review_date": "2011-04-20"
  }, 
  "T8AcaLi2dcDTCvPtFgxKxg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lorraine D.", 
    "review_text": "Is it really a hole in the wall if it's located in one of the city's most popular streets for bar crawling? At any rate, it's nothing fancy, even if it is also one of the city's most popular bars on the weekends. It's not intimidating, everyone's just here to have a good time. All kinds of crowds stop in here at least once - either for the rest of the night or else moving on to the next spot (for the younger crowds, that is usually the Savoy).  The fun part is the band, which usually plays on the weekends. Don't expect any songs that are too recent - just good ol' tunes that keep the crowds happy and dancing. I've gone in with friends and have had a fun time here.", 
    "review_date": "2007-04-10"
  }, 
  "kcSqnDiNjpxHc4b4T-K6Wg": {
    "user_rating": 5.0, 
    "user_location": "Napa, CA", 
    "user_name": "Kevin S.", 
    "review_text": "This bar immediately become one of my favorites in S.F. after visiting it for the first time last night ...  The fact that this is the oldest bar in S.F. dating back to 1861 is a reason to check the place out ... the stiff drinks at half the price of many other S.F. bars is a reason to order a drink (plus, you can step up the size of a cocktail to a beer glass for 50 cents!) ... the great Blues music is a reason to hang for a minute ... and the oh-so-many characters in this place offer many reasons to stay.  From the bearded quiet guy at the door I thought might be Santa hiding out after Christmas, to the drunk bartender (the other one was sober and working double-time to compensate), to the patrons doing bar tricks, to the band nearly breaking up between songs, to THAT guy on the dance floor, to the guy who must have thought he was a professional filmmaker packing a small digital camera, I couldn't stop smiling as character after character rolled into this place.  The men's bathroom is a bit of a dungeon and I noticed a slight funk when I first walked in, but all of this is what makes this place a one-of-a-kind and truly one of the best bars in the city.", 
    "review_date": "2008-12-29"
  }, 
  "6v7kbVe-1E7qoouxPMhnQQ": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Melissa K.", 
    "review_text": "I'm here on a business trip and one of my friends highly recommend this bar.  He said I would love it.  Boy was he right.  It's awesome.  We happened upon it when I was at an awful restaurant across the street.  I was pretty excited that it was there.  We went there after dinner.  It was awesome.  We ordered 4 drinks and the bill was $9.  The bartender told us that the price would go up in half an hour.  I asked to what and was told 50 cents a drink.  They had a great blues band and it was just cool.  We even bought shirts.  We're total tourists.", 
    "review_date": "2006-09-15"
  }, 
  "EjTY2XV-vlgz3428S_vpGQ": {
    "user_rating": 4.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Jaclyn P.", 
    "review_text": "I'm giving this four stars because it's the oldest bar in the city. If a band is not playing then you don't have to pay a cover (which I didn't know and some guy was sitting on the bouncer seat smoking a cigarette and I thought he was collecting money so I gave him a $20 to pay for the four of us and walked in the bar, luckily he was a nice guy and came into the bar when he got done smoking his cigarette and gave me my twenty back). There is not a big beer selection, I think Bud Light is on tap and then you can get Heineken in bottles and about six other beers in bottles. It's a good place to go have a beer and then jet onto another bar. It's a small, small bar but I hear the music is good. Before the band started a guy came by and asked for $5 if we were staying for the band but my husband and our two friends who were in town didn't really want to stay for the band so we left.   Overall, I think you should go there once and have a drink since it's the oldest bar in the city.", 
    "review_date": "2009-01-03"
  }, 
  "rBheMfC928gnYTltxReo7w": {
    "user_rating": 5.0, 
    "user_location": "Austin, TX", 
    "user_name": "Karen S.", 
    "review_text": "Definitely agree with Steven G's review. It was rocking when we went in last night. Very eclectic friendly crowd  having a great time to some seriously good music. Can't go wrong with $3.50 G&amp;T and a $4.50 beer. Don't imbibe too much as the steps to the men's room could become a problem.", 
    "review_date": "2013-11-16"
  }, 
  "6dhTfIDSmFUOUCW27Sd3gw": {
    "user_rating": 1.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Lauren P.", 
    "review_text": "This is the epitome of a dive bar.  It's dark and dingy and a haven for the down-and-outers.  On any given day, at any given time, you will find at least one incredibly intoxicated patron and a handful of others who are well on their way.  It claims to be the oldest bar in San Francisco, and it looks it. Paint is peeling off the walls and the pastoral paintings are so blackened by smoke (when you used to be able to smoke in bars) that you wouldn't even know they were there unless pointed out to you by the bartender, who somehow looks 40 and 90 at the same time.  That being said, it hosts great blues acts and there is never a cover.  I would give it five stars because it's everything a dive bar is supposed to be; however, as I was sitting at the bar talking to a friend about how great the place was, a cockroach scurried across the bar in front of me, onto my bar napkin, tried to climb up my beer bottle, got bored, and then visited my friend's beer.  This was right after I ate some salami offered to me by the bartender. (Don't ask.)  I was so disgusted I had to leave.  I'm all for dingy places, but I draw the line at roaches.  I'm thankful I ordered a beer in a bottle.", 
    "review_date": "2011-11-01"
  }, 
  "JUuooHIj_ywGz7zU8Z9Ncg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sydney M.", 
    "review_text": "Super Cheap, Great Music, Good Location, and Friendly Service.   Rockabilly Mondays are definitely worth checking out.  Unlike many rockabilly shows in SF, this one actually draws a slightly younger crowed (many in their mid twenties) and the place is often packed.  The live music is good, tips-only, and goes all night.  I highly recommend it.   I've been to this bar on other themed nights, and though it wasn't my music taste per se, I still had a great time.  The crowed is always friendly and diverse.  Additionally, you simply can't beat the prices! Drinks are good and inexpensive. Win-Win.", 
    "review_date": "2013-01-14"
  }, 
  "TMWgq3KNRDaESXs8ZCrRtA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela S.", 
    "review_text": "I came in here very briefly awhile back and I think it was empty except for some homeless people.    I came back on a Wed night when there was an amazing blues band and the place was pretty crowded.  Apparently they have bands playing all the time and most of them are blues-y.  We danced and drank cheap beers.  Not much more you can ask for.  Quite an eclectic crowd.  I can't really describe it actually.  You have to go to see it.  I loved this place though and I will definitely come back with friends who will appreciate its charm.", 
    "review_date": "2008-06-10"
  }, 
  "gUMZ0P-h-pVVdVBun54sMA": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "wendy m.", 
    "review_text": "all i can say is that i will be coming back for more.   nothing like crazy old people w/ some foreigners to throw in the mix. i had a great almost can't remember time here. if you like a down and dirty bar this is the place for you.  the crowds are mixed. the pissed of ol' hags and people watchers at the front and the good ol' dancin fools in the back. nothing like some dirty south blues to get a girl dancin.", 
    "review_date": "2009-01-20"
  }, 
  "oW2bCSJ5bIHyRnoZvkHwDg": {
    "user_rating": 5.0, 
    "user_location": "Belvedere Tiburon, CA", 
    "user_name": "Uncle Fishbits Aeneas X.", 
    "review_text": "Minus one star for the $5 cover.  Plus one star for me being stupid.  Stupid as I didn't listen to my friend and come here sooner.  He plays Harmonica/Harp from time to time at this place, and I was supposed to call him if I was ever in the neighborhood.  I have had a drink in a drunken stupour once or twice, and passed it on Santacon, on my way to Alice Russell at Mojito, etc.  But never really took stock.  This place is one of the most real, classic, and groovy \"character\" spots in the city.  It is simply this:  a blues bar.  The guy playing was just incredible, the place was smelly, the bathroom was TRIPPY and awkward for such a tall gent as me, and you can't even get to it with a dancefloor of tired, lost drunken tourists, marina boys far from home, an errant hipster or goth waiting to meet a friend, and then a whole mess of grizzled pirates that look like a cross between leather and a horse, and that is both men and women.  The barker himself with his derby, cigar, and vaudevillian charm was enough to coax me in.  The barkeep that serviced us is why this place gets five stars.  This Iggy Pop look alike was grinding out his ass on the line, vacuous to guest requests just listening to the blues and R&amp;B echoing from the hollow body Gibson.  His robotic, autopilot arms seemed to be fierce and fragile trembling twigs that were in a frenzy to keep pace with his body that was detached from his meager, kind yet distant smile.    So I order a jack and coke with a beer.  Beer check.  Not paying attention to what he is doing.. check.  Then, the most amazing thing happens.  He is watching the band, while reaching behind him for the jack.  He is bobbing along in another world as he grabs the Cuervo.  Anyone who has worked a bar know that a bottle of Jack and a bottle of Cuervo don't look the same, but for all intensive purposes they are similar.  Not like Galliano and Jaeger sitting next to one another.  Whatever the case, without skipping a 1/4 second beat, his rote, automatist hand expresses the realization that he is into the wrong bottle, switches without a pause, flips it lazily, calmly, and without any Cocktail shenanigan flourish... pours my beverage.  This all happened in less than a second.  But a seasoned barkeep can make a mistake... but to make it, realize it, and solve it in less than a second WITHOUT PAYING EVEN A MODICUM OF ATTENTION....  ...that barkeep is your friend.    Incredible place, some of the best blues I have ever heard, let alone in this city.    Yay!", 
    "review_date": "2008-07-08"
  }, 
  "GtQuA0QRg3NPWul5XF6b3w": {
    "user_rating": 3.0, 
    "user_location": "Portland, OR", 
    "user_name": "Isaac S.", 
    "review_text": "Wow, I have not seen so many \"LOCAL\" freeky north beach old-school peeps in one place since \"Nam.\" But im not complaining, it is all part of the ambiance. This place has STANK, with a capitol \"S\".  I would not advise going alone; this is best tackled with a large group and not for longer than 20 mins... in case any ladies need to hit the bathroom, (better try next door).  And don't look anyone in the eye for too long, they will talk to you, it may not make sense, and it may not stop any time soon. lol", 
    "review_date": "2008-06-17"
  }, 
  "RQR-bncvVssevK_WIPWvCA": {
    "user_rating": 5.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Emily M.", 
    "review_text": "Like the Tin How Temple in Chinatown (which we visited the same day as The Saloon) visiting this bar was like visiting another world. Super old school history and style plus unpretentious surroundings and an absolutely wailing blues band were somehow exactly what we were looking for, even though we didn't think we were looking for anything.  If you love absorbing the scene vs making the scene, check out the Saloon!", 
    "review_date": "2013-03-11"
  }, 
  "N7r5J3RiaxfEPqP17LTPEA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Krista R.", 
    "review_text": "The Saloon was SO MUCH FUN, with a live band Friday night. The drinks were cheap and delicious and the bartenders look like they've been there since the 70's.   One drawback is that it smells a little bit like a restroom inside the bar. Not sure if that is a constant or one night (due to one smelly customer) characteristic.", 
    "review_date": "2013-09-14"
  }, 
  "vn8nPLA7J_GkHEiW5vEmbA": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Christina C.", 
    "review_text": "I'm not sure what I was thinking when I suggested we go here.  Certainly not Yoko roughing up the microphone the way she did.  The second time we went was after the BF's lovely little birthday dinner with his mum, his mum's BF and little ole me.  I forget how everything in North Beach is actually just a couple blocks away from each other, but what a dense couple of blocks it is.  Like that flourless chocolate torte I'm no longer allowed to think about.  The second time was good.  I don't remember the band name but they were from out of town.  It was real decent.   I made the boys try frente for the first time, with a ginger ale chaser.  And now they both think I'm trying to poison them.  Who knew?  CASH ONLY.  Hate that.", 
    "review_date": "2008-09-14"
  }, 
  "2cIdR5891_TF9nEqQw-I-w": {
    "user_rating": 5.0, 
    "user_location": "Grass Valley, CA", 
    "user_name": "Elizabeth R.", 
    "review_text": "I can't wait to come back here...  what a joint!    scallywaggin'  barkeep, stiff, cheap drinks, loud ass fantastic live blues music, interesting crowd, endorphin and vodka fueled dance party- in short, a fantastic time!", 
    "review_date": "2009-01-19"
  }, 
  "o3vwmjnav458K41rCVgV3w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Edward N.", 
    "review_text": "I've have been to many blues venues all over the country and this is one of a kind. Let's get this straight - it's a dive. But if you've ever heard the great Ron Hacker, Danny Castro, Steve Freund, or the many other great players ripping it up, and if you love the blues, cheap stiff drinks; then this is your place.   Some of the below reviews are just ridiculous. People, I implore you - try to have an idea of where you are and where you are going before you judge something. You will run into children at Disneyland, sick people in hospitals, dwarfs at circuses...and yes - you will find drunk people and really bad odors at divey, blues bars. It goes with the territory and don't act like a bitch when you find those things here. This is not a place that has a huge selection of beers, or pretty young attentive female bartenders. So go here with the right attitude and you will have a blast. Great (i mean GREAT) live blues, no cover during the week and only $5 on weekends, cheap drinks, and all types. They may look scary but looks are deceiving. I have been here many times and never witnessed a problem. Go here, listen to music, and enjoy!", 
    "review_date": "2011-08-21"
  }, 
  "WcyofRg-nXjgyacvgHSw4Q": {
    "user_rating": 5.0, 
    "user_location": "Baltimore, MD", 
    "user_name": "Josh O.", 
    "review_text": "On Cinqo de Mayo, 2006 I was on my way from having a few slices and beers at Golden Boy to meet some friends on Broadway. I never made it that far because I was drawn into The Saloon by the sound of live music. It was Lisa Kindred, one of the best Blues singers I've ever had the pleasure of hearing. The prices of a drink, like anywhere else in San Francisco really, is a little high, but it's well worth it for the amazing music and matching atmosphere. This definitely rates as one of my favorites places to throw back a Makers neat.  You need to go here, and you need to make sure you see Lisa Kindred when you do.", 
    "review_date": "2006-12-18"
  }, 
  "LkM20gbDNUqXnGM1tLldlg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Devin G.", 
    "review_text": "If you want a shiny, clean bar where you can go pick up chicks and watch the game...this is not the bar for you. Not even close. If you want a stiff drink poured by a surley old bartender in a dive bar that looks (and smells) like it's a hundred years old, all while listening to a live band play some good 'ol fashioned blues/rock/jazz to a crowd of 40 - 60 year olds dancing their asses off...well then, you've come to the right place.  The saloon is just that...a saloon. Divey is putting it mildly, but man...they do it right. If you're really dying for a beer, get bottle of Bud or a pint of Busch on tap (that's right, Busch on tap) because that's about all they have. Otherwise, order yourself a whiskey and coke (be sure to ask for the tall glass for only like 50 cents more) and watch the bartender pour you a mighty stiff drink for dirt cheap. Once you have your drink in hand, sit back and watch the live band that plays in there pretty much every other night, or get out on that dance floor once you're properly intoxicated and mix it up with the old folks.", 
    "review_date": "2011-05-18"
  }, 
  "Sfgfz2Awh2EGPJvoEwwhKQ": {
    "user_rating": 2.0, 
    "user_location": "Berea, KY", 
    "user_name": "Peter H.", 
    "review_text": "Ron Hacker and his 4 buddies are live tonight in this very diverse gathering of 51 patrons crammed into this night spot.11 songs made up the first set. Great evening enjoyed by all!", 
    "review_date": "2010-03-06"
  }, 
  "5VyzxNY0xvDKVYaULIgHog": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Sebastian C.", 
    "review_text": "This place is amazing! Great music, great drinks at a very reasonable price, and amazing staff. Will definitely come back!", 
    "review_date": "2014-12-20"
  }, 
  "JIre_yzVACUswW78n0jzbA": {
    "user_rating": 5.0, 
    "user_location": "Pompano Beach, FL", 
    "user_name": "Andrea B.", 
    "review_text": "Fell in Love with Lisa Kindred Band!  Bought her CD while there and have been listening to it ever since!  One of the funnest spots in San Francisco by far!  Bernard Anderson - I love you man!", 
    "review_date": "2011-06-10"
  }, 
  "FH_58ovtah1RPbamLxy4nw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "gray v.", 
    "review_text": "only place in north beach worth a visit. best crowd, best attitude, great music.", 
    "review_date": "2007-11-03"
  }, 
  "TL2S7Lnka6t5kUOofr8Krw": {
    "user_rating": 1.0, 
    "user_location": "Redwood Shores, CA", 
    "user_name": "Stephanie P.", 
    "review_text": "This place blows. One of the bartenders appeared wasted and spilled drinks. As soon as the bar closed, the 'bouncer' started yelling for everyone to get out. Asked for water and he said rudely, \"No. I'm not washing another glass.\" My friend was pushed by his trashy girlfriend and they got into a fight. Not a good time.", 
    "review_date": "2014-12-13"
  }, 
  "Q-Ysf1K_CaZbo3ZGUW_zUg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "foodbot c.", 
    "review_text": "I agree that there is a serious older crowd here - but regardless of age, everyone comes here for the music and to dance. The live band was bluesy and the crowd was going nuts. It's pretty tiny so be prepared to get smacked on the dance floor by strangers. Drinks were damn strong. Had a great time!!", 
    "review_date": "2008-03-10"
  }, 
  "KQJadAAWioqQj02mujVkIg": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Charlie V.", 
    "review_text": "Great music  Cheap drinks  CROWDED  Selection limited for a beer enthusiast like myself.  But the music made up for it. If only they had a more space and a bigger dance floor...", 
    "review_date": "2012-08-10"
  }, 
  "JseBksW8DVL596kJ18GGpA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gretchen T.", 
    "review_text": "My New Boyfriend works here. You might recognize him: long white beard, chew-stained teeth, been stationed at the front door of this historic den for alcoholics for approx the last 30 years. I never tire of his stories of breaking up bar fights, and he gives me free stiff drinks. It's like a match made in heaven.  The bawdy bartender, who also doubles as a CD pusher for the band, the always-amazing live music, and the mix of barflies and scared tourists--well, if this place gets any better, I'd havta hire someone to help me enjoy it!  The only down side is that my New Boyfriend has more suitors than you can shake a harmonica at, so I might keep the green-eyed boy around just in case....", 
    "review_date": "2007-11-16"
  }, 
  "R2p221627ZK5IhFBVI0OzQ": {
    "user_rating": 4.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Constance C.", 
    "review_text": "Love this place. It has old music you'd hear from different time periods, cheap drinks, really drunk old guys who look like they've been sitting in the same spot for 20 years and people dancing. This is a good place to come with friends but perhaps not a date that you want to impress anyhow.", 
    "review_date": "2009-03-25"
  }, 
  "4bJJVPYQrPaQ_EHoa6WmZg": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Awesome P.", 
    "review_text": "I heard awesome music coming from this little place while I was passing by columbus and went in. Crowded place, nice bartender, awesome music. People dancing to blues. And this was on a TUESDAY night!  If you're in your 20's: As with most blues places in the U.S., expect quite a few older people. But I felt that this bar had a good mix of old and young people. Another good place for blues is Gold Dust Lounge at union square, but that definitely had a lot more old people, and the music style was also older (happy-go-lucky kind of songs, contrast with more guitar-heavy stuff that I heard here).   Would definitely frequent this place in the next few weeks. Good place to come with friends or just to have a chat with the bartender.", 
    "review_date": "2011-09-08"
  }, 
  "zhMY628j23fJJzbzHhfOcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed B.", 
    "review_text": "Why don't I come here more often?", 
    "review_date": "2007-11-13"
  }, 
  "sXLAy83l7EwdZjsYFbaq0A": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Kara B.", 
    "review_text": "If you like blues, booze (or not), a little - or a lot of booty shakin, and you're not a choade, then, I highly recommend gettin yourself on over here. Cool, dark bar with requisite divey bathrooms, and old timers.  Amazing live blues bands.  What surprised me the most was hearing a booming deep blusey voice belting out some blues. And, all of that was coming from an older, tiny, geee-tar playing, Asian woman, dressed like she just came from her office cubicle!  Not only did she rock singing the blues, she is a bad-ass guitarist too!  She even sang a blues song that she wrote while in Japan, and sung it in Japanese.  She got a lot of people (even me) to get out there and shake what their mama gave em'.", 
    "review_date": "2010-06-29"
  }, 
  "_Idlsaw2hXJN8NtNWamt2Q": {
    "user_rating": 3.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Meg W.", 
    "review_text": "Warning Sign Posted: \"One Drink Minimum Per Person\" Really? Is this a problem? Warning Sign Posted Part Deux: \"No Loitering.\"  I do my best loitering in dive bars.  Confess: I was going to give this place two lowly stars, but I was clearly there too early, no band (yet?), and perhaps on an off night. I was one of about 5 people, present company included. And now that I think of it, I'm usually one of the oldest people in the bar... Not so here! I was a baby comparatively. And the only girl.   The drinks were cheap. The service wasn't so friendly, but I'm betting after a few visits, it would improve.   Well, maybe.  We dropped in here on a lark, and, truth be told, while I love dive bars, I think I met my match. But by all means, go! listen to some blues! don't loiter.", 
    "review_date": "2010-07-20"
  }, 
  "5j0QmE-ktdY2wfEYX2YStA": {
    "user_rating": 4.0, 
    "user_location": "Otford, United Kingdom", 
    "user_name": "Amy W.", 
    "review_text": "I have walked past this bar often ... never daring to go in ....... not sure why .. well that was until my pops was in town.   Pops is a great fan of Blues and Jazz and loves to dance. We had had a few at Maggies .... popped into Grant and Green and decided to check it out ...   What can I say! ? !   This place rocks! It goes back a lot further than i though and although still small has room to dance the night away .. which we did!   The bar staff are speedy and mix very strong drinks for a bargain price .. $3.50 for a voddy ... mmmmmmm!!!  I will definitely be going back ... I'm so glad I ventured into this little gem.", 
    "review_date": "2007-11-20"
  }, 
  "YiGC7JeOi0PvMIHUKMUyZA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt G.", 
    "review_text": "Imagine that weekend night that happens every once in a while where you're kind of tired and don't REALLY want to go out but other people are depending on you so you kind of get yourself out of your couch cocoon and wipe the stir-fry sauce from your face.  Got it?  Yeah, that's what I was feeling when my friends said that they were going to \"this place called Saloon in North Beach.\"  So I drag myself out and head up there and have to pay cover?  Totally lame.  I mention to door guy that I'm looking for my friend, tall and blond and he says \"that tall blond guy that hit me in the back and spilled my f-in' drink??\" and I'm like \"haha....no....\" as I walk up to the blond drink spiller and give him a hug.  But aside from covers and the occasional angry large person, the Saloon was an absolute blast!    I was so incredibly happy that I went.  The blues band was amazing to the point where you can't NOT dance.  Everyone is so happy and rockin out.  The sax player is this older woman who has crazy pipes and jumps on the bar and gets the audience to scream into her mic.  Everyone I was with agreed that we have to start going there consistently.  It kind of reminded me of that bar in the movie \"Wonder Boys\" that they go to, but with a live band and a little more energy.    The bartender seemed cool.  SInce it was too loud to actually communicate, I just pointed to Anchor Steam, he nodded, gave me the beer, put up 4 fingers, i gave him a 5 and he just pointed at me which I took as \"you're the man\" but may equally have meant \"i'm going to eat your first born.\"   Saloon is not a place to wear clubbing clothes or anything you can't break it down in.  Basically, the more you look like your parents, the better you will fit in.  In a nutshell, Saloon isn't the cleanest place, but if you like to dance to blues and don't mind hanging out with the older crowd, it's the type of place you'll want to take visiting friends to show them that San Franciso is the shit.", 
    "review_date": "2009-01-11"
  }, 
  "hRoCRf3hBMJH05CdUFkFAQ": {
    "user_rating": 4.0, 
    "user_location": "Beverly Hills, CA", 
    "user_name": "Tim H.", 
    "review_text": "I was in town on business looking for some watering holes to frequent for the duration of our contract. So my coworker and I walked in and grabbed some CASH ONLY (fyi) drinks, watched some patrons dance and nearly killed myself climbing down in the men's room to take a leak. Overall the lady behind the bar was friendly and overworked. The crowd came in to enjoy live music and it was fun.", 
    "review_date": "2013-10-30"
  }, 
  "pb1-wJAf-ZGkggABtMq73Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roberta W.", 
    "review_text": "You can't get any more old school than The Saloon.  I used to come here well over 10 years ago but hadn't been back in a long time.  I happened to pop back in a few weeks for the first time in years and I was rewarded wth some kick ass american live blues band. I don't know who the band was but I just couldn't believe how this place continues to deliver.  This place is an institution and needs to be preserved.  Great eclectic semi rough croed but you can't consider yourself a san franciscan if you have never been to the saloon.", 
    "review_date": "2011-01-30"
  }, 
  "vUyImCKoz4S7iMKUddD_gQ": {
    "user_rating": 5.0, 
    "user_location": "Washington, DC", 
    "user_name": "Robert D.", 
    "review_text": "You should come here for one reason,, and only one: to hear great Blues in San Francisco's oldest bar, the Saloon, established in 1861.  It's a dive bar but isn't that where the blues belong?  No food. Cash only.  Limited beer selection, Anchor Steam is the only craft beer, but who cares?  Did I mention it has great blues?  4 pm on a Saturday afternoon and people are dancing to the terrific Dave Workman Band.  Feels like 4 am in Chicago.  Correction: they also have Lagunitas IPA.", 
    "review_date": "2014-11-22"
  }, 
  "wLrj5eS2BZAMKu8vbKKJpA": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Sarah G.", 
    "review_text": "Shame on me for happening to have randomly just stumbled into this bar late on a Sunday night!! As a Bay Area native, a 15-year food and bev industry veteran (in the process of opening my own establishment in SF), and someone who has literally lived 3 blocks from here the past 12 months of my life...I am ashamed to say tonight was my first time patronizing the 'Oldest Bar in SF.'  Now dont get me wrong, it smells like the oldest bar in SF; but the drinks were stiff and cheap, the bartender was a friggen joy, and the band was GREAT! If you're not from around here and visiting this lovely city, do yourself a favor and swing by The Saloon...It wont be anywhere near the most posh, trendy, or expensive place you'll spend your time at while youre here...but it'll make sure you leave your heart in San Francisco.", 
    "review_date": "2014-10-27"
  }, 
  "8htYBIDxeU9SK5F3cDaLTg": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Christopher T.", 
    "review_text": "Awesome bar!  It's packed with locals and regulars who are super friendly...maybe too friendly.  Saw a guy in a cut-off sleeve looking for dance partners all around even after he got denied by a number of women.  He got his girl in the end though because who can resist dancing to some awesome blues music.  I ended up speaking to a regular who told me about the history of the place which was awesome--he looked like someone that's been through it all.   Don't come here expecting a trendy bar with fancy cocktails, because you're going to be sorely disappointed. PBR on tap--'nough said. Come here for the local flavor, the history, and some great music.    Bring a dance partner!", 
    "review_date": "2012-02-28"
  }, 
  "balhXuT7Pa2Sqb3cuTkDRA": {
    "user_rating": 4.0, 
    "user_location": "Denver, CO", 
    "user_name": "Kristine N.", 
    "review_text": "Pretty fun blues/jazz bar with a great vibe. There's a one drink minimum per person which is not bad at all. The band is really good and energetic. It's a little divey and smelly but once you get on the dance floor, none of that really matters anymore.", 
    "review_date": "2014-10-15"
  }, 
  "fjvLxW976IgZwHj6YmOIDw": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Janet S.", 
    "review_text": "Okay it is what it is and if you can deal with that, you will love this place.  The music was incredible - jazz band - bass play was AJ and they were amazing to listen to and had everyone going crazy in the little place.  It is the oldest bar in the city, the drinks are cheap and the staff all looked like they had been there since it opened (the bartender said he had been there 29 years!), but we loved it on our bar hop.  The customers at the bar were entertaining and friendly - if you are easy going and like to have a good time hangin, you will love the place!", 
    "review_date": "2009-10-21"
  }, 
  "YbZg36FoMgkKcTEPae5siA": {
    "user_rating": 2.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Amy J.", 
    "review_text": "Wow. Just wow. I don't care if you're the oldest dive bar in SF if you're going to treat your customers like crap. The only reason they're earning two stars is that you can enjoy some pretty decent live music and I'm all for supporting a local place that gives musicians a place to thrive.  Cash only. One drink minimum PER person. As soon as we walked into this bar, my friends and I received attitude from the female bartender. Why not card everyone in our party instead of singling out certain people? Every drink I asked for they didn't have and then she responded with, \"Can't you see we don't carry that in our bar?\"  Um, it's your job to know what you put in the drinks not mine last time I checked. Lose the attitude, lady because you'll end up losing customers and possibly your job. It's not like I asked for anything that they don't carry at most bars.  She took awhile to take my friend's drink orders too. I get that you're busy and you're the only one working at the bar but the attitude won't earn you a good tip. They only were getting beers which apparently were posted on a sign because when they asked what was on tap she just pointed to the sign hanging pretty high up on the wall BEHIND the bar. That's a great place to put it considering we were facing the bar in the opposite direction. Thanks for being SO helpful. (I'm being sarcastic can't you tell?)  Since I obviously couldn't sit there without ordering a drink (I actually read the signs unlike some people). I walked out of the bar annoyed by the 'tude. You're not getting my hard earned money with an attitude like that.  I know why you enforce the one drink rule because you don't want people going and loitering in the bar to hear live music and this is the \"dive bar\" mentality at some places but in order to earn respect you have to give it and I didn't get any from the staff at this bar. I like most dive bars and I don't mind a little dirt and some character but this was by far one of the worst experiences I've had at a bar in SF.  It's too bad because this bar, unlike a lot of bars in the city seemed to attract a much more diverse crowd than other bars in SF and the prices seemed reasonable.  I'd only go back to listen to music and if they actually stocked something I could drink. Sorry, if my tolerance to alcohol doesn't live up to your standards but in order to survive, you're going to have to adapt to your customers' needs until then I won't be patronizing this bar or telling my friends to go here either. We are the ones that are keeping you in business and helping you earn your paycheck.", 
    "review_date": "2013-10-21"
  }, 
  "WbPrQlOtQsUC1kdeJBAfAQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Yoko S.", 
    "review_text": "What a fun place! In spite of the location, it's not a tourists hang out, sort of older local hang-out. I'm with 3 women, we initiated dancing and other people started dancing. Cheap drinks with no cover charge. Had an awesome time.", 
    "review_date": "2010-02-16"
  }, 
  "eMGu2IN_pW602rtqVk__vw": {
    "user_rating": 5.0, 
    "user_location": "Bakersfield, CA", 
    "user_name": "Don L.", 
    "review_text": "A friend led me to this joint during a city wide bar hopping trip on his birthday. This is the only place that truly stood out for me. I've been back more since. There is a feel to this bar that is unlike any other. You can feel the history in the walls and get a sense that the way it is now is not so different than the way it was decades ago. There is always live music of the rockin' blues variety. People are always dancing with various skill levels, the extremes being the most entertaining especially when they dance right next to each other. You'll see a Elaine Benis style dancer next to a John Travolta. I'm sorry I'm not that versed in dancers and their dances so my anology suffered. In any event it's a good time.", 
    "review_date": "2007-01-16"
  }, 
  "1nNQa2cHJUcsaK_gMlC7wg": {
    "user_rating": 2.0, 
    "user_location": "Mission Viejo, CA", 
    "user_name": "Alvin D.", 
    "review_text": "How we got here, I don't know... What a joint, immediately we meet several locals each having their own history of the bar.  Dubbed as the oldest saloon in SF, probably has not been cleaned since it's Grand Openning.  One of the stories was that it survived the Great SF fire of 1906 because it sat high on the road and that the above hotel was a brothel.  The night of the fire a bunch of navy men on liberty were using the facilities and help stave off the fire by pour buckets of water around the saloon to preserve their favorite brothel....Anywho, Harry comes of of the place and says \"bro you have to use the men's room\"  weary of glory holes any other surprises local to SF I said hell no, I don't have to pee.  He insisted that this will be a memorable visit.  By memorable meaning getting raped, forget it.  After bribing me with drinks, I finally checked it out.  What a cluster f#$% of a rest room.  As you open the door, it is filled with graffiti, you have to go down seversl steps, navigate low hanging pipes, and survive the stench.  I come out of there saying man that's a bitch to get out off, then Harry says imagine if you were in a wheel chair!!!! There were no shortage of freaks going in and out, walking by and just hanging out.  There was this thing about 6'4'' and had high heels and cheap make up.  Looked like Dee Snyeder in an evening dress, after seeing this thing it was time to go. What an experience.", 
    "review_date": "2009-08-19"
  }, 
  "JAY1GmMWtRwA2VgV1ylvug": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Gina H.", 
    "review_text": "Fun, loud music with a lively crowd of passersby, tourists and locals alike. Reasonably priced for North Beach with mostly bottle service and full bar with Pabst on tap. I'll definitely return!", 
    "review_date": "2011-07-14"
  }, 
  "KAvSJ995EvF3pBYcTKBeoA": {
    "user_rating": 5.0, 
    "user_location": "Ottawa, Canada", 
    "user_name": "Mikey X.", 
    "review_text": "The Saloon is a great place to go to see live music and dance the night away. They don't serve many complicated drinks there so just expect to drink beer and whiskey the bartender - mind wiped by years of drug use -  didn't know what Red Bull was.", 
    "review_date": "2010-02-19"
  }, 
  "hE34xpG35WugHznWf79HfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drue C.", 
    "review_text": "I truly thought that a dad getting a hooker for his son on his birthday was one of those things you heard about but didn't REALLY happen. I haven't met anyone yet who can confirm that this is how they spent their sweet 16. They just know someone who knows someone from the back hills of Montana who lost his cherry somewhere in Reno after a long road trip and some quality bonding.   At least that is the story I had until I came here and saw it with my very own two eyes. Except the son was 21 and still hadn't been laid and the dad was getting himself a piece of the action as well.   This is the sort of random scene you might stumble upon at this worn down hole in the wall that's has been around long enough to see it all. You never know exactly what you are going to get, with the exception of a strong drink and some kick ass live blues and jazz. Its just that sort of place. Full of surprises while providing a consistently interesting time each time you walk through the door.", 
    "review_date": "2008-12-20"
  }, 
  "KPWVxic04yevbAfvLEaJtA": {
    "user_rating": 5.0, 
    "user_location": "Hillsboro, OR", 
    "user_name": "James K.", 
    "review_text": "I stopped in on their 150th anniversary just to check it out.  I had no idea what to expect.  Luckily, I saw Ron Hacker and the Hacksaws perform for several hours.  Ron is an incredible musician and if you ever have the chance to see him, you should go.  I've watched many Blues bands over the years and was not a huge fan.  Ron absolutely takes it to another level.    The bar itself is the quintessential dive bar, as indicated by beer signs and the small fake multi-color Christmas tree on display year round. The cover is never more than $5 and the mixed drinks are very cheap ($5-7) by North Beach standards.", 
    "review_date": "2012-01-08"
  }, 
  "0H5ZRiO19kt9ozOzBmDDSw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark P.", 
    "review_text": "I really like this bar.  Although I am not really a regular I have come here for a lot of years and for me it has a really warm old san francisco feel.  Lots of drunk by in large friendly people, cheap drinks, and pretty cool bartenders.  It's nice to go on weekday nights when there is no cover and not too crowded.  Lisa Kindred is a great  local singer.  Once I also saw chicago blues greats Louis Meyers and Jimmy Rogers there also.", 
    "review_date": "2008-01-25"
  }, 
  "W_ds8g8jSNf2DLHcCHexxA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Anna V.", 
    "review_text": "This is such a kick ass bar that seems so hard to find these days. The blues bands that play here are great and everyone is really laid back, friendly, and easy going.   The Saloon holds a lot of history, being the oldest bar in SF. If you're looking for a trendy bar, keep walking!! The age of the crowd here ranges with a lot of middle aged patrons who know how to have a good time.  Cash only!", 
    "review_date": "2012-02-13"
  }, 
  "JF-7fBtuA_l5R650Iqe7RQ": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "jen d.", 
    "review_text": "This is a true dive in the middle of North Beach.  Cheap drinks, good music and excellent characters abound.", 
    "review_date": "2013-12-18"
  }, 
  "O2WjTCsuIWMxhejj-4aGHA": {
    "user_rating": 4.0, 
    "user_location": "Corona, CA", 
    "user_name": "Tim K.", 
    "review_text": "Legendary experiences start here. Strange but nice people, ice cold tap beer, the men's room is like Frankenstein's toilet. I would say its the most unique place on the planet. Planet Saloon, that's what I'm calling it now. Don't pass up a chance if you're in the neighborhood. If you like your bars a little rough, sticky, or dusty then you'll love the Saloon. Its the real deal.", 
    "review_date": "2014-04-16"
  }, 
  "3S-HXvKWDwW6AFjVDNtryw": {
    "user_rating": 5.0, 
    "user_location": "Grand Rapids, MI", 
    "user_name": "Samantha T.", 
    "review_text": "The service was incredible and the drinks were stiff. Great live band and all the regulars were incredibly welcoming.   If you're looking for fancy, go somewhere else. Looking for friendly and comfortable?? Get here already!!!   Also, being cash. They don't accept credit cards.", 
    "review_date": "2014-07-07"
  }, 
  "E37wtDFsSBJampwkmi0lBQ": {
    "user_rating": 5.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Scott F.", 
    "review_text": "Oldest bar in SF and a fun place when we were there. Ambiance ain't much to write home about, but it's ancient and the live music was killer, of which was playing with no cover at 430p on a random Saturday. Only cash.", 
    "review_date": "2014-05-29"
  }, 
  "r1BM6Jb4VKT_aRanY5fxcQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rod '.", 
    "review_text": "An SF institution.  I just can't shake this place off.  I keep wanting to go back.  Awesome blues (local bands and etc.), decent bartenders (never knew what happened to the 1 female bartender from 2002) and definitely affordable.  It's also a good first date place to scare the bejesus out of him or her.  Last time I was there, I had a great time, but the bathroom was backed up.  What can you say ?  It's definitely not for everybody.", 
    "review_date": "2007-03-09"
  }, 
  "OMoBzr4FhDkk7yV8zYtmiw": {
    "user_rating": 3.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Noel M.", 
    "review_text": "Cheap, liver destroying drinks; what's not to like?  I'm glad they keep this tiny bar clean but it only took a couple of minutes to start tasting the Pinesol that was heavy in the air.", 
    "review_date": "2013-04-01"
  }, 
  "p5iEpz8IHpLySQHsjlTy5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Captain Happy Pants H.", 
    "review_text": "This is one of my favorite holes in the wall to go in the City.  I have a passion for good ole blues guitar and this place does not disappoint.  One of my fondest memories was walking in with a friend and being the only ones under 40.  I realized then that this place was all about the music.  I ordered my favorite drink, a filthy martini w/ extra olives.  It tasted like dishwater but I should have known better.  I proceeded to get drunk enough on those sub-standard martinis to belt out a reverse rendition of \"You lost that lovin' feeling\" during a break from the live music.  The bar seemed entertained by this impromptu performance and clapped at the end of my inebriated display.  This place breathes character, charm and AMAZING music.  Not for the faint or yuppie at heart.", 
    "review_date": "2006-12-26"
  }, 
  "oQba6A60HadfVKakbi2jXA": {
    "user_rating": 4.0, 
    "user_location": "Louisville, KY", 
    "user_name": "Chris W.", 
    "review_text": "Hole in the wall, ancient place.  A little warm inside with the heat on but hey its not bad.  Incredible place to go listen to some music and cut a few dance moves.  Must see pub as 1 of the oldest in San Francisco.  CASH ONLY place which is kinda a negative too, most people only carry plastic these days! :)", 
    "review_date": "2013-02-07"
  }, 
  "zDltf7SGyDANcA6ndZkF7A": {
    "user_rating": 2.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Julia N.", 
    "review_text": "I get it, The Saloon is a SF staple, a landmark, blah blah blah...and ya know, I enjoyed my incredibly stiff drink. But it smells like pee in here and maybe it's the \"Marina\" in me but I just can't deal.", 
    "review_date": "2009-08-02"
  }, 
  "QuZbJquRtbY9O9JrB9NpxQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jim W.", 
    "review_text": "I heard this is the oldest bar in town.  I'm not sure about that but it's old, old school dive bar.  There wasn't much going on when we dropped in other than the bartender dancing to Motown but it was early in the evening.  I was trying to pace myself (you see, lately I have been having honchos from corp meet me in SF and they want to bar hop late in to the evening...cool by me but I need to be able to function, hence the pacing) and I momentarily lost my judgement...you see, I ordered a Jameson with ginger ale.  What I meant was ginger ale back but the bartender took it as a mix request and promptly shot back, \"I won't do that to Jameson. Rocks or neat?\"    Props to the bartender.", 
    "review_date": "2013-01-28"
  }, 
  "W7fnLf_rH3uIyrOTux_KBQ": {
    "user_rating": 4.0, 
    "user_location": "St Paul, MN", 
    "user_name": "Eric A.", 
    "review_text": "This is a great place if you want to hear the blues.  I've been here several times when I'm in town, and it definitely lives up to the \"divey\" reputation.  Not that it's bad, but if you're expecting glamorous food with your Pinot Noir, you're at the wrong place.  Are you ever!  Blues, cheap good drinks, and local color.  Enjoy it or don't go here.", 
    "review_date": "2011-06-02"
  }, 
  "legEZzXG28Hy0ikwMnOLzQ": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Miguel S.", 
    "review_text": "What a whacky, throwback, total dive bar. Walked in at 3:30 on a Friday afternoon &amp; a kickass rockabilly band was already rocking their asses off.   Fun bunch of characters in there, too. PBR is the only beer on tap. Cash only.   I dunno, maybe you just had to be there... but I'll definitely be going back.", 
    "review_date": "2012-12-29"
  }, 
  "5_hVNmcBE-nZtok3otLThQ": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Tanya T.", 
    "review_text": "Great place to relax after walking around Downtown Half Moon Bay... awesome atmosphere, great people, good beer and bloody mary's, and from what I saw, the food looked good too!", 
    "review_date": "2013-07-03"
  }, 
  "T8jYpkC7F8Tyv6IFy5u5UQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel V.", 
    "review_text": "Great place if you like jazz and blues. Don't judge it by the shady looking entrance. The band is 3 feet from you and there's just so much energy every time I go.", 
    "review_date": "2012-10-07"
  }, 
  "4JwyxbHSr4mcdabVKL-WNA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy L.", 
    "review_text": "absolutely unbelievable.  live music that's soo much fun to dance to.  it's nice to be on a dance floor where I'm not concerned about guys grabbing my ass... why do they think they can do that?  there's always lots of locals hanging out, the place is super divey, and it's the best place in the city to hang out on a sunday afternoon or a random weeknight.", 
    "review_date": "2008-03-10"
  }, 
  "b1Iu7lgKqMB6i-6-bXjmfQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Peter S.", 
    "review_text": "Go for the history, not the ambiance or clientele... Wine from a box....I say nay nay", 
    "review_date": "2012-08-10"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "Come for the music - they always have an awesome band playing, kid you not...  The booz (I can't believe I'm saying this) is secondary here - of course, one can have a lot more fun throwing down a few BUT the music will get you either sober or not.  You can't beat this place for diversity from bikers to yuppies...the lady behind the bar is coolio.  I think we scored a brownie point with her when we declined a glass for our beers - quoting her \"I really appreciate that...\" and our reply \"...no prob - tastes better from the bottle!\".  Yes, the place has an overwhleming scent of Lysol cleaned bathroom as you entered but that just means they are clean.  The bathroom is cleaner than a lot of joints around town so take that!  Go and have yourself a swinging time!", 
    "review_date": "2008-03-17"
  }, 
  "tweNOS3Bqz863y6PyyVxVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rei O.", 
    "review_text": "Man I miss The Saloon... I've only went once, and I ended up there by accident. My friend's and I were wondering around this area looking for a good place to drink, and there it was. I immediately recognized the bass lines to Albert King's Born Under A Bad Sign, and I knew it was the right place.  The rest is history. Eugene Higgins and his band were playing there, and MAN they rocked!!  This blues bar ain't pretty looking, but it sure gives a nice saloonish environment that I sure dig. The music is awesome, and the crowd was really cool too.  The only issue I had was that they didn't have beer on tap... I had a couple of bottle beers, but once they have tap, it's an easy 5 star from me!!", 
    "review_date": "2010-09-08"
  }, 
  "8J9JdSl0d7z9sSsIjgl8HQ": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Con C.", 
    "review_text": "This place is great! Fairly priced drinks and live music are a combo I'm always down for. I went here for the first time and caught a smoking rockabilly group called The Bachelors who perform every Monday night. It was great and their set ranged covers of Elvis' \"Little Sister\" to \"Miserlou\" to The Ramones \"I Wanna Be Sedated\", rockabillified.  Also, I got to watch the bouncers toss some asshole who was harassing the bartender out on the street. (I had to call the cops for the guy's own protection because he wouldn't go away and I was afraid they'd beat him senseless). I don' t know about you, but for me this constitutes a fun night. An aside--not be a \"hater,\" but I'm kind of not into the current rockabilly fad: These guys transcend all that BS with full-out, authentic dive bar rockin'", 
    "review_date": "2007-02-06"
  }, 
  "NkVYcoaThHjOfTTgq6OdHQ": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Michelle I.", 
    "review_text": "i think this is supposed to be the oldest bar in SF... it sure looks that way. always an older crowd but if really look, you can tell these are probably the same people who've been coming here since 1975. happy drunk people dancing in the little alley on the side, a loud band playing inside, harleys. this place has its own personality that i dont think you'll find anywhere else.", 
    "review_date": "2005-05-14"
  }, 
  "BaveUVWRiGX6Y8IFPcEb1g": {
    "user_rating": 3.0, 
    "user_location": "Kelvinbridge, Glasgow, United Kingdom", 
    "user_name": "Duncan W.", 
    "review_text": "The oldest bar in San Francisco. It really felt like it too. Not really a decent selection beer. Nice for nostalgia but they really need to replace their loos.", 
    "review_date": "2013-03-06"
  }, 
  "_peJ2KUBkpBhKMoYFwkiaQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott G.", 
    "review_text": "Been here twice in the last 3 months and last night proved our experience in April was no fluke. Exceptionally nasty bar staff, terrible drinks in tiny glasses (but cheap as they should be), gross bathrooms and several patrons that are \"uppity\" (as our friends said). The saving grace - and reason for 2 stars instead of 1 - is the live music was quite good on both occasions. Not much room to dance however. We will do our best to not come back!", 
    "review_date": "2014-07-13"
  }, 
  "Dt3Nxfwa4LonEG_R5b1sCg": {
    "user_rating": 2.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Flash Z.", 
    "review_text": "We love dive bars but this place was getting close to too divey for us. The bartender was a 70 year old woman that seemed to be on drugs and had no teeth.  She shorted us 10 dollars in change and gave it to the girl next to us and had no clue because she was helping too many people at once. They let kids into the bar which I found funny. It was awesome that a blues band was there and it was no cover just one drink min...but the lead singer was creepy the night we were there... He kept staring at all the women constantly. Interesting experience.", 
    "review_date": "2012-08-12"
  }, 
  "txWFXIMtDUaheiePKnAQyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny R.", 
    "review_text": "I would give the Saloon five stars had it not been for the terrible service and inexcusably weak drinks.  The blues band and singer were nothing short of brilliant.  I mean, the singer was wearing a full bright red suit and rattled out a thirty minute song about how his wife threw him out of the house after he didn't come home one night.  Really, how can you go wrong with that.  And then all the old foges got up and started kicking up their heels . .  . it really feels like you've been transported to South Carolina . . . or California in the 1800s, I suppose.  But my god, you practically have to kill a bitch to get the bartender's attention, even early in the evening.  And after five greyhounds, I began to realize that they were sadly devoid of alcohol.  Anyway, it's certainly a good time, but be prepared to wait forever or wave your arms around desperately to get a drink.", 
    "review_date": "2012-01-12"
  }, 
  "77otvQtuEXYqapllbbLqQQ": {
    "user_rating": 2.0, 
    "user_location": "Aurora, CO", 
    "user_name": "David S.", 
    "review_text": "Of all the dive bars I've been in, this joint is ...  one of them. As other have mentioned, the most impressive thing about the place is the smell. Good blues. Surly service. Oh, and it's old. Overall, a remarkably unremarkable experience.", 
    "review_date": "2014-04-05"
  }, 
  "hj77ZKZk2W0UVb58upEeuw": {
    "user_rating": 5.0, 
    "user_location": "Lakewood, WA", 
    "user_name": "devon g.", 
    "review_text": "This is one of the oldest bars in California. If you come in early during the day you have a change to sit around and talk with old beatniks, hippies and artists. This is my favorite bar, by far. They also have amazing live music.", 
    "review_date": "2012-08-21"
  }, 
  "xQ-iIsDqwhmiAhbtwP3Ezw": {
    "user_rating": 4.0, 
    "user_location": "Westminster, CA", 
    "user_name": "Brad H.", 
    "review_text": "Takes awhile to get served. BUT, the music-------- FANTASTIC!!! I love this place!!!", 
    "review_date": "2012-02-07"
  }, 
  "ACwy7fi__QndA_zsaLnU9w": {
    "user_rating": 5.0, 
    "user_location": "Raleigh, NC", 
    "user_name": "Melissa J.", 
    "review_text": "San Francisco at its finest!!!  I've never found anywhere else in the city where you can order two  whiskey on the rocks and a gin tonic for under $8 bucks total.   The bouncers at the front door looked straight out of zz top. The bartender was probably more drunk than I was, and the band was this amazing old Jazz group that probably formed during the summer of love.  It was a totally dive... and absolutely incredible. For those of you who found this place offensive... do us all a favor and go back to your yuppy martini bar where the drinks are $18.", 
    "review_date": "2008-07-06"
  }, 
  "DpiMuxg2g4urzClzjykUHg": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Em L.", 
    "review_text": "The perfect bar. Show up, order a drink and start dancing. When your parents come to town, bring them here for a fun time. The blues is amazing. The band wants you to get out and dance and they don't care how you look while doing it.  If you don't have fun here, you've got problemas....ha!", 
    "review_date": "2012-02-13"
  }, 
  "LNwtLORYeEQK9yfH-rPGdQ": {
    "user_rating": 5.0, 
    "user_location": "East Bay, CA", 
    "user_name": "melinda c.", 
    "review_text": "sometimes my thoughts and opinions are more easily expressed via lists......  Amazing Things About The Saloon:  1) hidden amongst gross clubs and clug go-ers in N. Beach.  2) the bartender who looks like he has worked there forever.  3) cheap drink......like really, cheap drinks.  4) the dressed to the nines, octogenarian couple that waltzed in, danced to two songs, took everyone's breath away and walked out.  5) the group of yuppies who seemed to think a monday was a good night to do a lot of drugs and scare everyone off the dance floor.  6) the AMAZING band, The Bachelors who should be local celebrities for sure.  best. thing. ever.", 
    "review_date": "2007-08-22"
  }, 
  "82dCHyU-ANOgdhxUgZsUeg": {
    "user_rating": 2.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Marlon T.", 
    "review_text": "It gets extremely crowded in here, especially on nights where a band is playing. Speaking of the band, after I got a drink, I went to the very front where the band was to snap a quick photo of an awesome group. While standing up there, some woman told me, \"you need to get out of here\" and pointed away. My first reaction was that she was an employee and there was no photography allowed so she was regulated. I was pulling out my wallet to donate to the band which never happened because of this incident. Retrospectively though, I think she was just really drunk and because I wasn't doing white-girl dancing, she didn't want me to be in front. Too bad--the band would've came up a few dollars. Sadly, this represents my experience of The Saloon, one of the oldest bars in SF. Because of this terrible person, I had a bad time here. I still got a couple good photos of this awesome band. I paid $5 for cover for an OK experience. I would very much like to check this place out on a non-cover, non-busy time just to \"be\" in the essence of this old drinking establishment. Sorry Saloon, blame this terrible patron for this 2-star review.", 
    "review_date": "2013-06-08"
  }, 
  "7p5nTW9Tpw_3VDC4vuLSBQ": {
    "user_rating": 5.0, 
    "user_location": "Santa Ana, CA", 
    "user_name": "Betancourt E.", 
    "review_text": "Wow, One of the best bars I've ever been to!!!! We saw Curtis Lawson and his band there, rocking the house and the drinks were loaded and cheap. Luvv this place, San Francisco's oldest bar, the bartender are kick ass and so is the crowd. The patrons were down to earth and very chatty, would definitely go back and throw some drinks down there again. Luvv The Saloon.", 
    "review_date": "2012-01-23"
  }, 
  "ugHHCgv-MU3mPfSuHBHNlA": {
    "user_rating": 5.0, 
    "user_location": "Camas, WA", 
    "user_name": "Lauren H.", 
    "review_text": "LOVE THIS PLACE!!! It is a bit small, but that adds to its charm I think. Inside you can dance to live blues music and it is absolutely a blast!!!", 
    "review_date": "2009-01-31"
  }, 
  "9mp-1oHJU0Z-bouISJa35Q": {
    "user_rating": 5.0, 
    "user_location": "Tampa, FL", 
    "user_name": "Luke W.", 
    "review_text": "My favorite bar in the world. The people that work here and the people that come to get their drink on are some of my favorite people I've ever spent an evening with. The Bachelors have played every Monday night for 20+ years, and never get old even after seeing them over 50 times. The bartenders are old-school and actually know how to properly mix drinks like an Old Fashioned. And I don't think drink prices have changed since 1999. I will be devastated if this place ever changes or remodels. Thanks to owner Myron Wu for keeping this place \"real.\"", 
    "review_date": "2014-01-10"
  }, 
  "T1onvez6kj1aKChjFQCTOQ": {
    "user_rating": 3.0, 
    "user_location": "Tracy, CA", 
    "user_name": "Robert R.", 
    "review_text": "Scenario: Too many people at Maggie's so my friend showed me this place.  Product:  The live blues was unexpectedly phenomenal.  The beer was cheap.  What more do you need.  Too bad there was a cover, but it was necessary that night, being so packed.  Service: Ha!  Atmosphere: Where the hell do I start?!?  It's a saloon.  No really, a SALOON.  The patrons are baby boomer age.  The chicks look like biker chicks.  The dudes look like biker dudes.  The guy at the door could be Willie Nelson's half-cousin.  The bartender's voice was rustier than a Pinto.  And that other guy at the bar was eyeballing me somethin' fierce like I was gonna take his beer or something.  There are signs around letting you know you shouldn't park you motorcycle in the alley.  It was crowded, which is unusual according to my friend.  Uniquity: Good music, or good bad music.  Either way you're golden.  And $3 Bud with a very laid back crowd.  I told my friend if I brought a girl here some day and she liked it I just might marry her.", 
    "review_date": "2009-01-08"
  }, 
  "8yOtbrH9VMAHQjsJrBqLtQ": {
    "user_rating": 3.0, 
    "user_location": "Eureka, CA", 
    "user_name": "Pizzle D.", 
    "review_text": "I understand that this is certainly an iconic blues dive bar (one of the oldest in sf), but it smelled like SHIT!! I've been to plenty of stinky dive bars in my time, yet, this one takes the cake. I would have probably stayed and got schnockered, cause of the strong cheap drinks, however, it smelled like someone died, losing their bowels in the process. Honestly, I think they had a busted sewer pipe, I'm not shitting u (pun not intended).  The music is fun and they have a gig lined up every night.  I'd probably give em 3.5 stars because of music, cheap strong drinks, and a pretty cool bartender (the big dude in the biker vest). Just make sure u bring your nose plugs.", 
    "review_date": "2013-08-04"
  }, 
  "T4E1PMvIF78PKVMXnYcuRw": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Greta R.", 
    "review_text": "Solid neighborhood bar.  I believe this is the oldest bar in San Francisco but I'm not sure.  They often have live music which is a nice treat in a bar these days.  Bartender is a pro.  Efficient, fast, friendly.  All around a great place to drop into when you're in the neighborhood.", 
    "review_date": "2014-02-15"
  }, 
  "gTxigDuZ9BIKmkRsjQ5vMA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Georgio N.", 
    "review_text": "The Saloon remains one of the last old school Blues Bars in San Francisco. There was once the Blue Lamp on Geary. But it metamorphosed into the \"Swig Lounge...\"   The term \"old school,\" really does apply in the case of The Saloon. This is reportedly the oldest bar in town. Those drunks of years past had to be careful walking out of the place in the post Civil War years, to avoid being shanghaied on some random ocean voyage.   The bar sits on Grant near Columbus. When you walk inside you'll see why it is still simply called, \"The Saloon..\"  The place has remained the same for years, with a long bar, old wooden planks for a floor, and the same bearded door man..  The Saloon's building somehow survived the 1906 earthquake, and has held onto it's authenticity despite the ever changing landscape surrounding it. I can think of no better place in San Francisco to enjoy a stiff drink while listening to live blues.  Tommy Castro used to play here along with some others.  Johnny Nitro jammed here on Friday and Sunday nights. The man was a local legend on guitar. Somehow when I am drinking a jack and coke here, I feel no guilt, no pain, only good spirits of past and present.    Sadly I just heard some tragic news regarding my favorite resident bluesman at the Saloon....  Rest in peace, Johnny Nitro.. The late great pope of North Beach.  <a href=\"/redir?url=http%3A%2F%2Fwww.sfgate.com%2Fcgi-bin%2Farticle.cgi%3Ff%3D%252Fc%252Fa%252F2011%252F02%252F20%252FBAN81HR1FE.DTL&amp;s=de91eef4c0affafc7de3aa301fd327f8aa7d4617616e1d3f040817f8b54e7488\" rel=\"nofollow\" target=\"_blank\">sfgate.com/cgi-bin/artic…</a>", 
    "review_date": "2010-12-22"
  }, 
  "NTXyiQRHvc_IjsuFmJt--A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "I love The Saloon.  The bartenders are nice and happy to serve.  The music is some of the best you'll hear in the city.    The last time I went here, a lady came out of the bathroom with white dust on her nose, grabbed a broom from the broom closet and began sweeping the floor.  She only had one arm and I'm pretty sure she did not work there.  Not wanting to stare, I moved over a bit and a man with no teeth began chatting me up.  Thing is, I felt completely safe the entire night.  Bring your dancing shoes.", 
    "review_date": "2010-01-02"
  }, 
  "mveiiXTA_CU8RsSKAZZx5g": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Andrea P.", 
    "review_text": "I'm nearing 50 but the night I went with a 20+ colleague, I was younger than most by about 20 years.  My workmate was downright overshadowed.  The music great - the bassist was blistering, the drummer was phenomenal.  The crowd was having a great time, maybe because at this age, you don't give a ***, you just want to have a good time.  That meant that it felt friendly and relaxed and fun.  The price of the same bottle of beer fluctuated, but it didn't matter. It's the kind of place you wish you had in your own city.", 
    "review_date": "2009-04-19"
  }, 
  "apX-FaMlzeBDx38Tba2nUw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dave L.", 
    "review_text": "Oldest bar in San Francisco, established in 1861. Great blues, cheap drinks, and a fun crowd.  You can't help but dance too.  Go there tonight!  Oh yeah, and after don't forget to grab a slice at Golden Boy.", 
    "review_date": "2006-09-27"
  }, 
  "4BXqlLKW8oP0RBCW1FvaIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina S.", 
    "review_text": "I spy with my little eye a bar that looks very familiar to me in this crappy romantic comedy called \"Just Like Heaven\" with that actress Reese Witherspoon and her crazy chin.  Why yes, I've been to that bar.  It's the Saloon.  The only reason I have ever been to the Saloon is because of my sweet, blues obsessed Dad and Uncle Jesse.  These dudes loooooove this place and would probably live here if not for the fact that they live many moons away.  So my Dad dragged my sister and I here one night.  We walk in to a sea of old timers and a few young ladies surrounding the stage area.  A blues band is playing and they are really getting the crowd going.  Dad, sis and I are just chilling at the bar sippin on cocktails and Dad is jiving to the tunes and making friends with the other bar flys and the decrepitly old bartender.  The drinks are poured with a heavy hand and Dad keeps them coming.  This place gets pretty packed for a weekday night.  The vibe is cool to my surprise.  I had a great time at this bar and will probably never come back on my own, but will definitely accompany my Dad next time he's in town.  ***** i forgot to mention that my Dad calls this bar the \"Star Wars Bar\".....due to all the freaks.  Dad is funny.", 
    "review_date": "2008-03-26"
  }, 
  "FI0dcCAuFmW0lutdKO2UwA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle K.", 
    "review_text": "A good place to meet hungry out of town cougars looking for a good time.  The place has a cheap slutty feel to it.  No attitudes, cheap booze and live music that the cougars love dancing to.", 
    "review_date": "2009-08-04"
  }, 
  "9OXGWy6UWCxZFCAlezlg3A": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Marc A.", 
    "review_text": "Don't let the view from the outside keep you from coming in and having one heck of a great time at The Saloon. There's always live music played by guys that know how to play music and have a great time doing it. The dance floor is filled with tourists and locals alike all groovin to the tunes and the cash only bar drinks. Come on in and get up to get down!", 
    "review_date": "2010-11-11"
  }, 
  "FWyjAgtNrIEnFOF7Ba_Cag": {
    "user_rating": 5.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Steven G.", 
    "review_text": "It's been years since I last reviewed the Saloon, so I thought it time to re-visit the oldest bar in San Francisco.    OK, by day it  remains a loser bar.  And yes, despite an occasional hosing it  still  smells faintly of urine and bleach.  And, in truth you probably shouldn't visit the bathrooms unless it's an absolute emergency.  BUT, by night the place becomes a rockin' blues joint, with cheap drinks, a friendly crowd (tourists and tons of locals), and absolutely the best live blues this side of Memphis.  North Beach favorites Blues Power hold forth most Sunday afternoons, Ron Hacker on a Saturday night is not to be missed, and in fact all of the music is so good that you really can't go wrong.  If you don't get to dancing here, you just don't dance.  This place is still, hands down, my favorite bar.", 
    "review_date": "2013-10-24"
  }, 
  "5tQxgSFYHGNWFoWC7k7_hw": {
    "user_rating": 1.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Daniel P.", 
    "review_text": "I've been going to the Saloon for over 25 years, and it's always been my favorite bar. On Saturday 8/23/14 I stopped in with my girlfriend and was checking to see who was playing that afternoon. While my girlfriend was in the restroom I was talking to the bartender, but he was being a total dick so we decided to leave. Later that afternoon we were taking pictures in North Beach and of course I wanted a few of the Saloon. While I was taking pictures my girlfriend pointed out that the RUDE bartender was flipping us off. Over the years I have spent thousands of dollars at the Saloon, and brought in tens of thousands of dollars if you count all of the people I brought with me. What a great way to treat a customer that's been going to the saloon since the 80's. I have one star because the bartender was a total ass. I would have given less if I could. I suppose if he had not have been there I would have given 5 stars and I would have stayed around and enjoyed some cold beers and killer blues by Perry Welsh. But that wasn't going to happen with \"Mr Friendly\" working behind the bar.", 
    "review_date": "2014-08-24"
  }, 
  "ctr_BlCf3Ogny-vLs8E9tQ": {
    "user_rating": 3.0, 
    "user_location": "Marseille, France", 
    "user_name": "Justin C.", 
    "review_text": "Dirty, but oh-so-North Beach.  Go here for Blues Power on Sunday afternoons  but skip that ass-hat Johnny Nitro.. He's a douche. :)", 
    "review_date": "2009-02-02"
  }, 
  "7mzACXQ5F4EduE9jF_tI-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hailey P.", 
    "review_text": "Being from a small town in WI as soon as I walked into this place I felt home... If you can get past the musty old bathroom smell this place is great!   Born in 1861 its been around a long time.. and the drink prices haven't gone up much at all... its a great place if you are a fan of Blues, we drank and danced our night away..   The crowd is a good mix actually of old townies and people in their 20s  As for the bathrooms... I was afraid to enter, but it was clean, and smelt better than the bar itself (I hear the mens room doesn't lock however)   ....in conclusion: I definitely recommend this as a great dive bar/ blues venue!", 
    "review_date": "2008-07-25"
  }, 
  "9kvzAuCNFpuu-Smx2Uf4FQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Monique M.", 
    "review_text": "I am 24 years old and still had a blast at this bar!! I was in SF for the weekend to celebrate a friend's Birthday. We had a party of 12-15 so it was a bit difficult to get everyone into a bar/club that wasn't going to charge us $15-20 per person to get in. Definitely not a typical bar I would go to. But, did I sure have a blast.   I go up to the bar &amp; order a VO &amp; 7 and a Vodka soda. The bartender told me the total which was $7.50. I asked him again...yup $7.50!! I couldn't believe it. I told all of our friends and we all decided to stay there &amp; drink up! The drinks were unbelievably strong....just how I like it!   I had to only give 4 stars because it was very hot in the bar and there were some sweaty elderly people. But for cheap drinks, free cover, and a live band I couldn't really complain. Ended up having a great night!", 
    "review_date": "2012-05-29"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "This place still rocks, but if you've been here before then you know that.  It's nice to have a good old standby Saturday afternoon bar to have some drinks and enjoy live music.", 
    "review_date": "2011-07-05"
  }, 
  "OqgYxqEHc9K7oq-8VHJgxw": {
    "user_rating": 4.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Francis K.", 
    "review_text": "Supposedly the oldest bar in all of San Francisco and honestly I am not going to challenge them on that.  Dark wooden decor, a sticky floor, a door guy who looks like zz top.  Live bad ass blues with no cover charge and $3 bottles of bud.  This place is killer.  The only thing that didn't win me over was the clientele which seemed to consist primarily of 55 year old bearded men who were absolutely shit faced on crown royal.  Still this place rocks !", 
    "review_date": "2007-11-19"
  }, 
  "xpkoIsSm6NVQdyVIhY_PkA": {
    "user_rating": 5.0, 
    "user_location": "Huntington, NY", 
    "user_name": "joel r.", 
    "review_text": "Dive bar is right, crazy mix of patrons, but I loved every minute of it!  The live music?  The blues band was great (and I speak as a musician) and even got up to play harp with the band on Red House.  No attitudes--I was a NYer on business trip who felt immediately at home at this place--just a terrific time.", 
    "review_date": "2010-01-29"
  }, 
  "qSPFhtM-eO842BVQXtAMNg": {
    "user_rating": 5.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Dan H.", 
    "review_text": "Yelp needs various classifications to differentiate star levels.  Case in point; The Saloon.  If you have never been here and saw my 5 stars you would wonder what the hell was I smokin/drinkin.  Well that is none of your business!  I have a history of loving dive bars, just all the character/characters of most of them, and like The Saloon, many have oodles of historical significance.  The legend states that this bar survived the fires caused  by the 1906 earthquake because there was a brothel upstairs and the firefighters didn't want to lose such an important, ahem, business.  It is also the longest continuously running bar in the city.  See its a historical landmark, how much more credibility does one need?  Ok, and now on to my last visit on Sunday 11/15/09, arriving around 6:00 for some live blues.  Again, love dive bars but on this occasion I have the lady friend in tow.  I did give her a little bit of a heads up on what to expect as she is a polite, sophisticated lady in her 50's, but didn't want to scare her off either.  I remember playing up the historical thang to peak her interest.  This particular visit did not get off to a great start.  Frikken Hells Angels milling about outside the door.  LF tugged on my jacket...\"are you sure about this\"?  Oh yeah, they are a friendly bunch, cmon!  Place was packed but we found 2 empty stools near the door.  1 stool spot had a pack of smokes and a beer bottle on the bar.  LF sat and the occupier of said stool came up behind me and grabbed his smokes and bottle, \"sit brother sit\"!  Turned around to give thanks and it was one of the Angels!  See honey, what'd I tell ya.  About peed my pants, don't tell her that though.  Well, the band was great, the crowd drunkin and friendly, met an interesting bloke from New Castle UK that was traveling the world, and the drinks were cheap.  Service great as well, plus it was the btenders bday and cake was passed around to all.  Oh yes, the bathrooms. Phew!  Sitting near the door was a good thing.  The men's room appeared to have been recently cleaned but 100+ years of missed targets cant be washed away.     Great time again at The Saloon.  Hopefully this doesn't start the LF on the road to ruin......", 
    "review_date": "2009-11-21"
  }, 
  "cKydps_ldogI7jNZD9SE6Q": {
    "user_rating": 4.0, 
    "user_location": "South Los Angeles, Los Angeles, CA", 
    "user_name": "Sea B.", 
    "review_text": "I was on my way back to the hotel and heard some great live music. I stepped in and I was the only one under 30, under 40 and under 50 along with two 26 year old girls from NY. The place was truly awesome even without the girls (which as a big bonus I became friends and spent the next two days with).  An old cool lady was running the bar alone and everybody got what they needed. The band was playing great music with nice variation and people were dancing all the time.  If you want a big slapping bass drum, neon lights and red bull vodka, this is not the place for you, but for a good time and to meet interesting characters it's worth a visit!", 
    "review_date": "2013-10-01"
  }, 
  "9BvoWCj8l6xX5r02-Vh_8Q": {
    "user_rating": 4.0, 
    "user_location": "Charlotte, NC", 
    "user_name": "C A C.", 
    "review_text": "A small, cash only, blues pub with great atmosphere, live music, dancing, and lots of local color. Loved it. I will go back every time I am in SF.", 
    "review_date": "2015-01-04"
  }, 
  "iLjMdZi0Tm7DQxX1C1_2dg": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Ruggy J.", 
    "review_text": "In a world of uncertainty, there's one thing you can continually invest your faith in: the fact that you'll never go wrong with a hang at The Saloon. Great people, great live music, and maybe one of the sketchiest bathrooms outside of Buddha Lounge in Chinatown (that's not necessarily a bad thing).", 
    "review_date": "2010-12-27"
  }, 
  "KVT2jasQOCe2cSotn4b-Ug": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren C.", 
    "review_text": "Authentic. Laid back. Older, steady/daily drinkers line the bar counter. It is filled with characters to observe and talk to. This place is for people who don't have sticks up their butts, people who just want to have a few and bullshit with people. Live music Monday nights. Go in, have a drink, and I bet you'll make some memories.", 
    "review_date": "2009-07-14"
  }, 
  "UHl56Gr_-wMDS_rFLEj6jA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Gianluca V.", 
    "review_text": "A great hole in the wall for *REAL* Blues Lovers that don't bother real messy places!!!  I loved it!   One of the two men behind the bar is deaf on on ear: you need to waive your hands like a crazy if you want to catch is attention!  Great music and athmosphere.", 
    "review_date": "2009-04-05"
  }, 
  "aNra-PY5GVKqRVUX4yat1A": {
    "user_rating": 3.0, 
    "user_location": "Vancouver, Canada", 
    "user_name": "Nico C.", 
    "review_text": "A small and decent place to hear live music and have cheap drinks. The older, female bartender was a bit scary (although, I'm easily intimidated) so I sent my boyfriend to buy drinks. The blues band that played were good, but not spectacular. The big crowd that showed up seemed to really like them, and it was great that the place was so busy on a Wednesday night. The place smelled bad though, like faulty sewer pipes, and there are too many rules posted all over the place.", 
    "review_date": "2013-09-01"
  }, 
  "wveSuWGNDD9H4g1h_0XGpA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Guida N.", 
    "review_text": "There's no avoiding the fact that this place smells like old, damp sneakers...  But if you can put that fact aside, the oldest bar in San Francisco is so much awesome!  Live music, interesting/diverse/insane patrons (&amp; staff) &amp; the fact that it's an SF institution mean a visit to The Saloon is worth your time!   Personally, it's the kind of place I like to make a quick (1-2 drink) stopover at... but it's always tempting to stick around once my sense of smell subsides...", 
    "review_date": "2015-01-17"
  }, 
  "U7XGOj-5t0HtIhpXvKIPdA": {
    "user_rating": 4.0, 
    "user_location": "Rio de Janeiro, Brazil", 
    "user_name": "Gabriele J.", 
    "review_text": "This place is smelly, old, full of crazy people and... absolutely amazing! I came here really curious after a cab driver told me this was the oldest bar in San Francisco. I knew they had live music and was not sure what to expect when I walked in. The first thing that got my attention was how smelly this place was! Then I noticed it also seemed very old and even a little decadent. Well, it is over 150 years old, after all. You are probably wondering why this is a 4 star review...  Ok, so as soon as I sat down at the bar and started paying attention to the music (really great blues on the Sunday night I was here), I just got it. This place is SO unique and SO San Francisco! Young, old, weird and classy, everyone got together to dig the music and show some moves on the dance floor. In a way I felt like I was in a movie with all of these extremely peculiar characters surrounding me: the red haired lady shaking her ass like a mad woman; the sweet bartender with his long white locks and very slim figure; the barely naked lady dancing as if there was no tomorrow... Everybody was having the time of their lives and it felt pretty magical to watch!  When the band had a break I left to have a cigarette and ran into some people on the little alley outside. Soon enough this guy who I had just seen dancing inside asks for my name, grabs a guitar and starts playing me a song, rhymes and all. I smiled, danced and kept thinking to myself \"this place is the real deal!\". If you are not into all of the very particular things I described above, maybe this is not the best bar for you. But I just loved it and will totally come back next time I am in town!", 
    "review_date": "2014-03-13"
  }, 
  "wAw9FHMiOZd9ROoc5x4DpQ": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Halle T.", 
    "review_text": "this is the ONLY place in north beach with real people and real music.  I love the crowd.  Unlike the uniform patrons at the bars around the corner (i.e. collared shirts tucked into jeans), anything goes here.  Party next to an eclectic group of people with one thing in common: a love for the music, the atmosphere, and life.  Okay that was three things.  The live blues band on Thursday night is fantastic.  Get ready to be out-danced by 60 year women with more stamina than you had at 21.  There's a $5 cover, but the drinks are cheap.  This would be a great place to \"test out\" a new beau.  If he's too stuffy to enjoy himself here, get rid of him stat!", 
    "review_date": "2007-12-09"
  }, 
  "mtpek5XdI8oqrA5KCGFXZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bumble B.", 
    "review_text": "The Saloon is a the dive of all San Francisco dives - a great spot to do some day time drinking with some weird and crusty locals while listening to the Allman Brothers on the jukebox. Only has PBR and Lagunitas IPA on tap as well as Budweiser, Sierra Nevada, Anchor Steam, and a few others in bottles. +1 for an extra large pour on my double jameson whiskey", 
    "review_date": "2014-12-26"
  }, 
  "kExQHEnm_gkxRbby-fauSw": {
    "user_rating": 4.0, 
    "user_location": "Orinda, CA", 
    "user_name": "Melissa B.", 
    "review_text": "This is a great place in North Beach to get cheap drinks--ultra wild west feel to it! It is apparently one of the oldest bars in the city. Cash only, FYI.", 
    "review_date": "2012-07-22"
  }, 
  "CN9uQWBl21FXWR2ZX1Cx0A": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric P.", 
    "review_text": "The Saloon is a love-it/hate-it kind of place. I would give it a 5-Star rating except for two things - the smell of the place and the attitude of one of the bartenders.  The place smells like urine. When I asked the doorman why the place smells like urine, he told me it is because people urinate on the street and public pavement within yards of the entrance door. When I walk through the front door the overpowering stench of urine hits me. It's like a wall of urine smells. After standing inside the place for a few minutes, the nose becomes acclimated to the smell. It would be great if the owner/management would clean up the place so that customers weren't hit in the face with the overpowering smell of a public latrine when they walked through the front door. Other patrons have told me they have the same experience each time they enter The Saloon - the overpowering smell of urine.  One of the bartenders is a real asshole - rude, combative, and surly. This guy should go away from The Saloon. Management should get rid of him. One time I went there to have a drink, listen to music, dance, and meet people. He was working that night. I decided to leave as soon as I saw that he was working the bar that night. I went somewhere else to have a drink, listen to music, dance, and meet people.", 
    "review_date": "2011-01-04"
  }, 
  "iqOaVJRprVKcT50t9k5jnA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L C.", 
    "review_text": "Agreed with everything said here. This place is awesome.", 
    "review_date": "2009-07-10"
  }, 
  "QUV4kHoq-tCJ3CBHmhPjIg": {
    "user_rating": 5.0, 
    "user_location": "Aberdeen, SD", 
    "user_name": "Dave S.", 
    "review_text": "I like to hear live music early in the day,4pm start on Fri and Sat. A classic Saloon with alot of history.The lady bartending last Saturday afternoon rocks!! Thanks for beeing part of a great San Francisco vacation.", 
    "review_date": "2013-05-10"
  }, 
  "GWKbtMoL9UEXN4fdMnO5Xg": {
    "user_rating": 4.0, 
    "user_location": "Vancouver, Canada", 
    "user_name": "Mike S.", 
    "review_text": "I Fu**in love this place!! It's the oldest bar in San Francisco there is really good live jazz/blues music here nightly. Right in the heart of North Beach. Whenever I'm in town I always hit this place up.", 
    "review_date": "2011-06-10"
  }, 
  "tcAtgnSrs4nceMadnRo-bw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Baothuong N.", 
    "review_text": "after going to some club that felt like a high school prom/ hip hop video my bf and i stubbled upon this bar. the music was amazing. it sounded alot like the black keys. the drinks were dirt cheap. $9.50 for two jamesons/coke.. wow. it smells like a good dive bar does. piss and wood. i loved it. i was so much fun. bartenders are very nice.", 
    "review_date": "2011-02-20"
  }, 
  "MZXfiLD_SXbPUxfQAIhJUQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Spencer J.", 
    "review_text": "Musicians love playing the Saloon.  Which means you get to hear bands who are having a great time, taking more risks and sharing more joy.  On any given night you could set up a video camera and let it run and you'd wind up with a Jim Jarmusch film (if his camaraman had dropped blotter acid).  Hippies, hustlers, Hungarians and ass-shaking hominids of  all sizes, dancing like it was their last night on earth.", 
    "review_date": "2010-04-18"
  }, 
  "6M-zSMI_owxlN-GE2JYyww": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Michelle E.", 
    "review_text": "of all places that I've ever been to, I never thought I would find a crisp, fresh, new and amazing salad here. It was awesome!", 
    "review_date": "2013-09-30"
  }, 
  "9u8d_na5feZSZYok-Wb-BQ": {
    "user_rating": 5.0, 
    "user_location": "Woodside, Queens, NY", 
    "user_name": "Daniel D.", 
    "review_text": "Quite a band.  A very old bar.  Whiskey cheaper than most in the northeast can imagine.", 
    "review_date": "2012-07-02"
  }, 
  "ZNJiYLz_6udX3ljXPZ9FJg": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Olma M.", 
    "review_text": "Wow - just thinking about this place puts a smile on my face.  I've spent many nights at this beloved blues bar.    Back in the day, I'd see Johnny Nitro and the Doorslammers here as many nights as they played  - it seems like they were either here or up at Grant &amp; Green every night of the week except Tuesday - And I was there every night! (Or were they at \"Blues\" on Lombard on Mondays!?).    Johnny Nitro at the Saloon, however, was the best experience ever.  No performance was ever the same - they never played the exact same set, but knew just when to bust out with a regular crowd favorite.    For a small, cozy \"hole-in-the-wall\" type of vibe, the restroom was relatively spacious and decent.  The neighboring alley takes you straight through to an awesome street view.  The acoustics were surprisingly really high quality.The Saloon was always packed and always lively.  I've met the most eclectic group of individuals here - locals and tourists.  In the span of one night, I recall meeting three separate tourists who were told that \"The Saloon\" was the best Blues bar to visit in SF - I told them they were right and they heartily agreed. Another tourist had just come from a variety of U.S. East &amp; West Coast city bars, and two other countries, on his vacation, and said The Saloon, in SF, was his absolute favorite of them all.    The Saloon will always have a special place in my heart... sigh...", 
    "review_date": "2006-09-01"
  }, 
  "AuZCYgJwe0j54QngjErbMg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate S.", 
    "review_text": "We used to think this place was fun. Unfortunately past versions of ourselves were sorely mistaken. Drinks are over-priced and are very weak. The men's bathroom is designed for midgets and unusuable for anyone of average or above average height. The \"bouncer\" a very unhappy obviously unsuccessful late 50's Douche who most likely got beat up by 60's hippies back in the day, needs some training on customer service. We arrived at 8 pm, knowing the \"show\" began at 930. Having arrived before the \"cover period\" we assumed the cover charge should not and would not apply to the patrons who had been paying for weak drinks with poor service for several hours. The proprietors of the bar proceeded to shut music off at 930 and demand a cover charge from all current residents of the bar. I happened to be using the facilites during this shakedown and missed the collection jar. After buying a very weak drink from the bar upon my return from the little boys room, the bouncer jumped in my face demanding $5 and cursing at my party for not already giving the cover. He proceeded to recruit the bartender out from behind the bar to inform us they would no longer be serving us watered down adult beverages until we paid the cover. My first interaction with these people involved yelling and cursing despite my obvious intention to give them many of my hard earned dollars for crappy drinks and crappy service. We left without paying the cover charge based upon principal and extremely poor customer service. I am all for supporting local musicians, however the approach the proprietors of this establishment depend on are extremely crass and unnecessary. We will never return and I caution all those under the age of 60 looking for an enjoyable time on any day of the week ending in \"day\" to save your money and go anywhere else.", 
    "review_date": "2010-09-17"
  }, 
  "TknGTatZq_ABSuiNjuR0Gg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess K.", 
    "review_text": "How am I just now knowing about this place? GREAT MUSIC, cheap drinks, fun crowd.... what more could you want?   Just stop in sometime for the music... it's completely worth it. Everyone in the place was dancing. You could just feel the fun. And hell, where else in SF can you get a $4 Manhattan? Is it shiny and fancy inside? Absolutely not. It is dark and dingy and full of soul. Go grab a nice dinner around the corner and then come here to wrap up the night. I will definitely be going back!", 
    "review_date": "2013-08-17"
  }, 
  "yCBeVvKt0M7o57sSRqp4xg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tony L.", 
    "review_text": "I went to this bar twice last week.  Yes, the place can get crowded and it wreaks.  But the grey-haired bartenders whip out those drinks fast.  This is a no-frills, kick-ass bar.  And the previous is correct, it scares away the tourists.  Great band (Jonny Nitro last Friday night) and a down home atmosphere.  ABC for this place (as in Always Bring Cash).  I shall return.", 
    "review_date": "2008-06-16"
  }, 
  "s3DLYu66f-cIU8BAkEzGow": {
    "user_rating": 5.0, 
    "user_location": "Newark, CA", 
    "user_name": "ADOLFO R.", 
    "review_text": "Hands down the best blues bar in town. The place is old, it looks and smells old but it's vibrant at the same time. It's what you'd expect going into a blues bar. The drinks are cheap, the ambience is lively and the people are very laid back and pretty friendly. If you like blues or even if you don't, but you enjoy great live music, you're gonna love this bar!! Come in your dress shoes if you want my man right outside the bar to shine your shoes.", 
    "review_date": "2014-07-27"
  }, 
  "1XNK0BXBd1IDTq5GFkof5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian L.", 
    "review_text": "Just a great dive bar.  A  nice break from the usual around North Beach.  Cheap drinks, good music, and an eclectic mix of people that are all friendly and interesting to watch to say the least.  I don't get everyone complaining about the smell and the decor and the bathroom, it's an old dive bar.  There's no bells and whistles so this place is of course not for everyone.  But I think that's ok for the rest of us that can appreciate such a spot.", 
    "review_date": "2009-09-05"
  }, 
  "DorKHZt5ULB6O5-ItIpicg": {
    "user_rating": 4.0, 
    "user_location": "Santiago, Chile", 
    "user_name": "Becky R.", 
    "review_text": "Don't be a weenie: you're never going to see this place in the cold light of day so just ignore the stickiness under your feet, don't even THINK about visiting the ladies' room, and get over your shyness about shaking your money-maker in a crowd of sweaty, spirited strangers.  This place is about atmosphere, history and great music, not about fancy drinks or cleanliness. The only beer on tap is Pabst Blue Ribbon, but others are available in the bottle. Mixed drinks were adequate, but the music really is the focus. The patrons were a great mix of ages and backgrounds, and everyone was enjoying the slammin' blues of the father/son Chris Cobb Band.", 
    "review_date": "2014-09-02"
  }, 
  "bro5nR5w2N3adU-OrpRCJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris I.", 
    "review_text": "When I first moved to San Francisco I used to haunt Grant Street and its environs.  (When your name ends in vowel, you have to.  It's in the rulebook.)  Somehow I missed this place.  I am sorry I did.  Wandered in here with some North Beach denizens last weekend.  I am glad I did.  This place is a throwback, and I feel like I am violating an unwritten rule by even writing this \"review\", so I'll keep it short and sweet.  If you want to sit down and throw back booze, copious amounts of booze, like liver failure amounts of booze, then go to the Saloon.  This is an establishment dedicated to the fine art of getting drunk.  Order a whiskey, a rye, a bourbon, or a scotch.  If you go to this place and order anything that requires fruit flavoring, then you deserve to get thrown through the lexan.", 
    "review_date": "2007-06-18"
  }, 
  "dZfoX2qIfv2tY6fVBUWOQw": {
    "user_rating": 2.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Stacey T.", 
    "review_text": "It wasn't what everyone described it to be.  It is definately an old bar!   I love dive bars but this one had a lot of scary people inside of it.", 
    "review_date": "2011-03-06"
  }, 
  "JsVB8eE-FOhJjf5hL0nNwQ": {
    "user_rating": 5.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Amanda S.", 
    "review_text": "This place is for a certain kind of nightlifer. That being said, I LOVE it. The live music is always entertaining and the drinks are cheap. There's a chill, easy-going crowd. I should probably mention I'm from Kentucky, so The Saloon is a home away from home. The bartender gets super sassy, but she adds character and provides a great laugh. Cash only!", 
    "review_date": "2012-02-12"
  }, 
  "Tsc4u6B-hpvPPUPT2hTC4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sabrina K.", 
    "review_text": "This place is so much fun.  Live music, cold beer, and dancing!  I had a blast.... and so will you. Scout's honor.", 
    "review_date": "2007-12-28"
  }, 
  "SFezvszyVDN6lLZRRBJBtQ": {
    "user_rating": 4.0, 
    "user_location": "Pleasant Ridge, MI", 
    "user_name": "Nikki L.", 
    "review_text": "Super chill. Good music. Liquor pours above half the glass. Enough said.", 
    "review_date": "2012-07-05"
  }, 
  "bPOwZhbJ0goXsE_-EwJ4zQ": {
    "user_rating": 4.0, 
    "user_location": "Raleigh, NC", 
    "user_name": "Matthew C.", 
    "review_text": "OOOOOOOH man. This is certainly a place to stop in at. I wasn't a fan of paying a cover fee but there was live music and I'm all for that.  It's lively, it's loud, action pack and damn is it old(including a majority of the patrons).  There is nothing fancy here, it looks and feels as old as they say it is but it's fun and unique.  I would recommend stopping in this place for a drink and a dance, after having several others elsewhere. for sure.", 
    "review_date": "2014-07-24"
  }, 
  "JVTcskIsqBgyw7jTQC9GYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek N.", 
    "review_text": "Jazzy bands playing worthwhile music. The drinks are reasonably priced, and the crowd is very relaxed and laid-back. It gets crowded as you would expect. Your usual red-faced-slushed individuals having a great time.", 
    "review_date": "2012-11-03"
  }, 
  "LggT45Di6ORgE_nrSI9Wtg": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Gary G.", 
    "review_text": "On a recent trip up to SF, my friends and I stumbled upon the Saloon while cruising through North Beach. (Stumbling is a frequent and welcomed means of travel in North Beach.)  In any event, I paid the $10 cover and went in with low expectations as can be expected of a bar called The Saloon off an alley from Little Italy.   I was pleasantly surprised, as can be expected of a bar called The Saloon off an alley from Little Italy that's jam packed with a diverse and friendly crowd, and echoing with searing blues licks of a kick ass house band.  I've heard a lot of house blues bands in my 26 years, and this was one of the best. I was so into the music that I forgot the name, but I think it was Danny Castro and the (somethings)? I could just be making that up.  The downsides to this juke joint are that the bar is cash only and has a limited selection of brews, and the space is pretty tight if there's a good crowd. Still, I was so down with the music and already buzzed from earlier in the night that I didn't care.   Seriously, the music was tight, and it was really great to see people of all ages and backgrounds getting down. It reminded me of the guitar duel scene from the Crossroads. Good movie, go rent it.   Back to The Saloon - I had a great time. I was loving the floor, I think I danced with a 70 something year old woman and a Tibetan midget. It was a great night.  Overall, if you're looking for a spot to let loose and dance to rockin' blues or bluesin' rock with a packed house, this may be your place.", 
    "review_date": "2010-05-09"
  }, 
  "lhd3w16Ct4Oo8Kc7711tpQ": {
    "user_rating": 4.0, 
    "user_location": "Bay Area, CA", 
    "user_name": "Rishi S.", 
    "review_text": "Really small but cozy joint.  Place gets really loud, but the food is pretty good.", 
    "review_date": "2013-04-20"
  }, 
  "fxJcpYyCBgi61PtmlZXTjQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristina A.", 
    "review_text": "I visited The Saloon to hear my friend's dad's blues/old school R&amp;B band play here and had a pretty good time. It got kind of crowded and it seems popular among the local homeless, but the music was super good and I scored a bar seat so I could sit, see the stage and order drinks easily.  The bartenders are some very experienced, very on the ball \"mature\" ladies, the liquor and bottled beer selection is decent (they only have Busch on tap), and boy o' boy are the drinks CHEAP. Beers are $4, but the cocktails are only $3.00-5.00. I wouldn't come here regularly, but it's definitely worth a visit when a good group is playing. There's some room for dancing and the bathrooms are pretty clean.", 
    "review_date": "2007-12-16"
  }, 
  "32sxRjdlvBsQRiwuGQUeXQ": {
    "user_rating": 3.0, 
    "user_location": "Paris, France", 
    "user_name": "Angela N.", 
    "review_text": "I came here last night and saw a pretty cool band with a mean female sax player who had a lyrical way of saying things.  I spent most of the evening people-watching with friends.  Weird crowd: lots of middle-aged men and women falling all over each other and getting really horny from the looks of it.  Shirts started unbuttoning and layers started coming off.  Young girls paired up with older men.  Female groups grinding each other for bearded white-haired crowds.  I saw one cool older couple that held each other close with lowered eyes while dancing, the whole time I was there.  The girl had vivid features and the guy wore a faded old cap.  Strange place.  The bartender is friendly and the drinks don't cost too much.  My ears rang a little - it's a small venue and the music's pretty loud.", 
    "review_date": "2006-01-07"
  }, 
  "OaCYI9jXPJJFOHqPmsjaWA": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Yong K.", 
    "review_text": "If you want to hear some great live music this is the spot!  Oldest bar in SF. looks old inside too, but the vibe is great. musicians are really good and people dance too.   first time hearing blues music live and it was fantastic.   However, if you have sensitive ears like me, I recommend some ear plugs to lower the volume. It's a small venue so the music can be loud. But not the completely sound canceling kind because you still want to hear the music.", 
    "review_date": "2014-07-16"
  }, 
  "Kg4VJYP60seaknupX3iP9w": {
    "user_rating": 4.0, 
    "user_location": "Gold Coast, Australia", 
    "user_name": "Andrew W.", 
    "review_text": "I had reason to be here a few Saturday nights ago. It was one of the most authentic places I have ever been in my life. It was the way bars and music are meant to be. Natural and comfortable. You felt at ease. It is a 100% dive. That makes it 100% awesome. That's just the atmosphere.  I saw an artist called Daniel Castro - blues rock - sensational. Continuing the authentic theme, the music too was 100% authentic. The crowd was 50 plus although it become younger as the night went on.  It is in the North Beach area with lots of things to do either side of going to the pub. I don't get into the city that much but I am glad I found this place. Highly recommended.", 
    "review_date": "2011-06-16"
  }, 
  "pudxkSYxLCQw7dhupri24g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shanee B.", 
    "review_text": "Old timey place. Crazy cheap drinks. Fantastically colorful bartender. Great live music.   If you are looking for a fun divey watering hole in the area, that doesn't have strippers, this is your jam.", 
    "review_date": "2015-01-10"
  }, 
  "Hl1f4VO0a9KdGrrRCPMqSA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela K.", 
    "review_text": "I love real bars and this my friends is a real bar. And as I'm sure most everyone knows San Francisco's oldest. If you're in North Beach swing by, if only to break up your night of strip clubs and Golden Boy.", 
    "review_date": "2007-07-07"
  }, 
  "az9JYYsK7EpTc5CyFADzIQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linda H.", 
    "review_text": "It doesn't get any better than The Saloon!  Don't let the \"dive bar\" thing scare you, seriously.   Keep an open mind and you'll have a blast.  Three years ago I walked into Saloon by accident and couldn't see why I'd hang out anywhere else....and I don't.  I love the people!  The \"regulars\" welcomed me; danced liked crazy with me; and are now friends I look forward to seeing!  And I take offense to some of the reviews about the bartenders....they work their butts off!  On any given night you'll see some of best live music San Francisco has to offer.  Tony Perez - awesome sax player - with Second Hand Smoke plays on the 3rd Saturday and it's a MUST SEE!  Ron Hacker &amp; the Hacksaws, Daniel Castro, Curtis Lawson, Dave Workman, Lonnie's Eggs.....the list goes on-and-on.  The music is some of the BEST BLUES you'll find anywhere in the country!  I congradulate owner Myron Mu for keeping the tradition of San Francisco's oldest bar alive and well.", 
    "review_date": "2012-01-07"
  }, 
  "uJdI8qypazDBDV1WBU3LBw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Languid D.", 
    "review_text": "This place is loud. The band will greet you from more than a few stumbles from the front door with electric blues. I live for institutions like this where that skanky bar smell that still has nicotine in the fine print.   The last time I remember actually sitting here, it was daytime, early afternoon, there was the sweetest skeksis bartender lady, I got the impression she was used to tending bar with her smokes but California had legislated that option away from her, she poured like they used to, like it was law, like an equalizer. After a few hours of sitting at her bar, quietly consuming Wild Turkey, I took in all that was around me. There are the clinical, the young, the old, the ones she wakes up, sets up and shoos out all sitting in consensus paying their courtesy at the bar. You might people who seem as if not everything is right when you look in their eyes. They might think the same about you. The insane might be you or they might be seated around you, dancing next to you or smiling to someone not even there. I love this place  This crowd has brothers and sisters drinking on 6th street and dancing in the doorways at 7 am in the 90's. You can find the ghosts of their cousins on Turk St on the corner of Taylor. All those places are falling away as the bureaucracy comes by like the revenue man with a clipboard, a minor and an old square chicken hawk. I'm glad this place has more stones than the ABC with a foundation since the Emancipation Proclamation and straight through Prohibition and the Twenty-first Amendment, punk rock, disco and crack.  I am going to go back, pay homage and promote sustainability so that The Saloon will be here when I'm gone. I won't get a last ovation but The Saloon will be a part of me as I passes into the urinal. They must have a bathroom but I can't remember if I used it in an official sense.  Like a reviewer posted earlier: dress for drinking. If you don't want a dive bar that your great-great-grand-daddy got shanghaied from that still has his dent in the door, from his head as he was thrown through, don't come by.", 
    "review_date": "2011-11-20"
  }, 
  "0eMHwMLptoOktuVUOYCdQw": {
    "user_rating": 4.0, 
    "user_location": "Silver Spring, MD", 
    "user_name": "Rebecca F.", 
    "review_text": "Reasonably priced drinks and great live blues! Definitely a must while in San Francisco !", 
    "review_date": "2014-04-17"
  }, 
  "L6H3kqqmYz2NPkOl5WE6nA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Genevieve J.", 
    "review_text": "Wow! Sunday nights at the bar with a beer and seriously good blues! Doesn't get more authentic than that!", 
    "review_date": "2014-10-19"
  }, 
  "gjF9IHmY4mNAysaSIALmQA": {
    "user_rating": 3.0, 
    "user_location": "Napa, CA", 
    "user_name": "Julianna B.", 
    "review_text": "Classic dive bar. Good service but don't expect anything super fancy. Generous cocktails and good people watching. Go by for a drink when you are in North Beach.", 
    "review_date": "2012-05-31"
  }, 
  "nKAYiPsaCpNxAZ4Ot0IdzA": {
    "user_rating": 5.0, 
    "user_location": "Plano, TX", 
    "user_name": "Angela H.", 
    "review_text": "I love this place.  Great atmosphere, jazz bands, and cheap booze.  The only cons were that it only had one ladies bathroom and it was cash only.  However, I had a great time.....well worth the trip to the ATM.", 
    "review_date": "2015-01-06"
  }, 
  "6zLDYs2CTlrwCQpG2tZ4QA": {
    "user_rating": 4.0, 
    "user_location": "Troy, MI", 
    "user_name": "Jason K.", 
    "review_text": "Holy shit, what a find.  Jacqui, thank you.  What a joint - we walk into a live band playing James Brown, the bartender is f**cking hammered, they have Busch on draft (yet the bottled beer is still $3.50?), the person taking i.d.s looked like she was on a meth bender - all of these things I look for in a dive bar (one more Canadian Club shot for the bartender - oh wait, look he's doing one right now).  Back to the band - solid. Funky. And the drummer was singing most of the joints, pulling a little Phil Collins-Don Henley shit.  Nice work, I expect to be back at some point.", 
    "review_date": "2009-07-15"
  }, 
  "r1AVLdGIUI4pMjnTZgi1aQ": {
    "user_rating": 3.0, 
    "user_location": "Boca Raton, FL", 
    "user_name": "Alex V.", 
    "review_text": "WOW... That's all I can say. I have never seen a straight up put up or shut up kinda place like this. This place is old school blues bar. Tobbacco Road has nothing on this place. The crazy thing is that the musicians are freggin good.   So, do not take your first date there. actually wait until you are married for 20 years to take her there. Because 95% of the people there are over 55, drunk and smelly. But I promise you will have a good time.  Oh, BTW the bartenders are deaf but the will pour you a Man's drink for 3-4 dollars.", 
    "review_date": "2009-07-03"
  }, 
  "LgT0KCtFvqWU-f0chxtWkg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vickie D.", 
    "review_text": "\"It is what it is\"  Go in with that attitude and you will love it. I have been coming to the saloon for about 5 years now and am never disappointed. I would say with my scientific calculations, that the mean age of the crowd there is 56.7 (I am 27.1)  The bands are always awesome as well as the dancing. The drinks are stiff and cheap. Make nice with the bartenders and you will be served quickly all night.  ps. They have powdered soap in the bathrooms!!!!!", 
    "review_date": "2009-12-10"
  }, 
  "ZnoRV0CJYbKqHlWWm_6MIA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Catherine O.", 
    "review_text": "Ok I can only really give this an average rating because I walked in, and decided it was not happenin' and proceeded out the door.   Lovely smell of musty socks and onions with a sea of old people with live loud music filled this bar.   I think I got tossed back into time....", 
    "review_date": "2008-03-03"
  }, 
  "AUV205p4o2uk9o80LrKHhA": {
    "user_rating": 2.0, 
    "user_location": "Winters, CA", 
    "user_name": "Haylee C.", 
    "review_text": "The oldest bar in san fran where people used to be shanghaied (not sure how to spell that, partially because i didn't know it was a real thing). Anywho, Had a pretty rocking blues band! we came in with a full group of people, left fairly quickly since the three older women who looked like regulars bumped us alllllll  (like literally 20 people) the way out of the only open area to stand. i don't like all their bossy signs though (such as one drink minimum per person, etc etc) i can tell you now that i didn't drink and i shouldnt be forced to when i have another 19 people with me all drinking. Sorry i refuse to drink and drive, sue me.  Bathrooms: avoid at all costs.", 
    "review_date": "2014-01-06"
  }, 
  "_rPTxBF0GPuLeMjtstDZNw": {
    "user_rating": 5.0, 
    "user_location": "Gilbert, AZ", 
    "user_name": "David J.", 
    "review_text": "This one falls into the category of, \"Know what kind of place you're going to before you get there\", oh, and also, \"How well does the place fulfill it's purpose.\"  5 Stars for The Saloon?  Really?  That dive?  Absolutely!  Picture the scene- in S.F for just a couple of nights, one of which happens to be a Sunday when the Wharf rolls up the sidewalks at 8pm, and you want to do something fun.  Definitely head to The Saloon, RIGHT across the street from S.F. icon The Stinking Rose.  Rustic, actually looks and smells like an old west broken down saloon, but filled with happy albeit mangy characters of all socioeconomic persuasions all grooving to the lively bluesy-rock-funky band stuffed in the corner.  Who cares if the lone tooth-challenged bartender takes forever to serve your drink?  And what you gotta respect so much about the place is here we are in high falutin' S.F., all they have is one beer on tap, and guess what that is - yep, PBR baby, Pabst Blue Ribbon!  And when the husky voiced singer-saxophone player jumps on the bar for a nice sax rif, the deal is sealed.  5 Stars?  You betcha!!!", 
    "review_date": "2014-05-19"
  }, 
  "voPSqQt8onshigzHdUce1w": {
    "user_rating": 5.0, 
    "user_location": "Oakdale, CA", 
    "user_name": "Frankie B.", 
    "review_text": "this is a great place to get away. live music everynight. great places to eat all around the area. good times are to be had at The Saloon!!!", 
    "review_date": "2010-10-23"
  }, 
  "mcEm0-yOutL4MeRJEao7ww": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Will O.", 
    "review_text": "The first thing I noticed on my virginal visit to this dilapidated establishment was an old homeless guy standing out front. He appeared to be asking people for handouts on their way in. I was trying to kind of sidle past him when he reached out and grabbed my shoulder, which I thought was a little rude. But then he asked to see my ID and I realized he was the doorman.   So I go in there with my friend, a blonde from the south, who I can tell is a bit reluctant. She's just started poring over the extensive wine list (the choices are \"red\" and \"white\") when this grizzled old geezer of a bartender ambles up to her and growls: \"You wanna sit on my face?\"   We found out later that \"sit on my face\" is the name of a specialty shot they were serving that night, but that's sort of beside the point. The point is that the night only got better from there. The only beer on tap was Busch, which I was unaware still existed. The clientele tended toward the old, the ugly and the alcoholic, but not exclusively so. The music was lowdown, nasty-ass blues, the wooden dance floor was cramped and grimy, there was a fake christmas tree in one corner and a prostitute in another... It was basically everything you could ask for in a bar. I've returned many times since.  Highly recommended.", 
    "review_date": "2007-08-24"
  }, 
  "qmXKvtJe83rMLXsvkRMlBQ": {
    "user_rating": 5.0, 
    "user_location": "Grand Rapids, MI", 
    "user_name": "Amanda L.", 
    "review_text": "The Saloon is a must for locals and visitors alike. You'll get a taste of the city life and experience just a bit of the history of San Francisco when you visit.  Per other Yelpers, this is the apparently the oldest bar San Francisco. It was saved from a neighborhood fire by neighbors constructing a bucket brigade to put out the flames. Today, it's a packed like sardines, cash-only, hole-in-the-wall jazz and blues club. I happened in on the same night as the SantaCon so the place was surreally packed with people in Santa outfits in various states of inebriation. It just added to the anything goes, low key ambiance of the patrons and bar tenders in this dive bar. My vodka sodas were served in small glasses- maybe 6oz in size. These are the kind that I remember from my few visits to a VA Hall with my grandpa. It was probably for the best that they were small in size because they were big in alcohol.  Despite that cool history and fun vibe- I'm not going to lie- this place smells. For my entire visit I couldn't stop thinking I was an antique store; that musty, moth ball smell was even on my clothes when I left. Aroma aside, my visit to The Saloon this past Saturday night was a ton of fun and I would recommend a trip to everyone", 
    "review_date": "2014-12-16"
  }, 
  "PeLGa5vUR8_mcsn-fn42Jg": {
    "user_rating": 3.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Michael C.", 
    "review_text": "Less than impressed this time around - As a general rule I don't pay covers and I wasn't about to pay $5 just to pop in for a quick drink. Lots of \"seedy\" characters hanging around outside.  I suggest they let folks tip the band if they are worth a shit.", 
    "review_date": "2008-12-16"
  }
}