{
  "TDv_jpLhHUNnpWVUMCck5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay F.", 
    "review_text": "The food was so damn good. All the tasty sauces, we needed spoons to get every last drop. Our waitress structured out our experience excellently and made accommodations for shell fish allergies in our party. Can't wait to come back.", 
    "review_date": "2015-01-25"
  }, 
  "87Fz072sRPhZCwiwRuViGQ": {
    "user_rating": 5.0, 
    "user_location": "Castro, San Francisco, CA", 
    "user_name": "Seth P.", 
    "review_text": "Loved this place. Albeit a tad pricey, after assessing the quality of the food, the drinks, the ambiance, and the service, this is a 5-star review kind of place. We had made a reservation through open table, and as a party of 2, we were seated upstairs. It was a tad chilly (so bring a longer sleeve layer), but the night was also very young (we had a 5:45pm rez before an 8pm show). We had a rotation of servers, but each one had his or her own delightful personality. All of the servers knew the details of the plates they served, and then dipped out without too much of an interruption in our date night.   Another thing. At first, we weren't sure that 6 plates to share would be enough (we were pretty hungry), so we ordered a 7th plate for the additional $10. We should've stopped at 6! But tasting each of the dishes we selected was such a treat. We had the dried duck with smoked prune romesco, creamy pork broth with the kimchi rice balls (yummy), pickled nori and brussel sprouts (probably my fave of the night!), smoked black cod fried rice, puntarelle &amp; escarolle with the soft egg (also delish), and the grilled beef with the mustard-miso oyster sauce.  The server reordered our selections to fit the tastes and layers for the evening and he did a fabulous job. Our meals went from light to heavy but without any sacrifice in flavor from the dish before it.   And a shout out to the bartender(s)! I am perhaps one of the pickiest mixed drink persons I know - so much so that I often just stick with beer. But the pear margarita was delightful and refreshing. I finished it by the end of the salad courses, and would have switched to wine or beer for the heavier dishes, but I didn't want to spoil any room for the delightful food that was yet to come!", 
    "review_date": "2015-01-14"
  }, 
  "0zLPTyaoZDm5KokVw2RoRw": {
    "user_rating": 5.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Sarah H.", 
    "review_text": "We had an amazing dinner date here... *Hostess and waitresses were so nice and accommodating with my food sensitivities.  *The food was immaculately put together and presented. Great dishes for sharing. We were so full by the end of our 6 plates. But very satisfied and really felt like we got a broad selection of the menu. The pig fries and the sausage soup were highlights for me. Each dish was so unique and had thoughtful flavors.  *The decor and ambience is off the charts. Very cool setting. Perfect size. Great music. Love the tableware. Nice crowd.  I would recommend this restaurant to all foodies of SF!  Sarah", 
    "review_date": "2015-01-25"
  }, 
  "KUXfzl-Sc1wn2nkX-Slyww": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Josh Q.", 
    "review_text": "The Progress is unmistakeably in the same vein as its next door neighbor/sibling, State Bird - dishes could be swapped and it would be difficult to tell them apart.  That said, a lot of the same strengths and weaknesses of State Bird can be found here as well.  I appreciate the culinary experimentation that the chefs do here, but the overwhelming theme here is heavy saltiness.  We ordered about 10 dishes in total, well above the requisite 6, so I think I can say that with some degree of confidence.  I did have a few favorite dishes - the pig fries, lamb, and squab - and also a few I didn't like as much.  The dessert was nothing special, to the point of being avoidable - I'd prefer to have 6 savory dishes if I came again.", 
    "review_date": "2014-12-30"
  }, 
  "aaXANaiPk9xzMEqo3t5l_g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sumit C.", 
    "review_text": "This was one of the most underwhelming (anniversary) dinners I've had in the recent past. The Bird State Provisions (which we loved both times we went there) reputation will take this restaurant only so far.... that was the only reason we went and came away un-impressed.  Checkin: We arrived 25 minutes before our reservation. Hello, please wait at bar... thanks. No coat checkin or offer to even. Err... ok!  Bar area: offers food and a couple of cozy spots for 2 also there, could recommend checking them out. The menu there has prices on each of the items...  We get seated 5-10 minutes after our reservation time (10pm!).  Food: In the main dining room, the *only* option is to order the $65/person family style dinner. Amuse-bouche was nice. We ordered the roti / dumpling appetizer. I've had roti (Indian) and roti-prantha (malaysian / asian), this was bland with a cheesy sauce. Weird..... the dumplings were forgettable too. For mains we got the lamb (was like mini hard sausages), treasure chest (probably the best part of the meal, the broth was yum), and tofu / dungeness crab (casually plated).  Wine: we took our own special bottle, $30 corkage.  Dessert: we tried both. The ice cream (honey cacao?) was yum, but others again not memorable.  Dress: Casual, maybe even wear your shorts. No seriously!  Ambience: loud music, which became mellow middle of meal, then loud again.....  In a nutshell - if yo you want to spend $200+ on a meal for two, with corkage and tip, then be my guest. The food was forgettable, and ambience / service didn't impress either.", 
    "review_date": "2015-01-20"
  }, 
  "uO_Fbh_k28FGt4yqXdysCQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kapo T.", 
    "review_text": "With the sister restaurant \"State Bird Provision\" right next door, I had high expectations for The Progress. With their \"pick your own\" menu, the dinner started off to a good start. It's hard to pick just 6 but if you want more, you can add more for the price. The space is very nicely decorated - an open, high ceiling space with fine wood nicely done.   The staff was very attentive on everything - water, dishes, drink order, etc. A few dishes were very good and some were just OK. I felt the same way about State Bird Provision when they first opened but they've grew and improved so much that I look forward to going back everytime. I hope to feel the same about The Progress as I will be heading back in a few weeks.   San Francisco has definitely grew with many talented chefs and I expect nothing less with good quality food but now, I am looking for creativity when the food is presented at my table. I am looking forward to growing with you The Progress!", 
    "review_date": "2015-01-03"
  }, 
  "JYxt5_1tAoIVHYRZ2PkKcw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben M.", 
    "review_text": "We didn't have a reservation and we got there early, stood in line and we got a table for the first seating. After we got our name on the list for one of only 3 tables available without reservation we hit the bar. The bar is amazing, the drinks are stellar and the bartenders have mad skills. The bar and the great drinks are worth a stop alone!  Things that stand out in my mind are about the preparation and care of the food. Things like a 6 hour boil, 36 month aged beef instead of the average 24. The Crab from Just across the bay. It's local, it's fresh and it is truly the difference.    The spirit and creativity of the meal is absolutely amazing.  You order as a table 6 items from the menu.  What we had: Geoduck clam &amp; carrot cocktail   Matsutake dumplings with sake lees &amp; kale.  Wild Mushrooms with pickled local nori &amp; brussels sprout leaves  Spicy dungeness crab ricotta cavatelli  Grilled BN ranch beef with mustard-miso oyster sauce  Citrus-grenadine sorbet &amp; star anise lime caramel gingered coconut floating island &amp; candied buddha's hand.  The geoduck clam tasted like the ocean,  fresh and clean. The dumplings were really savory, one of the best flavors.  The spicy Dungeness crab ricotta cavatelli is so so so good! How did this happen? It was by far or favorite course. It's also one of the newest menu items. I heard that Stuart created it for the opening night.   I love a meal where every next bite you take blows your mind, where every next bite is better than the last. Only a few places in the world have truly changed the way I look at and think about food, the way I think about  pairings and combinations, about whats possible. This is the place where you try new things, new combinations that blow your mind. New combinations that have the power to reshape your view on the culinary arts.    After we were about half way into the meal both of us had a simultaneous thought: Is this better than State Bird? We both agreed that it was so different that any comparison was inconsequential.   The service is outstanding, the food is outstanding, the bar is outstanding and the atmosphere is perfect. None of this seemed over the top in any way.", 
    "review_date": "2015-01-02"
  }, 
  "zJHWMJm8_zF9SOQfMODOAg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim W.", 
    "review_text": "The Progress is one of the greatest modern, high end dining experience of our time.   The food is sophisticated, clever and unpretentious. It's delicious with sometimes surprisingly effective flavor and texture combinations; a careful balance between rustic and refined.  The restaurant design is unparalleled. Every detail is accounted for without seeming over the top. It's gorgeous from the smooth curved underside edges of the polished wood tables to the nook below the stairs next to the bar and the underside is the banquette benches. Someone took their time to do this right.   But, my favorite part of the experience has to be the staff. It was amazing how well put together and happy everyone was after being open for just two weeks! It's also refreshingly impressive that they have stripped away the pretentiousness often associated with high end dining by allowing the staff to choose their own attire.   There are signals here at The Progress which we will see others emulating for years to come. Hats off to this dining crew!", 
    "review_date": "2015-01-05"
  }, 
  "BG0jH_nUwn8-iR_s50VxSQ": {
    "user_rating": 3.0, 
    "user_location": "Newark, CA", 
    "user_name": "Anuj C.", 
    "review_text": "I had reservations to state bird and i noticed that The Progress next door had opened up, so i popped on in and asked if they have reservations for the next day. Luckily the had a opening and i got a reservation there. I was extremely excited as regular patrons of State bird, this place has to be good. So it had high expectations.   The menu has a 6 course for $65 per person, in which you can had any array of the 6 dishes. we placed our order for the Roti, wild mushroom for apps and Spiced lamb, treasure chest, cod fried rice for entrees and coconut island for desert.   Before we started we were greeted with a amazingly displayed complementary appetizer, which has a perfect broccoli tempura, trout mouse and pickled carrots, Progress was of to a great start and had me looking forward to the rest of the menu.   In came the two apps the sun choke roti and the wild mushroom, the roti had a very Malaysian flare to it and as a premier bread dish, this was splendid. We had a chance to talk to Chef Stuart about it and he mentioned that he wanted bread dishes similar to their ever so popular garlic burrata and this does it justice. the roti in itself is amazing, but the dip which is ranch made our of sunflower root, ummm mind blown.... the Mushroom dish served with nori and sesame seeds was delicious as well. and had us looking forward to the entrees.   We had a great build up so far, in comes the spiced lamb. there were not kidding when they said spiced, this was heavily seasoned, maybe a little too heavy. I love lamb and i usually love every lamb dish, but this just didn't have it for me, it was a bit salty and the many coats of spices on it didn't do any favors. this was sub par.   the treasure chest had to be my favorite dish of the night next to the roti. the sausage in it was scrumptious, absolutely delicious and the broth in spite of being salty was delicious none the less, highly recommend.   the Cod fried rice, I am not sure what happened here, but it was salty beyond belief, completely ruined the experience. I felt like the chef had a generous salty hand with the other dishes, but this went over the top. had a few bites and couldn't stomach it anymore. had me reaching for the water to try to take the salt taste off.   on the whole the entrees in my opinion need a lot more work in the kitchen.   for desert we order the coconut island but the waitress got us the other desert cocoa ice cream with fruit and comped it as the other dish was too salty. the coconut island was tart but manageable. as dessert go this was sub par as well. the cocoa ice cream came with huckleberry cream and was decent. but nothing i would think about or be memorable.   On the whole The Progress has a good start and then came to an abrupt halt and i was sorely disappointed. Will i try this place again? sure maybe after they work out their kinks. but if i am in the area i am definitely gonna go to state bird instead.", 
    "review_date": "2015-01-05"
  }, 
  "IgQuXf1OMLOqEdN6_fqo3A": {
    "user_rating": 2.0, 
    "user_location": "Chicago, IL", 
    "user_name": "T H.", 
    "review_text": "The food was okay and so were the drinks. This is definitely a step backwards from state bird. We had 6 plus courses and I was thoroughly unimpressed, not a single memorable dish. The food is more dependent on sounding and looking interesting than tasting good. My main course was completely tasteless. I am not sure where all the five star reviews come from but it must come from hype and/or friends. State bird is deserving but this wasn't. Also the recommended wines were just okay.", 
    "review_date": "2015-01-01"
  }, 
  "EOkKPedp0mcrzHuTI2pMEw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "NJ A.", 
    "review_text": "As long time State Bird fans we scored a reservation here on 12/15 during the soft opening dinners. We were so excited to see what Stuart and Nicole had imagined when the first bought the space. It is a beautiful space with a refined rustic and contemporary vibe and a beautiful restroom!   We were a little confused by the tasting menu format vs the a la carte option so we went with a la carte since it seemed we got to try more things and get more food for the price. Cocktails were original and very unique. The flavors definitely lived up to the hype.   We wanted to try everything on the menu but settled on the dried duck which was interesting but with unique flavors. We loved the pig fries but didn't care much for the  shaved cauliflower. We loved the beet and ricotta salad - it was perfectly balanced and had so many flavors going on in one bite. The sunchoke, rosemary &amp; smoked cured egg 'roti' was simply exquisite - hot and flaky and accompanied by great sauce. The  spiced garlic squab had just the right amount of spice and we used to roti to make our cups instead of the lettuce. The  smoked black cod fried rice with squid &amp; chrysanthemum had a strong Asian and seafood flavor.  For dessert we were craving something with a cake consistency but couldn't find anything so we settled on the persimmon sorbet &amp; star anise lime caramel   gingered-coconut floating island &amp; candied buddha's hand. We had never tasted this medley of flavors. Very interesting and unique. Definitely will keep coming back!", 
    "review_date": "2015-01-05"
  }, 
  "jhEc1YShRsXStqMk7KV9wg": {
    "user_rating": 3.0, 
    "user_location": "Newark, CA", 
    "user_name": "Bevi K.", 
    "review_text": "Last night I ate at State Bird, it is my absolute favorite restaurant, EVER. While waiting on our reservation, we noticed that Progress had opened. My husband popped in and came out with a grin. He said he snagged us a reservation for the very next day. Now seeing as I can eat State Bird every day and not be bored, I was SUPER excited to try out the new digs.   To start off, Progress is a much bigger space. It has a small bar with nook tables and a bigger restaurant area. It also seems like there is two upstair rooms for bigger parties. We got seated at a communal table in the middle, sharing it with another couple.   First things first, Progress has quite the array of drinks, including cocktails. A welcome improvement from the wine and beer selection next door. While I didn't try a drink, it did look good, and the prices were on par with the regular SF price ($9-$14) for a cocktail.  The menu is array of dishes that you can pair together, making a 6 course menu for $65 a person. You can add extra dishes for $10 each. Upon ordering we were delighted with a complimentary appetizer. It was a scrumptious large plate with broccoli tempura, trout mouse (reminiscent of the one at state bird) and some picked carrots. It was great, just enough for a small bite but it had me eager and waiting for the menu ahead.  The first two dishes we had were the sun choke 'roti' and wild mushroom and pickled nori. These two dishes I enjoyed very much. The roti reminded me of a Indonesian type flaky roti, not a tortilla indian type. I actually had a chance to speak to the chef about it, and he said he was determined to have a outstanding bread dish, similar to the garlic bread at SB. He did well with this edition. It's served standing in a dip of ranch, which is unlike any other ranch you've ever had. According to our waitress it's made with sunflower root, who would have thought! The wild mushroom dish was good, interesting with a japanese flair. You can definitely taste the noori and the sesame seeds.. I liked it.    This is where I start docking stars. In my 7 or so times visiting State Bird, it's a consistent 5 in my book. Is it fair to be holding Progress to the same standards? I think so. It's the same head chef and it's actually attached to it!  We were then presented with the spiced lamb/fava beans dish and the 'treasure chest'. The lamb had a powerful rub but the meat was tender. I felt like the rub overpowered the brilliance of the meat, and it would have been better with just one coat, instead of the 5. The 'treasure chest' was a mixture of different foods, sausage, tofu, fish and onions, and a warm pork broth poured on top. I thought the tofu was slightly out of place, the sausage was great and the fish was meh. The broth was good, however it was slightly salty for my taste.  The next and last savory dish was the cod fried rice. This is where i lost it. It was a piece of cod with rice, some tartar sauce  and various toppings and fried calamari on top. It sounds great, but it was just off..and SALTY as the sea. I tried at least 4 bites until I couldn't take it anymore. It was too much salt to handle. I looked over and noticed my husband couldn't stomach it anymore. We had a good 3/4's of the dish still in the plate and couldn't get through it. We were pretty full at that point so just decided to call it quits. Slightly upset that this salt had over powered the previous dishes we did enjoy. We did tell the waitress and she took it away and apologized.  For dessert we had ordered the sorbet with 'coconut island'. The waitress brought out our dessert along with the other dessert - cocoa ice cream and fruit, on the house. I'm guessing this was to make up for the salty dish. It was nice of them to do. I'm not much of a sorbet person, so maybe it's just me, but I found the ice cream to be way too tart. The 'coconut island' was the best part, but even then it was just okay. It was like a merengue top on a bed of sweet milk. The other dessert was a deep flavored cocoa ice-cream on tart huckleberry sauce with a side of jellied fruit. The ice-cream was good, however again the huckleberry sauce threw me off because of the tart-ness. I'm a huge dessert person, and at the end of both these desserts I was left unsatisfied.  My final review? Progress has a way to go. It may be the same chef, but moving one door down did a number on the food. The service is great, the atmosphere feels amazing, and it has the same charm as next door, it just needs that phenomenal menu. Maybe it's still in it's early stages and they are working out the kinks. I hope so. Will I be back? Yes, I'd like to try this place again in about 6 months. But until then, I'll still line up next door.", 
    "review_date": "2014-12-28"
  }, 
  "A2NV_QGxd7CP1rGY0YaMfg": {
    "user_rating": 4.0, 
    "user_location": "Baltimore, MD", 
    "user_name": "christine j.", 
    "review_text": "6 course meal. Started with the duck, pig fries and squash; main course of squab, crab and lamb. Nice space, great food, and atmosphere. Would def return!", 
    "review_date": "2015-01-15"
  }, 
  "rZVMsAGkYjahpa9clQD4xQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristi G.", 
    "review_text": "Like the second godfather movie,  some sequels can blow your mind as much as the first. The food here has subtle flavor that bursts  I don't really think you can fairly compare to State Bird next door Go in without expectation and let your palate explore   Make sure your party has similar tastes You can even order 2 courses of dessert without haste  It's choose your own adventure, any 6 courses you please They even gave us a complimentary starter for a tease  The cocktails are tailored and the wine list is extensive  At 65 dollars, for what you get, it's not too expensive  The cocktail, El Diablo is more like heaven than hell We started with the savory Matsutake mushroom dumplings with sake &amp; kale  The Geoduck clam &amp; carrot cocktail was fresh and tasted like the sea The Wild Mushrooms with pickled local nori &amp; brussels  sprout leaves was flavorful as can be   Spicy dungeness crab ricotta cavatelli was my fave Grilled ranch beef with mustard-miso oyster sauce, also worth a rave   Got to try both desserts which were not overly sweet Did I mention the bathrooms have glitter on the walls and under your feet?  The space is in an old theater which is light and airy  The kitchen is open, the decor is simple The chef is happy and the staff is merry  If you show up at 5 when the bar opens, you can check in with the host If no table is available, snag one of the tables in the bar It's the same menu, just served a la carte, not bad and you can still boast", 
    "review_date": "2015-01-10"
  }, 
  "SgHE7BrWEa-mSPQNTezhhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shizzle S.", 
    "review_text": "So hard to get a good reservation time! Had a 10:45pm reservation, was seated maybe 10 minutes after arrival. Our waiter knew the menu well and gave us great recommendations. 6 menu items at $65 /person. Overall the food was delicious and The bill at the end was an eye opener, but expected. :p", 
    "review_date": "2015-01-26"
  }, 
  "ruoUnyWT8hrBRG6mXs4_yg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brad C.", 
    "review_text": "First, I'll state that the food is very good.   If this were my only consideration, I'd be a fan.   My issues with The Progress were: 1) I left feeling like I'd been robbed; and, 2) I left feeling like I'd been robbed.  That's not actually a pleasant feeling, so I want to stress it.  I paid for fine dining and the experience wasn't close.  Here's how it went down: the food was good, the service was good, the food was overpriced, the service and atmosphere (while both great) were casual. The food is plentiful, and you're set to pay for it at $65 a person.  The wine is also expensive -- we had two half bottles at about $30 a half bottle. The issue is that this adds up, with tax and tip, to a very pricey yet casual dinner -- for two this amounted to over $250.  There are other restaurants with more standard (yet excellent) fare that I can enjoy twice for the same price.    There are six courses with the dinner, and because it's plentiful, my date and I were hesitant to eat too much of any one dish in fear of missing out on others.    We did learn that it's possible to order a la carte at the bar rather than family-style, as you're forced to do with a table.  While the bar is standing room only, I'll definitely be back to try this. Unfortunately, I'm not inclined to return for a full meal.  I've simply had better experiences for the price, and the hype didn't overshadow that.  Too bad -- the food is good.  If you go, order the Roti and ask for Gerald. Both were great. It's worth mentioning that we went on the third day that The Progress was open, though the issues seemed to stem more from concept than execution.", 
    "review_date": "2014-12-29"
  }, 
  "ibvH1Y7Rh_tstiWgH0OFTA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veronica S.", 
    "review_text": "I was so ecstatic to dine at the Progress. The service here is outstanding, every server, bartender, and waiter that helped us (probably about 6 different individuals) was spectacular, passionate, and friendly.  The food itself is unique and delicious. $65 per person, 6 Dishes Chosen from the menu. We actually ended up getting 6 Savory Dishes and skipped dessert since we had different cocktails and a bottle of wine. The food here is served family style.   Really loved the amuse bouche (their home made jerky was so tasty), Shaved Cauliflower-Herbs &amp; Pig Fries, and the Treasure Chest - sooo delicious.  I thought the Roti and Steak were just okay though - maybe because I really like traditional roti with a little crisp and I like medium-rare steak.  In conclusion, I think I had extremely high expectations because State Bird has easily become of my favorite restaurants in San Francisco, but in the end, I still prefer State Bird personally. I think the whole dim sum concept is absolutely unheard of in the new American arena, and just really admire it.   Overall though, The Progress is such a wonderful addition and would gladly look forward to dining there again very soon! There were just so many dishes I wanted to try! The space is contemporary meets rustic, the food is delish, and the service is outstanding - a great date night or double date night spot for sure!", 
    "review_date": "2015-01-19"
  }, 
  "5gbkhlWANGVzQYi_0m3vOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "Everything at the Progress was delicious and unique. Sister restaurant and neighbor to State Bird, this restaurant is much easier to make reservations for, and the bar opens at 5pm. If you were not a fan of State Bird Provisions you probably wouldn't like The Progress either. But I loved the modern, fusion take on these shareable dishes and would definitely come back. Dinner is served in 6 courses, $65/person (plus a complimentary amuse bouche). Each additional course is $10/person, and cannot be served in individual persons. I.e. If you come in a group of 2 or 4, everyone orders the same and gets an additional dish too.   * AMUSE BOUCHE - 4 STARS: Some of these items can also be found in some version at State Bird. Everything was tasty, but the sausage was my favorite. Like an elegant lap cheung (Chinese Sausage), so delicious.  * ROTI - 3.5 STARS: sunchoke, rosemary &amp; pecorino 'roti' Delicious, fresh, and chewy roti. I was expecting more cheese or flavor in the sauce, it was nice but a little too subtle to complement the very thick and doughy roti.    * BRUSSELS SPROUTS - 2.5 STARS: wild mushrooms with pickled local nori &amp; brussels sprout leaves. I love both ingredients, but the mushrooms were way too salty.   * COD FRIED RICE - 4 STARS: smoked black cod fried rice with squid &amp; preserved lemon Nice and crunchy, and just a generally perfect combination. Would have preferred more toppings but overall very good.  * PUMPKIN RICE DUMPLING - 4 STARS: 'treasure chest' of fermented sausage, fish quenelles, tofu &amp; pumpkin-rice dumpling in a 'creamy' pork broth  Just a really satisfying and delicious dish.  * ESCAROLE SALAD - 4 STARS: puntarelle &amp; escarole with fermented kohlrabi &amp; soft egg vinaigrette  Loved the soft egg on top of the greens, topped with a nice crunchy texture complement.", 
    "review_date": "2015-01-15"
  }, 
  "QQEukZ48syaYjgswJ5gOZw": {
    "user_rating": 5.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Scott C.", 
    "review_text": "The entire restaurant runs seamlessly, as if it has already been there for a long time.  You would never guess that it is new because everyone is so knowledgeable and professional.  Emily was our server and she is fantastic.  She is warm, attentive and enthusiastic.    The food comes out in waves, just as they.  The plates are meant to be shared, like large tapas.  Each dish is creative with many different flavors and textures.  The food is a blend of influences from all over the world.  Some of the ingredients are intricately prepared like the prune that accompanies one of the desserts.  It is poached in jasmine tea and then tempura fried.  I could have eaten a bowl of just that.  We were greeted by the chef at the end of the meal.  He was friendly and interested in our experience.  We noticed that he also served food to various tables so that he could participate in different roles during the evening.  By the way, they serve cocktails!  The cocktails are as creative as the food.  The wine program is more extensive than the one from State Bird, but I think they may eventually combine them.  Overall, we had a great time and I would definitely go back!", 
    "review_date": "2014-12-27"
  }, 
  "G5LXEaxhQMF_BVjNHkVr7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nish N.", 
    "review_text": "Family style, booze. Symphony of provisions. So much in progress!", 
    "review_date": "2015-01-12"
  }, 
  "hL0QCFdQonDn9cjZ6czapw": {
    "user_rating": 5.0, 
    "user_location": "Saratoga, CA", 
    "user_name": "Jessica C.", 
    "review_text": "Really cute and unique ambiance. I really enjoyed the entire experience, very unique. The waiters were also very hospitable and friendly. You get to check 6 items and it comes out in family style for however many people you have. Each person is $65, not including service fee and tax and tip. I did like trying the asian fusion and my favorite was probably the pig fries and the skua? Very tasteful and unique! Would definitely recommend to friends and family!", 
    "review_date": "2015-01-19"
  }, 
  "XmEywucVDyUP9VJ4SXGjzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David D.", 
    "review_text": "Over the past year the restaurant reviewer and one of the commentators of the New York Times have complained that it can be a royal pain to get a meal at many restaurants.  The chef may offer only a fixed menu with no changes permitted; or may not offer a menu at all; alternatively you may be given a poem that offers little clue to what is to come.  And a meal can take hours.  The Progress has put the fun back into fine dining.  The restaurant is beautiful.  The servers are friendly.  You get a menu and can choose six of whatever the hell you want.  It's kind of a marriage of Gary Danko with the old Yun Luck Rice Shoppe in New York City.    The restaurant has great music, mood, and energy.  And the food is very good at worst and inspired at best.  One more thing, Stuart Brioza and his wife know what it means to be a host/chef/owner.  They were all over the place cooking, greeting, serving, and bussing.  They exude hospitality.    A beautiful amuse was presented to each table that said welcome in a most tasty way.  I then started my meal with smoked black cod fried rice with fried squid.  The squid was great.  The rice only OK as I was unable to taste the cod.  This was the weakest plate of my meal.  Grilled shrimp with daikon, yuzu and olive oil was light and a nice introduction to what was to follow (in my estimation the food got better as the meal progressed).  Wild mushrooms came with pickled nori and brussels sprouts leaves.  The mushrooms had that earthy taste that I so love; the brussels sprouts leaves were a nice accent.  I did feel that there was a bit too much acid on the plate but others would likely disagree.  Treasure chest of fermented sausage, fish quenelles, tofu, and a pumpkin rice dumpling in a pork broth was a highpoint of the meal and a great palate cleanser.  I suspect that this, in various guises, will become a signature of the restaurant.  Two meat courses came next and each was wonderful.  First, Don Watson's lamb scallopini with fava beans and cippolini tasted the way lamb should (the Don Watson name gives you a hint of that before this plate arrives).    Next, BN ranch beef with mustard-miso oyster sauce had that mineral taste that you rarely experience these days in meat.    Overall a great but expensive meal.  With a cocktail, tax, and tip I dropped $100 on my meal.  But it was worth it.  One does wonder whether the pricing will limit the popularity of The Progress.   I left wondering whether they might offer a less expensive three or four course alternative to the full 6 course meal.  In any event, The Progress points the way towards dining the way many of us wish it to be.", 
    "review_date": "2015-01-05"
  }, 
  "KjCzP2J5ZgbLcHrBJvN1xg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Justin M.", 
    "review_text": "Incredible. Some of the best food I've had in SF. Everything was perfect. This will have the rep of state bird in 6 months. Get in while you can!", 
    "review_date": "2015-01-03"
  }, 
  "dUL9TUH6B_jUkPgC6562hQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Trinity G.", 
    "review_text": "The food is Asian and Italian inspired without compromising its New American core. Perhaps that's what New American really is. The Progress is deemed one of the top SF restaurants in 2015. What with practically sharing a space with State Bird Provision, it's an easy title to gain along with State Bird's residual clientele. Sort of their \"back pocket\" if you will. Prices are reasonable at $65 for five courses (easily sharable).  Service was great, as expected, although the pacing was a little slow mid-meal.  If you're going to do a white wine, try the Chamblis. It is absolutely gorgeous. If you're a gin drinker, try the Negroni. It is smooth.  Dessert of coconut mousse (menu has changed) definitely stole the show, and I am not big on desserts.  Great and memorable meal. Would recommend it to those on a $100 or less dinner budget.", 
    "review_date": "2015-01-22"
  }, 
  "M271Ac7UKVaQ9U5AOvc_9A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vicky L.", 
    "review_text": "I passed by The Progress on their second day open as my friends and I were en route to State Bird for dinner.  My friend told me that it was the newest restaurant by the SBP team, and since I'd been in and out of town over the past few months, I had no idea it even existed.  So I made note to try, and after the holidays, I looked online and managed to score an early dinner reservation a few days later.  My husband was delighted that I was asking him on a \"date,\" and off we went.  Beautiful decor, similar in style to SBP.  I want my future bathroom to look the way theirs did: glittery copper walls and a teal door.  Seriously, I had to tell my husband to go into the restroom to see what he'd be living with in the future.  You choose 6 items from the menu to share as a table for $65/person.  7 items is $75/person, and so on.  We ended up with 7 since too many things looked good, and a drink each (btw, the drinks are strong - I had to enlist my husband to help finish mine, since I was recovering from a cold and didn't want to pass out on the table).  The menu items change slightly based on what's in season, so don't expect the same thing every time you go.  Highlights: + Shaved cauliflower herbs &amp; pig fries: these are thinly sliced fried pork ears (YUM), with a tangy spicy accompaniment of cauliflower.  I could eat this all day, every day. + Aromatic spiced squab: dip a piece in the chili paste, then wrap with a radicchio leaf and eat.  Like a lettuce wrap, but way better. + Farro spezzato rustico with pork jowl &amp; octopus: almost like a sophisticated porridge.  I'm usually not a huge fan of octopus, but I almost picked up the bowl and licked it clean.  Just okay: + Smoked black cod fried rice: wasn't a fan of the aioli that came with it; I would've liked it better without, and I kept comparing it to SBP's duck fried rice (which I LOVE). + Treasure chest of fermented sausasge, shrimp quenelles, tofu and pumpkin-rice dumpling in a pork broth: Loved the broth, tofu and the pumpkin-rice dumplings, didn't really like the other stuff because they didn't seem to mesh well with the broth.  Meh, skip: - Porcini &amp; Mt. Tam dumpling with nettle salsa verde: my problem with \"fusion\" food is that they create things for the sake of being creative, instead of for the actual taste.  Prime example is this dish; nothing tasted good together, though separately all items are delicious on their own.  Because I don't eat beef and I'm allergic to oysters, I didn't have any of the grilled BN beef, but my husband said it was okay.  Overall a good dining experience with wonderful staff and ambiance.  Our entire meal, including one drink each, tax and tip, was close to $250.  We did have leftovers, and I don't recommend getting more than 6 dishes for the table, as it's a deceptively large amount of food because it's just a few bites per plate.  Not entirely sure I would pick The Progress over SBP, as I like some of the flavors of the other restaurant better, but it's definitely a must-try at least once.", 
    "review_date": "2015-01-07"
  }, 
  "notPJ9iEf1aw_wuu_4fsdg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roy C.", 
    "review_text": "*4.5 stars*  I didn't think that the State Bird Provisions creators could outdo themselves, but The Progress proves that ingenuity and creativity flows out of chefs Stuart and Nicole like no other SF restauranteurs. It's grand, it's fresh, and it's delicious. The unique spin on \"family-style prix fixe\" dining makes The Progress a must-try new restaurant -- and soon too, since this place is guaranteed to reach a level of \"impossible-to-snag-a-reservation\" reputation that State Bird Provisions is known for.   Excellent: shaved cauliflower-herbs &amp; pig fries  spiced garlic squab lettuce cups dried duck with smoked prune romesco &amp; almonds    Good: Spicy Dungeness Crab Cavatelli smoked black cod fried rice with squid &amp; chrysanthemum   Unfortunately, I didn't find the desserts appetizing at all. Although the honey cocoa ice cream was decent, the other ones (Jasmine tea poached fruits, Persimmon Sorbet, and Gingered-coconut floating island) were either too tart or too plain to enjoy.  Overall, the food was creative (a ton of Asian-inspired dishes) and delicious, with a few barely missing the mark (most notably the desserts). The King's Crossing cocktail was perfectly concocted. The service was impeccable (thanks Gerald!) and the space is roomy and comfortable. It's a must-visit that I know will only improve as it matures.", 
    "review_date": "2014-12-29"
  }, 
  "tH2mkwx6Dxcbuw6Uf5Tikw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeffrey H.", 
    "review_text": "I had a fantastic time at the Progress. Ordering family style was really fun, and every dish was amazing.  The cocktails were great. The Treasure Chest and the Pig Fries were must-have dishes.  But everything we had was fantastic.  We were wisely advised to pick our dishes from the non-dessert area, and then just pay for one or two add-on desserts.  That was a GREAT strategy, that I recommend for anyone going.  Another tip is that if you have someone in your group who has a dietary restriction (no pork, or whatever), they wont hold that person to the family style course - and get a substitue dish.", 
    "review_date": "2015-01-26"
  }, 
  "9bWLc31bQvgxJfRH0lBzQg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Massarra F.", 
    "review_text": "You get home from a long day at work, do not feel like cooking, so you toss around ideas on where to go to dinner.  Despite having a clear understanding that you are probably not going to get into the most sought after dinner reservations in the city, you say, \"Fuck it.  Let's just go and see if we can snag a table.  If not, there's always NOPA.\"    As fate would have it, you walk into the restaurant and they tell you that there just so happens to be a table for two ready now.  *enter choir of angels sound here.  I won't bore you with the concept, as several reviews already mention it.  What I will share with you are my favorite dishes of the night.    Shaved cauliflower-herbs &amp; pig fries:  a 'salad' of sorts, with the fried pig ears as the 'bed of lettuce', garnished with cilantro and a very refreshing vinaigrette.     Treasure chest of fermented sausage, fish quenelles, tofu &amp; pumpkin rice dumpling in a 'creamy' pork broth.  Make sure to take a little spoonful of the fish quenelle and pumpkin dumpling together with the broth:  salt, sweet, savory goodness.  Hm.  A treasure chest.  Aromatic spiced squab with salted chili paste: Squab was cooked to perfection.  The crunch of the endive cup, with just the tiniest bit of chili paste, along with a few pieces of the squab make the perfect bite.  Now if only we could be so lucky with getting a table at State Bird...", 
    "review_date": "2014-12-24"
  }, 
  "T4dIPoZgn4b_2jQvhc9iww": {
    "user_rating": 2.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "CL S.", 
    "review_text": "I wanted to love this place. I had one of the more memorable meals of my life at their sister restaurant, State Bird Provisions. However, I ended the evening with a sour taste in my mouth. Don't get me wrong, the food was fine and the service was decent. Just not when paying $65/pp for a family-style menu that allowed 2-4 bites of each course. I am willing to pay for an excellent meal, but at the Progress, it felt like robbery.    For our a table of five people, we had to agree on 6 menu items that we would share family-style. When each of the courses arrived, we were each able to try a very small portion. So, that's $65 for a few bites each of 6 items. At State Bird, many of the dishes were stand-outs, with bold, memorable flavors. At The Progress, the only dish that I will remember is the Pig Fries.   We also enjoyed some delicious (and very expensive) cocktails and wine. When all was said and done we paid $800.   I'd go back to State Bird Provisions in a heart-beat, but unless they change the menu format at The Progress I will stay away.", 
    "review_date": "2015-01-30"
  }, 
  "3G9Jkn7hKc8fmbdK8_lC8g": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Regina C.", 
    "review_text": "the food is absolutely recognizable as the sister restaurant of Statebird Provisions would be. I could see any of the dishes I had at either restaurant fluidly transfer to the other restaurant's menu without anybody noticing a variance in chef de cuisine. from the food description, presentation and taste, it's all very similar. actually, I couldn't tell and don't know if they've got two chef de cuisine but I would assume so. even the restaurant concept is pretty much the same, encouraging family style eating. the only difference is the way in which you choose your food. at state bird you choose from a dimsum-like cart and at the progress you choose a six course menu from a list of dishes.   notable dishes were the farro spezzato (like a rich hearty ragu served with crisped farro and creamy cut farro), the shaved cauliflower with pig fries (which translates to pig ears), and the roti with pecorino and sun choke purée (a nice cross between Asian and Italian). these dishes were excellent and excited me. the rest of the menu, while good overall, wasn't anything to rave about (much like state bird). the desserts didn't sound as appealing so we stuck with savory for the night.   now onto service...after we sat down we waited for approximately 15 minutes with no approach towards the table (not even water was poured). at this point i wondered whether we were forgotten or not assigned to a specific server considering two tables In the same area that were sat after us were already getting their cocktails. we asked if we were going to have someone greet our table, which finally got the ball rolling. the person whom we asked got us water and took our cocktail order and a few minutes following our actual server approached with a quick apology excusing himself for the few tables he was just slammed with. As a server in my life's earlier years, I understand this and how overwhelming it can be when you get three tables at once on top of your already existing three tables. from then on service was great and I have no complaints.", 
    "review_date": "2014-12-30"
  }, 
  "hWUwX8NrzOdaQZkUyvO_eg": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Adam B.", 
    "review_text": "The Progress... this has been a restaurant high in anticipation for many that have been waiting for it to open, and they didn't disappoint. The decor and ambience is completely the vision of the owners, and Chef/Proprietor's Stuart and Nicole along with their staff delivered on every level. The dish ware is artisan and unique, the food is plated with the creativity and imagination you would expect from Stuart and Nicole, and the flavors are undoubtedly amazing. The thing I was most impressed with, is that though the recipes have been created by the masterminds behind State Bird Provisions, the flavors and presentation are unique to The Progress. Bravo and Congratulations to everyone at The Progress.", 
    "review_date": "2015-01-21"
  }, 
  "S3N46-Ym9_rec9ZU5iWoxw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caitlin C.", 
    "review_text": "[gluten free]   I've never walked through such a random door and been so impressed with a restaurant interior. And I've never been greeted by a friendlier hostess. To add momentum, the server was a pure delight and told me the two things I couldn't have on the menu (because of celiac), and that they would accommodate me for everything else. \"There's soy sauce in some things, but we use Tamari.\" Dear server: thank you for knowing what you're talking about.   Highlights:  - The snacks you start with--possibly my favorite little bites of the entire dinner.  - Pork fries. Now, they're not fries cooked in pork fat. It's pork. In french fry form. Mind blown. Comes with a great salad that marries a ton of great flavors.  - The cocktails (we had a Manhattan and the one with pineapple &amp; gin) we're fantastic as well.   Low lights:  - Wasn't stoked on the duck.  - Get your wallet ready.", 
    "review_date": "2015-01-19"
  }, 
  "SZpT2UQD8P-V5hObvhYeCA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zack S.", 
    "review_text": "Ok, so I dine alone. I know.  But I remember passing on State Bird Provisions a year or so back (ya know pre-Beard award and reservation system hack) after looking at the potential difficulty getting a reservation. Now it's essentially impossible unless you spend an hour or two waiting in line outside. So, when I happened to find a dining for 1 table on short notice I jumped.   Overall, good. Not great, but good. Ups and downs. Lefts and rights. The food ranged from interesting to boring. Details below, but highlights were the treasure chest and rustico were amazing. Must trys and they made up for the misses (see lamb).  Yes, the place just opened and are probably working things out, but the biggest problem here is going to be how they manage the table to kitchen interface. You order for the table and they bring food to share based on the number at your table. Love the idea. Yet, then how was dining for one such a problem for the staff? It's like it blew their minds. Essentially my dishes came out sporadically. So I waited 30 minutes then received three dishes at once. The last was cold by the time I got to it. Then waited another 30 for my next course. You get the idea.   The courses are diverse and since they didn't come in a predictable order any attempt pairing individual wines here would be difficult (sometimes I split half for whites and half for reds. Don't even try here. Pick something that will go with everything off their ridiculous wine list). The staff didn't seem overwhelmingly educated on the menu (which is odd at this price...overheard things like \"oh so you had the farro\" \"No, that was the crab\" \"Oh, i haven't had that dish yet\"....Seriously?)  The rundown: Snacks: Didn't exactly wow me. Seriously tempura broccoli? Nothing wrong here, just not a strong first step. Spanish mackerel tartar with horseradish creme fraiche: it was fresh and nice. again not amazing but the mackerel was very good. The squid ink chips were a nice surprise addition that added a nice bitter/saltiness to round out the dish. B+  Porcini and mt tam dumpling: this actually came last of the first set of dishes and didn't get to it until it had cooled, but it was tasty and had a nice smokey undertow to it. B- Farro Spezzato 'rustico' with octopus and pork jowl: awesome. great depth with bit of cumin (?). Super tasty. Elegent, yet rustic. Really it's a ragu with octopus and piggy. Delish. A 'Treasure Chest' of fermented sausage, trough quenelles and pumpkin rice dumpling in a 'creamy' pork broth: again awesome. not listed here is that there is also kim chi in which pulls out the sour notes in the sausages (also fermented). It contrasts greatly with rich broth. The pumpkin dumpling was also super flavorful. Superb. A Don Watson's lamb scallopini with fava greens and cippolini: This was a flat out fail. The lamb was cut thin and so encrusted with sesame cooked to the point of flavorlessness.  It didn't work with the greens either. F (no joke)  Guava on buttermilk sherbet with black pepper floating meringue: The buttermilk sherbet was nice and the guava went well. Same for the meringue. Yet they didn't really go. It was like two deserts in one. It was two parts of separate deserts. Not perfect, but both parts tasty for a subtle finish, which I actually appreciated a lot. For food porn, I hate getting to the second to last dish and just being done with rich food only to have eat an over the top desert. I'd rather they go this route. B   Currently $65 for 6 courses (10 more per course per person I think...) so I'd give it a B though I'm perhaps be a bit generous. Again. Wine list: amazing.", 
    "review_date": "2015-01-11"
  }, 
  "BKdMoAaI_H2dA9O9kP5C-Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fred X.", 
    "review_text": "I'm floored at how good the food is here.   Coming back soon!  As an interesting side note, I'm standing at the bar and in walks Mr. Gary Danko.   I'm starstruck (chefstruck?) and introduce myself as a longtime customer and a big fan.  He looks at me and is speechless as he doesn't know who the hell I am.   An uncomfortable moment for us both ensues.", 
    "review_date": "2014-12-18"
  }, 
  "czJjUvuzfil0agvji1C6qA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle C.", 
    "review_text": "I wanted to love this place, but came away thinking it was \"fine,\" and it certainly is priced more than just \"fine\" should be.  The space is lovely.  It's very open and warmly decorated.  We enjoyed the fun of selecting six dishes to share family style, although I do find it a bit strange that not every ingredient is listed on each dish, especially for allergy purposes.  I realize the staff is very good about asking, but it was strange not to know what all the garnishes were and whether we should avoid any on that basis.  The \"banchan\" to start were fun, but nothing out of this world.  The dishes were interesting and had very novel combinations: kiwi and ricotta, mackerel tartare, etc.  I have to say that I didn't love any one dish.  They were all pretty good, but I feel like they lacked depth of flavor.  The \"treasure chest\" was fun, but the best part was really the broth more than anything.  For the dungeness crab and tofu dish, there was hardly any crab and the tofu was just bad.  It was way too dense and felt like cooked cubes of cheese.  I'm glad I tried this place and maybe they are working out the kinks, but I didn't love it.  And I certainly don't feel like it's worth waiting forever to get a reservation to get in.", 
    "review_date": "2015-01-19"
  }, 
  "D2epirooWNjvwTI6MFhNGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susy C.", 
    "review_text": "While I found SBP to be highly overrated (and it took me a damn year to get a reservation!) , The Progress made up for it.   The menu is more solid, and food is definitely better in execution. I was lucky enough to have friends who invited me along.   The only thing I didn't like was how we had to wait 45 minutes for our table (with a reservation mind you) and the response from the front of the house was just \"we are waiting on the previous table to leave\" 5 minutes is understandable. 10 minutes is reasonable. 20 is somewhat pushing it, and when it hit 30 minutes behind our reservation I was ready to jump up and go kick that table out myself. 45 minutes is inexcusable. At that point you COULD kindly suggest that they take the conversation to the bar perhaps? Or maybe throw us something to nosh on as we're trapped in a little alcove STARVING?! We did offer to tell the hostess that we would kindly ask them ourselves because shit, it's been forty-fecking-five minutes already! Plus I just came from the gym. Thank goodness I ate a banana on my walk over or I probably would've keeled over from low blood sugar.  You pay a set price for a certain number of dishes. I believe 6 courses for $65 (per person) and an additional $10 for each extra course. You can order the dishes a la cart if you wish. We stuck with the 6.   Geoduck clam and carrot \"cocktail\" - a great way to open your dining experience at Progress. refreshing, light, and I just wanted a huge bowl of this all to myself. The carrot juice was sweet and complimented the geoduck beautifully. shaved cauliflower, herbs \"pig fries\" - HUGE HIT. Probably some of the best pig ears I've ever had. spicy Dungeness crab ricotta cavatelli w/ garlic bread crumbs - excellent. Not too spicy, just the right amount of heat. smoked black code fried rice with squid and chrysanthemum - meehhh just ok. grilled BN beef with mustard miso sauce - least favorite of the night. texture was a bit too tough although it was cooked perfectly. just didn't do it for me. sunchoke, rosemary and smoked cured egg roti w/ buttermilk sauce. - at first I wasn't too keen on ordering this and when my friends wanted it I thought \"i'll only try a piece to say I tried it\" fck this thing was so good! I silently cursed myself in my head for not wanting it earlier.  I noticed the menu has changed a tad. I believe they rotate with the seasons and whatevers fresh.   If you snag a reservation, go for it. Just bring a small snack in your purse...just in case -_-", 
    "review_date": "2015-01-21"
  }, 
  "EbbOIQ5oAamS9D_B_7cC7w": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ryan L.", 
    "review_text": "I happened to get online on 12/26 which was the first day of reservations so I snagged two. My beau and I went for our anniversary.  It must be hard to have such a success like State Bird and then move on to your sophomore concept. I found it difficult not to compare the Progress to SBP. They're right next door and they have a similar vibe. Serving style was completely different, but the cuisine was very similar as new American/Asian farm-to-table fusion.  We arrived about 1/2 hour before our reservation (traffic wasn't bad and we found parking quickly.) There was a line down the block for State Bird...still. But the Progress is unusually empty. We walked in behind a dude. He didn't have reservations but they said they would seat him at 5:30 so walk-ins were pretty available.  We stood at the bar and got two cocktails. There are classics and new cocktails. I got the concession with buttered popcorn rum and cherry cola syrup. it tastes like it sounds but was more delicious than I expected. All the cocktails we tried were excellent.  At 5:30 promptly we were seated along with a few other tables. Our server was excellent. He was funny and nice and wished us a happy anniversary. We were given our \"choose-your-own-adventure\" menu. All of the dishes are family style and will be presented in a logical way as guided by the server. He was excellent at choosing our courses and they were delivered perfectly. It appears that the dessert though is NOT family style, so you can get more than one dessert and share if you wish.  After we ordered, we were given a plate of amuse-bouches: chinese sausage, pickled things, tempura broccoli (amazing). The service was a little rocky at this point. We had to ask for a drink menu and we weren't given enough serving utensils for the amuse-bouche. But everything was excellent food-wise.  Our service was as follows: - Pig fries (pretty good, great flavor, don't want to know what it is made of) - Roti (delicious, one of the best) - Treasure Hunt (so good, sausage, fish, pumpkin mochi in the most amazing broth) - Pork Jowl and Farro (maybe the best flavor combination) - Squab (served like a lettuce wrap, not my favorite) - Black Cod Fried Rice (really good)  We didn't get dessert because they didn't appeal to us.   The service was excellent. Plates and flatware replaced after each course. Napkins folded when you leave the table. It seemed like there were about 10 different people who approached our table for one reason or another. Everyone was so friendly.  How was it overall? It was great. The service, food, atmosphere, cocktails, all were top-notch. It's one of the best places to dine in SF. I will definitely return. However, I was still not satisfied when I left. I expected my mind to be blown and it wasn't. it was really good, but just not at that point where I could collapse. How does it compare to SBP? It doesn't. It's similar yet totally different in many ways. I still prefer the \"dim sum\" style and the fun of SBP. I like that at SBP you can try many different things and get more of a dish. Menus at good places never do the dishes justice so I like to try more dishes to see what's good. For example, if I knew the squab was a lettuce wrap, I wouldn't have ordered it. But I think comparing this to SBP is a bit unfair. Compared to most of the places in SF this is a wonderful place to eat.", 
    "review_date": "2015-01-08"
  }, 
  "Hfjd7WqE0DcvJGG3ZSczpQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Linh N.", 
    "review_text": "The service and drinks were great. The pig fries were about the best thing on the menu. Everything was quite lackluster and definitely was not worth $20/plate. Keep in mind when they say 6 dishes at $65/pp, it's 6 dishes split for 2 people at $65/pp. Awesome marketing to get you to pay $22 a mediocre small dish. If you check the ingredients, they're mostly simple and cheap - they're just laughing all the way to the bank. If this is the same quality as state bird provisions, I won't bother trying that out either.   For those of asian ethnicity - don't bother, it's all the same flavors you're used to, just dulled down and more bland.", 
    "review_date": "2015-01-23"
  }, 
  "lwU4LtljVclKuw7cQItO_g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew V.", 
    "review_text": "Absolutely gorgeous space, fantastic and helpful staff, interesting menu. Kristine and I went for the first time last night, knowing it hadn't even been open for two weeks yet. We were lucky enough to have  snagged an early reservation and I can't tell you how excited we were!  We ordered the requisite six courses, five savory and one sweet. My favorites were the dried duck and the treasure chest. Yum! The lamb was a bit bland, though the greens that accompanied it were delicious! After two or three courses, though, I picked up in a strong trend: all of the dishes were VERY salty.  I've got a salty palate, so usually this doesn't bother me... but I really felt like I was being smacked over the head with salt by the fifth course. Given the restaurant's pedigree and price point, I think I was hoping for more subtly in the flavors. I mean, I make dishes that taste mostly like salt in the comfort of my own home and for a lot less money!  As a dining experience, The Progress was to notch. If you're not a lover of very salty foods (or very porky foods), however, I suggest avoiding it until they have a bit more time to normalize and work out their minor kinks.", 
    "review_date": "2014-12-30"
  }, 
  "WJfNVm4mXXDt1Vakg13CpA": {
    "user_rating": 3.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Jenny Z.", 
    "review_text": "The Progress is a new sister restaurant, opened by the same owners of State Bird Provisions. In fact, the two are physically, right next door. Whereas SBP is the dim sum service of haute cuisine, The Progress is the banquet counterpart where courses are served family-style for each table.  Service was superb. They were attentive to refilling your water, and checking on you throughout the meal. Moreover, the waiters were quite knowledgable about the menu and are able to describe the dishes to you, with detail and opinion. The only downside of the service, at least considering the amount you were paying, was that they do not exchange the dishware often enough between \"courses.\" Although we had at a reservation at 7:30, we were not seated until past 8pm. So, be prepared to wait, even with a reservation.   Unlike SBP, The Progress has a full liquor license, which means cocktails, beer, extensive wine list and a standing bar that opens at 5pm. After a glance, my friend and I decided to go with The Concession (popcorn infused rum, Coca Cola syrup with Vermouth as its base). It was smooth, lingering on the tongue and rich on the taste buds. I loved it. In fact, I would come back just to explore their cocktail menu.   Their menu is composed of 12 dishes that seem to change, with the exception of some popular dishes like \"pig fries\" and \"smoked duck.\" Although, don't quote me on this because it has only opened for a month or so. Each person at your table is charged at a starting price of $65, with the entire table having the option of choosing 6 dishes. The courses are portioned to match the number of people at your table, which in our case was 4. Keep in mind that you are paying for about $20 per plate, rounding out to about $100pp with a drink or dessert.  1) Shaved romanesco, herbs and pig (ear) fries: very interesting. The pig ears tasted like they were pickled and then deep fried. The combination of salty, briny, fried pig ears paired well with the shaved romanesco and herbs.  2) Yuzu and olive oil marinated raw tuna with green daikon: This was delicious. The tuna was fresh. However, I wished they did something with the raw daikon and carrots so that they would embody more flavor and pair better. Overall the tuna was good but the other components were lost in this dish.  3) Curry rabbit &amp; chicken karaage: interesting. It took us a little bit to figure out whether we were eating rabbit or chicken. The chicken and rabbit karaage were placed over a layer of shredded carrots and sautéed black trumpet mushrooms. Overall, the trumpet mushrooms and rabbit were my favorite parts of this dish. The mushrooms were earthy and cooked down to a silky perfection. The rabbit was well cooked, tender and carried a light hint of curry. The chicken was dry, lackluster and left much more to be desired.  4) Treasure chest of fermented sausage, trout quenelles and pumpkin rice dumpling in a creamy pork broth: my favorite of the 6, mostly because each component was interesting and executed well. I've never had fermented sausage, which tasted almost like the kimchi in the soup. The trout quenelle's had the texture of Chinese fish balls but was much more flavorful. The pumpkin rice dumpling was soft, bouncy and extremely interesting. However, each person only gets one dumpling, which was barely the size of a quarter. The broth was light in taste but rich in texture.  5) Lamb merquez with yellow eye beans, octopus and crispy squid: this one was good too. Possibly the 2nd contender. The lamb merquez was oversalted and chewy. Despite being the star of the dish, it tasted like slim jims. That said, I especially enjoyed the rest of the dish. The octopus was tender with a hint of smokiness from the grill. The squid was deep fried and the yellow eye beans were buttery and sweet. Overall, this dish came together well, except for the lamb merquez, which got lost in this dish. 6) Dungeness crab, bok choy and tofu stir fry: it was good but not $20 good. The flavors reminded me a dashi-flavored stir fry agedashi tofu. The dungeness lump crab meat added flavor and luxurious touch to the dish, but that was about it; it was simply mixed in.   Main dishes aside, I really enjoyed the \"banchan plate\" which came with 4 different bite-size banchan. Meager in portion, but very adventurous in interpretation and concept. My favorite was the fancy cheese-it cracker and malaysian style beef jerky.  I appreciate the concept that State Bird Provisions upholds. Unfortunately, The Progress fell short of my expections. I enjoyed it the first time, but probably won't return.The beautiful ambiance couldn't make-up for the price per dish and the quality of it. Each dish recreated asian-fusion flavors, but in the end, the components were not executed as well as I wished. Moreover the construction and fusions of each dish felt disorganized and could have been more thought out. For the same style of food, I would rather return to SPB than The Progress, or save it for Benu", 
    "review_date": "2015-01-27"
  }, 
  "x_bpi_SRk-UNQ6-gfNJqnA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sangita A.", 
    "review_text": "I would never recommend this restaurant to a friend who wanted to enjoy high quality food. this experience was like cheap ingredients plated beautifully on interesting plates. if you're going to spend $85 (not including drinks or dessert) to share a tasting menu. I think they try to lure in customers with their 6 courses for $65/person spiel, but that's very misleading and frankly very dishonest. It's 6 courses to share with your whole table but you still pay $85 on your own.  I'd recommend you pop over to Stone's Throw or Aziza.  Food: -yuzu and tuna- the slivers of fish were topped with slivers of radish; sadly this mediocre entree was the highlight of the menu -smoked duck- this literally tasted like sliced baloney meat from safeway; super cheap and not tasty -roti and milk- how they can fathom charging $23 for this is beyond me (you can get twice the portion, and authentic roti and Borabodur for like $4); it wasn't bad though -butternut squash- yay, a piece of vegetable! that i can make in a microwave -'treasure chest' of sausage- so they give you a bite size sample of some chewy hard sausage, some sort of rice ball, and a squishy fish -ranch beef- pretty decent; dont' know what the crunchy stuff on top was   Service: Our waiter was friendly although not very knowledgeable about the entrees or pacing of food  Ambiance: one star is for ambiance; open feel; hate the communal table for 2 people trying to have a private conversation  bye! hungry hungry pongy", 
    "review_date": "2015-01-28"
  }, 
  "lFdcgrMkHCmvTjMEw4CVDQ": {
    "user_rating": 5.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Joy A.", 
    "review_text": "Everything you expect it to be.   If you've been to State Bird and you enjoyed it, then you know what to expect. Unique dishes with hints of Asian flavors and items that you'll never see on any other menu in the city.  Pig fries, mt. tam nettle, sunchoke with roti, smoked cod fried rice and the grilled beef with oyster sauce. I loved it all. And i even got both desserts.   Service was SUPERB.", 
    "review_date": "2015-01-24"
  }, 
  "FAlpGowixCW0jWqwg_xJlg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anagha V.", 
    "review_text": "High expectations walking in here last night, particularly given the success and quality of State Bird Provisions. Brioza and Krasinski do not disappoint! Beautiful ambiance and nice casual setting. We called the restaurant directly for a reservation - though I believe they will be moving to the online reservations soon.  Lots of Asian influences in the dishes. The meal began with a nice appetizer course called \"snacks\" - we had a delicious Chinese sausage, yogurt and radishes, trout and squid ink chip, and mushroom with truffle aioli. All delicious.  Drinks are fantastic - particularly their cocktails - we had the Sunny Jim and the Mezzanine. They're looking to do wine pairings in the future.  We did the 8-course meal which I felt was too much for me - but many people would say it's a great size. I will likely get the 5-course when I return.  Would highly recommend the shaved cauliflower herbs &amp; pig fries, dried duck with smoked prune prune romesco and almonds, creamy pig broth with fresh-grated pumkin-kimchi rice balls, and the spiced garlic squab lettuce cups.  We also had the roti, mushrooms, and cod - great but preferred the other items.  We had the Jasmine poached fruits for dessert - perfect way to end the meal. Nice and light and a great contrast to the usual chocolate-only desserts you would see at most restaurants.  SF eater has the menu : <a href=\"/redir?url=http%3A%2F%2Fsf.eater.com%2F2014%2F12%2F15%2F7394969%2Fcheck-out-the-menus-for-the-progress-opening-tomorrow&amp;s=e8bcac6b2420a168c3ec35f9d6257ee674f5892f7b484c34f4626309429c9fe6\" rel=\"nofollow\" target=\"_blank\">sf.eater.com/2014/12/15/…</a>.   Will definitely be going back!", 
    "review_date": "2014-12-16"
  }, 
  "AkUKcjAZV7gw-VKkfU56dw": {
    "user_rating": 4.0, 
    "user_location": "Napa, CA", 
    "user_name": "Lindsey C.", 
    "review_text": "I was so excited to try this place and managed to snag a reservation via Open Table. The space is very open, much larger than State Bird and has a nice airy, casual ambiance. I came here with a group of 6 and enjoyed the family style service. The choose your own 6 course meal was fun and unique too. All of the servers were very helpful, accommodating, and most friendly.  The dishes all seemed to be asian fusion/influenced, which surprised me. I guess I didn't do my research! Our favorite dishes were the dried duck with prune romesco &amp; almonds, and the shaved cauliflower &amp; pig fries, and the complimentary fried broccoli snack. Both of the desserts were also on point, but if I had to choose one the buddha's hand would be my pick. We also had the treasure chest, lamb scallopini, and squab. The squab dish was a little underwhelming for me and the other two were pretty good.  Overall we had a fun experience and I would definitely recommend going with a group to enjoy the family style serving. I'm happy I got to experience a meal here, but I am not dying to go back just yet.", 
    "review_date": "2015-01-14"
  }, 
  "mz7PK0Ir1ShvJBRgEVIUvQ": {
    "user_rating": 3.0, 
    "user_location": "Danville, CA", 
    "user_name": "pantera w.", 
    "review_text": "The sister and next door neighbor to the incredible State Bird, this place has been eagerly awaited for  months and finally it opened. Through some computer sorcery I got a booking for Saturday night.  Walking in, you walk through a crowded bar area to be seated in a downstairs area or one of two alcoves upstairs.   The decor is a basic one, with unfinished, industrial areas scattered ( or it could be they just haven't finished decorating...)  Service was fine but timing of food delivery was, frankly, slow. It gave us time to digest but it shouldn't cause us to want to dream about past meals because we can't remember how long our last course was there. Not really acceptable in a place where the menu is really limited in it's delivery to communal dishes.  Tried 3 of the wines by the glass; the Riesling, the Muscadet and the Nero D'avolo. All ok, but not the best examples for the price. Was not impressed with the Syrah as it was horribly young with green tannins. Happily they replaced it easily.  The full bottles looked more interesting, but as I was the only drinker I could only look at them enviously.  Though I saw a previous review offering an a la carte menu we were only offered a set one at $65 for 6 shared courses. Sweet idea but frankly it's bollocks.  Make the portions bigger. They said the portions would be sharing size.....  Not really, I'm afraid. The portions were more anti obesity than anti hunger.   The food. Yes. The main reason for coming. First, a mixed amuse bouche of some pickled ( and not) radishes, some Chinese spiced sausages and other tempurad objects. It started exceptionally well with the meals show stopper; the crab. Tasty, well spiced with a touch of chili, this is the dish I would come back for.  And the cauliflower/pig fries was interesting and tasty. Lamb scallopini was good but not grand.   But...the squab was just horrible. Yes it's a gamey bird but there's a fine line to being undercooked. And the presentation was more backstreet Chinatown than Fillmore. Beef was okay, not amazing, the duck was just forgotten by the waiters....  Dessert was reminiscent of a Polish compote; nice in an old country sort of way.  Maybe it's expecting too much after state bird and maybe is unfair to review so soon after opening but there was no opening week discount and $300+ later I felt a little short-changed.", 
    "review_date": "2015-01-09"
  }, 
  "Hj_GF8MnikDy4BQzf0B8Dg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meredith K.", 
    "review_text": "Excellent everything!  Everyone is so nice, great venue and decor and service of course.  The 2 of us were able to score reservations by phone and since we had flexibility on timing and dates they were able to accommodate us.    We chose the shaved cauliflower - so good!  Sunchoke 'roti' - unique and tasty, Puntarelle - definitely interesting and unique and probably my least favorite if I had to chose.  Lamb scallopini was excellent as well as the Squab.  I loved that we wrapped the squab in radicchio like leaves.  They were so kind to let us have a taste of both desserts - both very unique as well.  What we love is that they think of different food pairings and combining textures.  Love this.  We had the best seat in the house that overlooked the entire downstairs and open kitchen.  Chef even came by to serve us on of the courses.  I'd highly recommend and go with a group!", 
    "review_date": "2014-12-31"
  }, 
  "UQ4U7YylRiY_bjmxYD8XvQ": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Daniel L.", 
    "review_text": "Out of this world", 
    "review_date": "2014-12-19"
  }, 
  "uxngyX-cm_tpLbyut5rw1w": {
    "user_rating": 4.0, 
    "user_location": "San Carlos, CA", 
    "user_name": "Molly N.", 
    "review_text": "As everyone has said, it's choose-your-own-adventure for 6 courses. Everything sounded good/weird, like combinations that you can't really imagine how they are going to work together. Don't worry, they do.  What we ate:  - The amuse bouche: we could have eaten 30 more, every single element was delicious. Especially the smoked trout and the little Chinese sausage.  - Ricotta with beets and mandarin: Light and fresh, the mandarin gelee with the light/fluffy ricotta was perfection  - Shaved cauliflower-herbs and pig fries: MUST GET. I think we could have ordered just 6 of these and been happy. It looked like it was going to be super spicy but it wasn't, it was incredible.  - Poached ridgebacks with yuzu: This was the least successful dish of the night, barely cooked shrimp with carrots and other veggies - it was just ok in comparison to everything else.  - Sunchoke/rosemary roti: I expected to LOVE this based on the other reviews. I liked it, it was good, but I wasn't blown away. The roti itself was perfect, flakey and light, but I didn't love the rosemary with it.  - Puntarelle and escarole with kohlrabi and a soft egg: the was super tasty but so spicy I couldn't eat it. The spice wasn't mentioned on the menu so I was not expecting that, the waitstaff said it was the togarashi in the kohlrabi pickling juice. I can tolerate some heat but this was throat searing for me. Delicious though, the little bit I ate.  - Lamb scallopini with fava and cippolini: this was the perfect ending to our meal. The lamb was incredibly spiced, and reminded me more of venison. Not a hint of gaminess in the meat, and an amazing crunch of something for texture.  No dessert, we were stuffed!  Drinks: The El Diablo cocktail was amazing and they all sounded good.  Overall, I loved this place, the service was warm and friendly, the interior was relaxed and not too loud, and the meal was almost flawless. For just being open for a couple of weeks, I'm impressed. I can't wait to see what they do in 2015.", 
    "review_date": "2014-12-29"
  }, 
  "2t_dWhdm_ZDiseqtfv-p0w": {
    "user_rating": 5.0, 
    "user_location": "Concord, CA", 
    "user_name": "Joco F.", 
    "review_text": "Being a fan of State Bird already it was easy for me to like what I was getting myself into this Saturday.  What were the odds the food would be any less good or the service any less friendly?  Apparently very very low. What was I expecting though? I was expecting a more handcuffed version of State Bird.  In some ways it was but instead of police cuffs it was more like those soft kinky ones that you can easily remove if needed.    Right out of the gate I recognized some of the faces from next door working the Progress.  Just like next door we were warmly greeted and found out we were late for our reservation.  I basically got the time wrong.  No matter they readjusted quickly and before our drinks at the bar were finished we were getting seated.  Did I not mention there is a full bar here?  Bonus!    The restaurant itself is beautiful right down to the restrooms.  If I had a complaint it would be nice if they labeled them.  I figured it out but I could see confusion on someone else's face without signage.  There is loft seating on one side and a private large party table in the balcony on the other side. ( I hope to sit there one day )  The food is magnificent in typical Nicole and Stuart style.  Delicious, unique, and perfectly plated.  Since the format is family/sharing style there's less hustle and bustle around the restaurant aside from the kitchen.  Much like next door you can peer into the kitchen except here you'll feel less in the way.    We made it a point to try the cocktails as that's a major change from their sister restaurant.  The cocktails were solid and worked will with the meal.  The house Martini however is probably the best one I've ever had. The smoked olive and smoked juice blended well with the martini and made for a really great version of a classic.    The price was 65 dollars per person with the choice of 6 dishes. Which is very reasonable these days in my opinion.  If you want more of a certain dish they can whip it up at an extra cost.    They walk you through the menu and make great suggestions.  Without going through all the dishes I will say if you're a pork fan and the pig fries are on the menu that night. GET THEM. One of the best dishes I've ever had.  Even my friends who hadn't experienced those parts of the pig in that dish were floored.    Bottom line Nicole and Stuart have struck again.  I wonder if they'll buy out the rest of the block to make a food court for themselves.  At the least I wish they had a secret tunnel that led me right in to the Fillmore.", 
    "review_date": "2014-12-22"
  }, 
  "-g3XIcCb2b-BD0QBCcq2Sw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa I.", 
    "review_text": "After hearing a lot of hype around the opening of The Progress, I was absolutely stoked when I managed to score a reservation when they opened it up on Open Table.  Over the holidays I had a lot of home cooking, and so it was a nice break to finally have someone do all the heavy lifting.  As you've probably already know, The Progress serves up dishes family style where you have the option to choose 6 dishes of your liking from their menu.  Obviously it helps to have a lot of friends with you, but I thought we did just fine with just the two of us. We went with the 5 savory dishes and 1 sweet dish for our choosings.  Here's what we ordered:  - Dried duck with prune romesco &amp; almonds - Matsutake dumplings with sake lees &amp; kale - Sunchoke, rosemary &amp; pecorino 'roti' - Don Watson's lamb scallopini with fava greens &amp; cippolini - Grilled BN ranch beef with mustard-miso oyster sauce - Sampler of honey cocoa ice cream &amp; olio nuovo, jasmine tea poached fruits, greenage plum jam &amp; ricotta whey AND triple citrus sorbet &amp; star anise lime caramel gingered coconut floating island &amp; candied buddha's hand  Beverages: The Concession King's Crossing  Favorite dish: Matsutake dumpling Favorite savory bites/tastes: Tempura broccoli appetizer Favorite sweet bites/tastes: Candied buddha's hand (SO YUM!) &amp; honey cocoa ice cream Least favorite dish: Grilled BN ranch beef  Service was pretty good, they seemed concerned about our well-being when the kitchen fell behind towards the end of our meal.  They gave us an extra glass of wine, and the sampler of the dessert was a surprise since we had initially checked the honey cocoa ice cream dish.  It did take us a little while for us to submit our order, but they made up for it with a beautiful presentation of some appetizer samplers that came with tempura broccoli, root vegetables &amp; goat cheese, Chinese smoked sausage, and squid ink chip and trout spread.  Overall, it's hard not to compare The Progress with State Bird, and while I don't think we were quiet as blown away as we were at SBP, this was definitely a pleasant surprise and it really did meet my expectations. I would say that if you haven't been to SBP, please make the effort to go here, but if you've been and you enjoyed it, you would be pleased with your experience at The Progress.", 
    "review_date": "2014-12-30"
  }, 
  "D5uMny1pAVWhNGDvFDPp8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "DeathandFood b.", 
    "review_text": "Went tonight with the spouse. The space is impressive and inviting, the staff is still working out the kinks not surprising as they've only been open a few days. It was a full house until 11pm. There were 14 savory dishes and two desserts and $65 per person for 6 dishes shared.  TL:DR review: family style  fixed price creative food in a great space.    We got: 1. matsutake dumplings with sake lees &amp; kale-there were 2 dumplings, the skin wasn't too thick but the filling was a bit bland, the kale that they were served on more flavour  2.suncoke, rosemary &amp; smoked cured egg roti-this was a large pile of roti with bits of thinly sliced suncoke in there. this was just a very delicious and well cooked roti.  3.spicy dungeness crab ricotta cavatelli-the spouse loved this dish while I found it one note in terms of taste. It was good portion, the size of a regular entree.  4.smoked black cod fried rice with squid &amp; chrysanthemum-this was the kind of dish that you can't stop eating and it reminds you of homey meals. Everything about this dish worked.  5.\"treasure chest\" pork broth of sausage, shrimp &amp; trout quenelles, tofu and pumpkin rice dumpling. The broth is poured over table side. The broth is what makes this dish, it is so flavourful.   6. Our server brought us both of the desserts were some of our favor dishes of the meal, both desserts were more duo of dishes.  a. honey cocoa ice cream &amp; olio nuovo jasime tea poached fruits, greengage plum jam &amp; ricotta of whey. The ice cream was dense and rich and beautiful. The dish of fruit was delicious too, none of it was too sweet and the jam was so good.  b. citrus-grenadine sorbet and star anise lime caramel gingered coconut floating island- this was such a fun dessert, not overly sweet and even though it has a lot of ingredients in it, they all complimented each other.   The meal started with a plate of four snack; one was sausage, one was fish and two were vegetables.  Both the hostess and our main server was friendly, knowledgeable and inviting. Our server gave us a tour of the space after our meal.   The bar area is walk-in only but there are no seats currently at the bar and the only seat in the area are at a bench with three small tables.   They added lots of sound baffling on the left and right sides of the main dining room, the noise was still a tab too much for me. There is not an edison bulb in sight and the lighting is good and it's easy to read the menu. The space reminds me of European airports in the early 70's.  The bathroom are glittertastic. The main floor and bathrooms are wheel chair accessible.   I started going to State Bird Provisions the first week it opened and was immediately hooked. I didn't have the same connection with The Progress.", 
    "review_date": "2014-12-19"
  }, 
  "i5Cm53q0pmklQsX8soi3tw": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Jocelyn L.", 
    "review_text": "The Progress is State Bird Provision's newest addition to the Fillmore! State Bird is great but sometimes you get tired of the routine; it got a little bit repetitive and a hungry foodie always wants more. Thank god the Progress opened!  The concept is you pick 6 dishes from the menu (about 20 total items) and share family style, for $65/person. If you want to add dishes, they are an additional $10/person. Corkage is $25.  The restaurant ambiance is very cool. The bar has a metal frame hanging from the ceiling holding various plants. The restaurant as a whole is very long, and feels like you're on a train from the curved ceilings and curved walls. There are a lot of new wooden and modern panelings which are beautiful. There are two upstairs parts of the restaurant, on each end. In the center, it's a bunch of open space which creates a nice center and buzz of excitement.   The bartenders are attentive and quick, and thus we got our drinks with swift speed. I got the Sunny Jim ($11, gin, lemon, vanilla-pineapple syrup, kaffir lime leaf, soda, with curry-dusted pineapple), which tasted like a lemonade with vanilla and cream in it, quite tasty and different from any other drink I've had before.  My bf ordered the Concession ($11, rum, house cherry cola syrup, licorice bitters, with buttered popcorn) - he loved it, but for me it was too bitter of a drink (a \"guy\" drink).  Our waiter, Gerald, was an extremely friendly, hilarious gay guy whom everyone would love to have as their BFF. He kept joking around with our table, and others too, and made my bf and I feel very at home. It was great! I hope you get him as your waiter. The chef, Stuart Brioza, was there putting the final touches on the dishes and also bringing some dishes to each table. He presented some of ours very happily, and with lots of pride; you could tell that his heart and soul went into this restaurant. Very cool!  It turns out the food is very much Asian Fusion, which took me by surprise. We ordered 6.5 dishes. My favorites were #1, 3, 4 and 5:  1) Shaved cauliflower herbs and pig fries. This dish had a sour taste from the lime, and with the herbs and cauliflower, and savoriness of the fried meat, which made it taste like a Thai dish. The pig ears (don't be afraid like I was!) were not in an ear shaped like I had imagined, but instead little strips fried and oozing with fat drippings. Your loss if you don't order this one!  2) Barely Poached Ridgebacks with yuzu &amp; olio nuovo. Ridgebacks are Ebi, very similar to the dish you can sometimes order at Japanese restaurants where they fry the head, and the body of the shrimp. The head was fried, which was quite tasty. The body was poached, and very soft and the texture was amazing. However we felt this dish could have been ordered at another restaurant, not exactly the most innovative (not to say it was bad either though!)  3) Sunchoke, Rosemary, and Pecorino Roti - the WINNER of the night. Roti is a style of Indian Crepe, if you've never had. It's flaky and doughy at the same time. You just rip it off, and it went terrifically with the pecorino cheese. Oh, my god! All of the other tables were ordering it too.   4) Smoked black cod fried rice with squid &amp; preserved lemon. Quite tasty. The black cod seemed like it was poached (vs. fried like I had envisioned) but that was great too, it just made the dish softer. The squid was fried, which gave the dish a nice contrast and complimented nicely with the pucker from the lemon.  5) Treasure Chest of fermented sausage, fish quenelles, tofu and pumpkin-rice dumplings in a creamy pork broth. Basically a ramen soup with lots of little trinkets. I would say this dish was creative due to the fish quenelles and fermented sausage in the soup. What kind of soup ever includes those ingredients?! They were so delicious though! Quenelles were my fav since it was so soft - like biting into a fish cream puff.   6) Aromatic spiced squab with salted chili paste - the \"China\" dish of the night. I wasn't too crazy about this one, but the squab was cooked well (medium rare) and thus soft and chewy. It also came with lettuce wraps and the chili paste - one of which was extremely bitter, which is probably why I didn't care for this dish much. It also wasn't the most creative.   7) Honey cocoa ice cream &amp; olio nuovo. Honey cocoa ice cream was extremely buttery, creamy and chocolatey in a smooth and tasty way. However that was the highlight of the dish. I wouldn't order desserts again; stick to the main savory dishes!  Can't wait to return. I want to come back in summer, so I can try new things on the menu.", 
    "review_date": "2014-12-29"
  }, 
  "m7ulbgBB7Z-0STPpBMiOuw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "B. Y.", 
    "review_text": "The service and atmosphere were great - warm, inviting and not too dark. I had the Concession cocktail, which was pleasantly balanced. However, the food was just not up to snuff. Just about everything was \"too\" much - too strong, too salty, too overpowering. We ordered the pig fries (good but not great), the roti (that was actually tasty, but I can get good roti for a lot less at a lot of places), the treasure chest (very salty), the black butternut squash (good but really nothing special), the Dungeness crab and tofu stir fry (skimpy on the crab and not noteworthy) and something else I can't even recall.   Just wait in line for State Bird.", 
    "review_date": "2015-01-27"
  }, 
  "gfyW0vuJls8ARoHmogfcmw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marilyn T.", 
    "review_text": "To be honest, despite my 6 visits to State Bird, I've never LOVED it, but I figured that since The Progress was the originally slated project, it would be worth a try.  Even though they've only been open for 2 weeks, things ran super smoothly, and food execution was spot on.  The space feels more open than State Bird, and there is a small bar area that is available for walk ins. Reservations are getting to be just as difficult as for State Bird next door.  Everything is family style, so between the members of your table, you choose 6 courses (could be all 6 savory or could include dessert).  Cocktails were also really good. - Wild cat: I don't usually love licorice, but the absinthe in here was subtle, and the drink was very well balanced.  This was definitely my favorite - Negroni: a bit too heavy on the campari for me, but the umeboshi vermouth was interesting - El Diablo: if you like ginger beer, this one is good, not too sweet  Onto Food: 1. \"Amuse\": a giant platter that was like a full course in itself - this was a nice surprise! (a) Fried broccoli on a mushroom aioli: This is NOT your ordinary tempura broccoli - it was sweet and tender but had a good crisp outside with an almost potato chip flavor. I don't know how they did it, but this was the best broccoli I've ever had (b) Turnips with goat cheese cream: this was probably the most mild of the 4.  (c) Chinese lap cheong: sweet, classic Chinese sausage flavor (d) Squid ink crackers with smoked trout, topped with horseradish: the squid ink crisps were very light and were really good; the horseradish was very mild, but the combination of all 3 things went really well together 2. Dried duck: thinly sliced dried duck, which was on the saltier side, but this was balanced nicely with the smoked prunes and the potato croquettes.  The croquettes were small, nicely crisped, and actually pretty dense inside; the romesco was good with these, too 3. Shaved cauliflower and pig fries: the cauliflower was like shaven kimchee, but the real star was the pig fries (pork belly, pig ears). The pig ears were amazingly crisp and had so much flavor - the pig fries were definitely one of the favorites of the table 4. Farro spezzato with guanciale and octopus: the octopus was charred nicely but still very tender inside. The farro was creamy and topped with squab liver, which I had never had, but it added great flavor.  The guanciale was really nice with the creamy farro. 5. Treasure chest: fermented sausage, fish quenelles (like Asian fish balls), tofu, pumpkin rice dumplings, and a tonkotsu dashi broth. The broth smelled like dashi and looked like ramen broth.  I loved the house made fermented sausage, which was very strong and savory.  The tofu was like agedashi tofu but had a thicker batter, which I didn't love, but it held up to the broth.  The pumpkin rice dumplings were like pumpkin gnocchi and were pretty amazing. There was also pickled cabbage on the bottom to balance out the dish. It was surprisingly good even though the ingredients sound kind of random. 6. Smoked black cod fried rice: the black cod was not as strong as salt cod in traditional chinese fried rice, but I liked the less salty flavor of it, and it was in large pieces. Calamari added a nice texture.  If you're not expecting traditional salt cod fried rice, it's good; otherwise, it's a bit more mild 7. Spiced squab with salted chili paste: the most impressive dish in terms of technical execution.  A very thin squab was perfectly charred but medium in the center (I assume sous vided), and it was cut up into bite sized pieces. Raddichio was spiced with 8 spices, and you wrap it with squab, smoked meyer lemon drizzle, and their house chili paste. This was the best squab I've had, and I've never had it cooked so perfectly. The lemon went surprisingly well with the spiced chili paste, and it was a very well balanced and unique dish.  We were all stuffed by the end.  Pacing was good on everything, portions were just right, and the dishes showed the chef's versatility.  I'm very glad I snagged some more reservations because I'm definitely coming back", 
    "review_date": "2014-12-30"
  }, 
  "ftfQrhYUD91TnZc2aWJ3VQ": {
    "user_rating": 5.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "H A.", 
    "review_text": "we went to the progress when we got to the State Bird Provisions (their sister restaurant) line too late to get in for the first seating. We were able to sit at the bar, and order the six course choose your own adventure tasting menu.  It was super tasty.  Favorites included the roti with homemade ranch dressing. Hubs loved the cauliflower with \"pig fries.\" We both also loved the treasure bowl, which was a pork broth with all kinds of goodies in it. The first bite was just ok, but each bite just got better and better.  The cocktails are delicious and strong. Great meal--did not feel like a consolation for not getting in to SBP, but rather a destination restaurant on its own merit.", 
    "review_date": "2015-01-03"
  }, 
  "iK5oMORPCmoWUmannptD-Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul W.", 
    "review_text": "This is going to be one of the harder reviews that I write.  Yet another time where I wish there were half Yelp stars.  The Progress, on paper, is an awesome idea.  Take everything I love about State Bird and make it a bit bigger and better.  Add a bar with great cocktails, add seating at the bar where you can get some food without reservations, take amazing small plates but make them bigger to share with your friends, and put all this in a bigger space.  It seems like a no-brainer, can't-go-wrong type of scenario.  Right?  Well, not exactly.   I have now been to The Progress twice.  (I've been to State Bird about 4 times).  I love State Bird.  I don't think I've had a dish that I did not like.  However I can't say the same about The Progress.  Both times I've gone, I've sat at the tables by the bar.  I have no complaints about the service.  It really is excellent 5/5 star service even when you are at these tables.  The drinks are great, another 5/5 stars.   So why only 3/5 overall?  The food was a tremendous let down.  It's hard to explain, but nothing I have gotten there is amazing.  (I've tried 6+ dishes now).  I won't comment on specific dishes because they change their menu.  And perhaps my biggest problem is the price point.  Perhaps it is much more expensive to order a la carte (which I have done both times at the bar), but for $60+ per person I expect more.  Again, it may be a much better deal to have reservations and do the regular dinner.  I didn't want to write my review after a single experience where I wasn't amazed.  However after going there twice, I can say that I am so disappointed (given how much I love State Bird).  I would give this place a 3.5/5 overall, however I can't get myself to round up to 4.  That being said I think this place still has amazing potential and could easily be a 5 star place with some adjustments.", 
    "review_date": "2015-01-17"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "Wanna know what The Progress and Kim Kardashian have in common?  I know its blasphemy to compare the two but hear me out...   Love her or hate her, Kim K.  is the most talked \"celebrity\" in 2014; mainly for her arse on Paper Magazine that resembled a baboon's injected with an overdose of botox and covered in Crisco (she's absolutely beautiful nonetheless). As for The Progress, it's the most talked about restaurant opening in SF this year from the wildly popular, State Bird Provisions.   Currently, it's reservations only for the dining area. The bar has a tiny alcove for 4 diners with a limited food menu. I was a \"refresh\" maniac for the last 4 days so I was lucky enough to snag reservations when they went live on OpenTable on Tuesday; the same day as their grand opening.   The Progress' menu is Californian/New American and is served family-style. Items are available a la carte or choose any 6 courses for $65, and pay an extra $10 pp for each add'l course: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1z10K6n&amp;s=30b61976c3a675281e7c54f0d246b1d918d9f272169ecdf014ee9ffed528b0ed\" rel=\"nofollow\" target=\"_blank\">bit.ly/1z10K6n</a>. We choose to create our own tasting menu with 9 courses ($95 pp) and were full by the third course so I highly recommend coming in a large group so you can sample everything.   ~ * ~ F O O D ~ * ~ *Amuse Bouche/\"Snacks\": Radish, Smoked Trout, Lop Cheong (Chinese sausage) &amp; Broccoli Tempura: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1z10K6n&amp;s=30b61976c3a675281e7c54f0d246b1d918d9f272169ecdf014ee9ffed528b0ed\" rel=\"nofollow\" target=\"_blank\">bit.ly/1z10K6n</a> *Dried Duck w/ smoked prune romesco &amp; almond: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1C3ksEC&amp;s=cd441cd75d028973b1fb1414c8c41d719818a5e2e1c4db2d7e8d4bc7843d5841\" rel=\"nofollow\" target=\"_blank\">bit.ly/1C3ksEC</a> *Shaved Cauliflower-Herbs &amp; Pig Fries: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1wmcjYI&amp;s=b181f4e7a913b3bab426f7a6e41935bf17234f0ee86cfda0c4ba3f3bb4d43e2d\" rel=\"nofollow\" target=\"_blank\">bit.ly/1wmcjYI</a> *Sunchoke, Rosemary &amp; Smoked Cured Egg Roti: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1zzZAl2&amp;s=1983cdd9f6c45561990364162c2fdcbd9ad4b3410f138691787c6acfd67a141e\" rel=\"nofollow\" target=\"_blank\">bit.ly/1zzZAl2</a> *Spicy Dungeness Crab Ricotta Cavatelli: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1zA52Wn&amp;s=4cdb39259685daae742705524cabfa2460de9f99aba3154739a37a3a85639bbf\" rel=\"nofollow\" target=\"_blank\">bit.ly/1zA52Wn</a> *Smoked Black Cod Fried Rice w/ squid &amp; chrysanthemum: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1DQph6g&amp;s=cc3c0c6b6be34f6253b8c7ff8758b1eb2a71ff8d41ce793117d66644601777a0\" rel=\"nofollow\" target=\"_blank\">bit.ly/1DQph6g</a> *Lamb Scallopini w/ pea shoots &amp; cipollini: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F13D5dV5&amp;s=bf5d49a651749288198da55be071fb3fefec96c5ab3756360dc4d24978a10c61\" rel=\"nofollow\" target=\"_blank\">bit.ly/13D5dV5</a> *Aromatic Spiced Squab w/ salted chili paste: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1C373N1&amp;s=89ee71ad9fd9c983beaf0d0a42df306c2097e5aa4f24a2cf17375943cd468aae\" rel=\"nofollow\" target=\"_blank\">bit.ly/1C373N1</a> *Grilled BN Beef w/ mustard-miso oyster sauce: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1xsmZ9X&amp;s=fd3472d2403fcca999f122eed5b7b8a1e92c784646f9c0bda299a8cdbfd67d7d\" rel=\"nofollow\" target=\"_blank\">bit.ly/1xsmZ9X</a> *Persimmon Sorbet w/ gingered-coconut floating island &amp; candied buddha's hand: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1wPqog5&amp;s=46855615a8d639254e2a0bcfd7f87c0dd9bef54a3581b8ca3a1bf1b13a080c61\" rel=\"nofollow\" target=\"_blank\">bit.ly/1wPqog5</a>  I adored the quad of amuse bouches (\"snacks\" which was a great indicator of the great things to come. The smoked trout was so addictive that I could have annihilated an entire bowl of it.   For the appetizers, the standouts were the Shaved Cauliflower with pig fries and Dried Duck. The pig ears were gelatinously crunchy and really gave a delicious texture contrast to the cauliflower. The prosciutto-like Dried Duck was sublime when wrapped around the baby potato croquettes.   The Roti was carbliciously flaky with the smoked cured egg giving it an assertive saltiness. Make sure to eat this while it's still hot! We weren't too fond of the Crab Cavatelli as the tomato sauce overpowered the crab meat. Didn't like the green beans that were mixed in either.  A must order, the Black Cod Fried Rice was aromatic and complex both in flavor and texture from the tempura calamari. Another must order is the squab, it was nicely spiced and uber tender. The salted chili paste reminded me of gochujang but much, much better. While the lamb was also perfectly tender, it could have used a sauce to tie everything together. My least favorite was the BN Beef which was a tad chewy. The mustard-miso oyster sauce sounded great on paper but I found it a bit funky tasting.  At this point, we needed to lay our muffin tops onto a flatbed to roll out of the restaurant but luckily dessert was refreshing and light.  A genius exotic combo, the persimmon sorbet and meringue-like floating island and candied buddha's hand was perfect for someone like me who doesn't care for sugary sweets but craves a little something sweet to end a multi-course dinner.  Oh and I can't forget about the cocktails. If you like something savory and lightly sweet, try The Concession ($11) made with popcorn rum and cherry cola syrup: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1x2Dt8Y&amp;s=d2f27c16abc25dfafa23d2370129c622823ea276f116d52fec317d4a9be58263\" rel=\"nofollow\" target=\"_blank\">bit.ly/1x2Dt8Y</a>.   ~ * ~ S E R V I C E ~ * ~ For their 2nd day of opening, hats off to the amazingly wonderful staff. From the hostess, our waiter (Ethan), food runners, to the sommelier, everyone was welcoming, knowledgeable (they knew every single ingredient on the menu), and attentive.   I recognized some of the staff who use to work at Mina, Hakkasan, and Aveline and they were nice enough to come and say, hi when they recognized us. I'm planning a group dinner next month and Betsy was kind enough to give us a tour of the restaurant.   Food service was on-point; 9 courses took a little over 90 minutes.  ~ * ~ A M B I A N C E / D E C O R ~ * ~ Previously the historic Progress Theater, they did a wonderful transforming the huge, multi-level space into a bright, warm , and casual space. The main dining room fits about 50 people while the dual mezzanine is great for large groups (8-20 people).   ~ * ~ P A R K I N G ~ * ~ The Fitness SF garage (1 block away across from the old Yoshi's) and Kabuki garage (2 blocks) both charge $2/hour after 6 pm.", 
    "review_date": "2014-12-18"
  }, 
  "Sem3wD90eSvZ1K9GAKudMA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J K.", 
    "review_text": "Since state bird is one of my fav restaurants, I was super excited about coming to the progress. I can honestly say this is my new fav and I was impressed with everything. The fusion of delicious flavors and quality ingredients matched with superb service. I think there are many overrated restaurants but the progress deserves all the raves.", 
    "review_date": "2015-01-29"
  }, 
  "KUusL15g7gVmPO7_XRp8cQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline L.", 
    "review_text": "* 5 stars for the drinks (especially The Concession which i just cannot get enough of!) and service!  It's my second time here, amuse Bouche, roti, cheesy dumplings (reminded me of quesadillas), QUAIL.. All very good!  We couldn't finish the \"duck ham\" which replaced the glorious dry aged duck with potato croquettes on the menu. Also sad to see the black cod fried rice with crispy calamari go...  I understand that the progresses menu changes all the time but I really think they should keep some sure win favorites. Also do not order the steak.. I was too inebriated the first time and didn't notice how dry it was until my friend complained about it. Tried it again last night and still wasn't good. Pass.  Think I will come in for lots of cocktails and order some la carte dishes that I like next time!", 
    "review_date": "2015-01-21"
  }, 
  "icdimK6dzx87Q6MIxodilg": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Ron P.", 
    "review_text": "Great food and cool vibe. Came in for the 6 course family style menu and left pleased. Top dishes were the roti, beef and pig fries. Service was great and not too invasive as some have suggested. Overall a good experience for the price and would come back in a few months to see what's new on the menu.", 
    "review_date": "2015-01-10"
  }, 
  "CZnLf1eMuc39XovNcTnLHQ": {
    "user_rating": 3.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Julia Z.", 
    "review_text": "Chef's table business group dinner. Maybe we had too high expectations, but I was a bit disappointed with food.  Service was very good , but food was just OK to so-so. Thinking back I liked some dishes and didn't like others, but there were no OMG moments at all. Also since we got $85 tasting menu I expected a more cohesive thought through meal, but instead we just got family style collection of different dishes that didn't always match/were not suppose to be served together. So at the end of the day I got a lot of muddled flavors. Also I think from the value perspective for $85-90 per person I would expect more .....", 
    "review_date": "2015-01-21"
  }, 
  "fXKRTax3LU5mLat_-Z13zQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L C.", 
    "review_text": "I came here last night with my fiancee and we both left with the highest praise for our server, Jerald. Service was phenomenal and the whole dining experience was absolutely the best I've had in a long time.   The amount of food, I felt was not at a bad price point. $65/person for 6 plates. Although, our reservations were at 9:45p, so we did have a bit of food before then. We will come back again closer to a regular dinner hour to confirm this.  WOULD ORDER AGAIN:  Pork Fries - Basically bacon fries w/ fried pork ears. Tossed with a tasty acidic cauliflower salad. I need more salad though, to cut the fat.  Apple Sorbet w/ Black Pepper Floating Islands - Delicious way to end the dinner! Glad Jerald was kind enough to let us try this one and the Choco Honey Sorbet.  The Treasure Chest - Sausages and kimchee in a broth. Most memorable for me was this pumpkin mochi they put on top. Highlight of my night! I wish they had a plate of the pumpkin mochi alone!  Sunny Jim - Tasted like sunshine in a cup! Felt like I was on vacation!  DON'T MIND SKIPPING NEXT TIME:  Dumplings w/ Salsa Verde - The salsa verde was phenomenal. But the dumpling was a bit doughy. I would have preferred it more with a thinner skin or a crispier sear on the dumpling. The cheese inside the dumpling also made it more fattening.  Roti w/ Truffle Cream Sauce - This sounded delicious on the menu, but right as it arrives, you just get a whiff of the cheese. So it's kinda stinky. The roti itself didn't have a lot of flavor, which was expected. But the cream sauce was underwhelming as well. The sauce could have used a bit of salt.   SPECIAL NOTES: We started with a free snack plate, which was great. I love free. My absolute favorite item on the snack plate was this piece of radish with some sort of sauce on it. I was too excited to listen to the server tell me what it was. LOL. Something super simple, yet, blew my mind. Thanks Progress!", 
    "review_date": "2015-01-16"
  }, 
  "TmDaYip-8qSuSIMtYW872Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johanna L.", 
    "review_text": "I suppose my new year's resolution is to eat out each night and at a new restaurant every time. I made my way out to The Progress with the BF and a friend visiting from LA (with whom I also went to SBP my first time!). We aren't the type to make reservations, so we pressed our luck by going early to wait in line for one of the few tables left open for walk-ins.  The BF and I arrived first at 4:30p; no one was in line yet, but the SBP queue had already gathered. Here's the deal: if you don't have a reservation, you can get there early to wait in line and try to snag one of the seated tables. There's also an option to eat in the bar, but the tables are small and best for 2 people max; I even saw some people standing to eat at the bar -- whatever works.   They open doors @ 5p for both resos and walk ins, with the option of hanging out by the bar to grab some drinks. For walk-ins, first seating is at 5:30p so we hung out for a bit. Cocktail prices are reasonable, with the usual selection of gin/rhum/bourbon/mezcal/tequila style drinks. Our table took awhile and I had to check in with the host again (who seemed a bit stressed), but we were eventually seated closer to 6p.  The dining style and cuisine focus is quite different from SBP -- less tapas/dim sum and more family style portions with a huge emphasis on Asian flavors. The table has to decide on 6 dishes to fit within the $65/person, but if you want to add additional dishes, it's an extra $10/person per dish. After you decide which 6 plates you want, the chef and staff will portion out the dishes depending on the size of the group. We selected the following:  + Amuse bouche of smoked lap xuong, fermented goat cheese and pickled radish, broccoli tempura, and toasted seaweed with a salmon/mustard seed topping - beautifully plated and great rich flavors to kick start our palates. This really set the tone of the Asian cuisine themed menu. + Shaved cauliflower-herbs and pig fries - one of my favorites of the night; the pig fries were crispy yet chewy at the same time. I could have ordered 2 of these to myself. + Sunchoke, rosemary, &amp; pecorino \"roti\" - we saw someone order this at the bar and knew we had to get it as well. The roti dough was freshly made and presented in a tent like, folded manner with shavings of pecorino on top of it. I didn't care for the specks of rosemary in it, but the sunchoke was a nice break from the rich flavors. + \"Treasure Chest\" of fermented sausage, fish quenelles, tofu &amp; pumpkin rice dumpling in a creamy pork broth - the production of pouring the broth into the soup is part of the experience. Seriously, do not sleep on this. The broth is rich and creamy like a ramen broth, with the tofu fried to a unique consistency that still maintained it's fry even while in the broth. The sourness from the fermented sausage (reminded me of something we ate in CPH) created a well-balanced amalgamation of flavors. + Don Watson's lamb scallopini with fava greens &amp; cippolini - encrusted with sesame seeds, the lamb was cooked well and had a nice crisp due to the sesame seeds. By this time I was getting a bit full, so the smaller portion was fine by me. - Smoked black cod fried rice with squid &amp; preserved lemon - I suppose I expected this to be like Mission Chinese Food's salted cod fried rice, and it wasn't. The consistency was more creamy and that's likely due to the rice being recently made; not the day old rice we usually use to make this ;) - Aromatic spiced squab with salted chili paste - we didn't actually order this, so when the chef brought it out we were confused. Our server had made a mistake and as a way to make-good, extended this plate gratis which was extremely courteous. Squab tasted like a mix between quail and lamb with a five-spice like rub; I wasn't over the moon about this dish so it was great that it was free.   Dessert: our server gave us the option to order both desserts as 1 dish which was awesome -- he just asked us which one we wanted more of to portion it out accordingly. + Honey cocoa ice cream &amp; olio nuovo w jasmine tea poached fruits, greengage plum jam &amp; ricotta whey - dat honey cocoa ice cream was the richest chocolate ice cream I've ever had and want to keep eating. Mixing the jam and fruits together was also a nice refreshing touch. - Triple citrus sorbet &amp; star anise lime caramel w gingered coconut floating island &amp; candied buddha's hand - more neutral on this one, I could have eaten just scoops of the honey cocoa ice cream and been satisfied.  Service was impeccable (despite the delay in being seated and the host looking confused when I checked in with her), the ambiance was bright and lively, and the food was spectacular. The tables were actually made from a tree in the Presidio that was either cut or had fallen down 4 years ago, and had been curing ever since. Apparently I'm into tables.", 
    "review_date": "2015-01-09"
  }, 
  "T81uBXsyGOjD2dpnPnzOPg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy Y.", 
    "review_text": "1. Have to sit at a communal table even though made reservation ahead of time.  2. Had to repeat my drinks three times within 1 minute because the waitress cannot seem to remember. (btw, it was the only choice of Cabernet they sell by glass on the drink menu.) 3. When my friend handed our dish to the waitress, she did not say \"thank you\" or have eye contact. Just left the new dish on the table and left.   There is simply a different between bad service and rude. To me, this is rude service.   The food was below average. We did not finish any of the dishes except tuna. And giving how small the dishes are, it tells a lot about how they taste.   65/per person + 1 drink = a little over $100 including everything.  After paying, you will think to yourself, \"why did I not use that money to go shopping??\"  In comparison, the SBP is way better and will not be back at the Progress.", 
    "review_date": "2015-01-25"
  }, 
  "HQSjIN1XrEVJtI7Lu7aoaw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K S.", 
    "review_text": "I don't usually feel inspired to write reviews unless I have a complaint, but in this case I have none at all. Our dinner here last week was fantastic - honestly, it lived up to the hype.  When we arrived the host who greeted us said she was giving us the best seat in the house, and she was right - the table on the mezzanine near the entrance, where you can look out over the whole space and into the kitchen. I was surprised they sat a party of two at a four-top but we enjoyed the extra space. The interior is beautiful.  We chose: tuna crudo, shaved cauliflower and pig fries, sunchoke and rosemary roti, lamb scallopini, spiced squab, and one portion of each dessert (didn't realize you could do that but I was so happy to try both) - that's one honey cocoa ice cream with a buckwheat-beer crepe, and one guava sherbet and coconut floating island.  The pig fries were fantastic (the name of the dish is misleading; it's all about the pig). I would never have chosen the roti if I hadn't read reviews praising it, but it might have been my favorite dish; the rosemary worked really well to bring these seemingly disparate ingredients together. The squab was perfect. The tuna and lamb are the ones I'd be most likely to replace next time; they felt a little less creative in terms of flavor combinations.  Both desserts were great but if I had to criticize: they each come as two components, and we kept losing track of which ones went together. If I could split them up then I'd get a crepe (the poppyseed cream that came with it is wonderful) and a floating island.  On the recommendation of our waiter, we also had a half-carafe of the trousseau gris, which I would never have chosen but was an excellent match for us.  The portions were perfect - as two small women, we worried we'd run out of stomach space, but at the end I felt pleasantly full. Service was on point. Just overall a great experience.", 
    "review_date": "2015-01-11"
  }, 
  "toOht-Wn-X3g30GFpMkP4w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johnson S.", 
    "review_text": "Came here on a Monday night around 5:45 and was seated right away. Reservations recommended, otherwise you'll be sitting at the bar with a limited menu. $65 per person, with each additional dish $10.   I started the meal with the El Diablo... never tried pear tequila but it was tasty! The drink was made well and it really stood out since it was so red. Free amuse bouche which consisted of a chinese sausage (lap cheung), tempura battered broccoli, nori cracker, and pickled radish. Tasty little snack and the presentation was nice, definitely got me excited for the meal! Next up was the dried duck with smoked prunes and the pig fries. I'm not sure if it's because these two came together, but the dried duck didn't really stand out to me. It was lacking something in flavor, which made it an easily forgotten dish. The pig fries (pig ears) were AMAZING. I think I should have just ordered another one of those dishes. Everything on that dish complimented each other so well, and there was just enough acid to lighten the dish up. Each bite had a nice crunch and it was just on point in everything. Again, I'm not sure if the duck was just MEH, or because it went up against the pig fries and lost a horrible fight. But winner here, goes to the pig fries! The next dish was the lamb scallopini, which was pretty good. I'm not sure if the lamb was done two ways (since there were two different colored meats) or if one was lamb or whatever... but both were pretty good. One of the meats was too peppery which kind of masked the natural lamb flavor (some people hate that, I guess) but I felt like it was over seasoned. Then the spiced squab came and... presentation wise... I was like WOAH. I say that because the claw was just hanging there. The squab was seasoned nicely, moist, and it had a nice crisp all over. Was definitely my second favorite dish of the night I think. The next dish was the smoked black cod fried rice with squid and preserved lemons. The cod pieces were fried which was tasty. Overall, the dish was good, but some bites were a bit salty compared to other bites. I'm not sure how that happened since we gave it a good mix... but that was definitely one of my complaints. My friend that I was eating with couldn't eat the dish since it was too salty for him (it was okay for me since he probably got the saltier parts... lol). We then added the treasure chest since so many people around us was ordering it which consisted of fermented sausage, fish quenelles, tofu, pumpkin rice dumpling in pork broth. The broth was rich and nicely flavored. The fermented sausage was a bit too strong for me... I felt like I was forcing myself to eat it since I don't like wasting food... but it was definitely pretty sour/salty or however you want to describe it... eating it with the tofu kind of toned the flavor down a bit. Then came down to the dessert and I'm not much of a dessert person, so I won't write much about it. We got both the desserts that they were offering that night, but I preferred the guava sherbert one over the honey cocoa ice cream and the crepe. One of the reasons was that the chocolate one had too much going on and all the flavors were overpowering each other, whereas with the sherbert, everything complimented each other pretty well.   Decor inside is nice and I think they're still making changes (at the time I went). Service is great and the staff is extremely friendly. Some of the dishes were a little off, but I'm sure with time, they can only improve. Definitely recommend coming to this place if you're in the area. I've never been to State Bird (which is right next door), but I'm excited to try if it's similar to here!", 
    "review_date": "2015-01-19"
  }
}