{
  "eRVx1VTaMrcXk4n3ShHgeg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "onika c.", 
    "review_text": "love this place, right now it is intimate and nice for a small gathering of friends. It has so much potential, especially the lower level to be a dance spot. The only thing I would change would be the music. The bartender was great. the bill murray drink, infusion confusion and rave cave were great, but stay away from the ain't nothing tender about this mother****er drink. The problem with this place is that it was deep in the TL and my group was dressed to impress, and we felt unsafe walking there even with 2 guys in our posse, so be careful. They have a bouncer once you arrive, to keep out the riff raff, but be advised you are deep in the TL.", 
    "review_date": "2015-01-10"
  }, 
  "30pQFtqfXaA7RW1X9uvYwQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ted N.", 
    "review_text": "keep up the good work,talent and drinks.. ohh, and the pleasant service as always..", 
    "review_date": "2015-01-09"
  }, 
  "J01BFkZZJR6CVJtBkq03vw": {
    "user_rating": 5.0, 
    "user_location": "Mission Viejo, CA", 
    "user_name": "Pauline N.", 
    "review_text": "Context: My friends and I came here for vacation and happened to walk by this place and it looked like a chill spot! Be careful when walking around at night though, other than that totally worth it!  Food/drinks: My friend and I ordered this drink called Coco Loca, I honestly don't know what was in the drink but their was chocolate shavings on the top which was super tasty and made for a great chaser! My friend had the Oatmeal Stout and she loved it!   Price: $8 for my Coco Loca, very good price in my opinion for the drink. They also have a happy hour which is pretty good.   Environment: The ambiance is super nice and classy and I love the layout. The top is a bar and when you step down its another lounge-y area that was used as a comedy open mic for when we came. I believe it's a dance floor or lounge the other nights. Dim lighting yet still very inviting.  My friends and I happened to walk into Open Mic Comedy Night and went downstairs to see comedians perform! Some were new and others perform regularly so it was fun watching the diversity of it all.   Service: Super friendly and nice bartender and owners/host!  This place re opened so I would recommend checking it out! Good drinks at good prices and nice environment", 
    "review_date": "2015-01-14"
  }, 
  "hiESplWzqKB1-eyYPsZI-w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Woojae K.", 
    "review_text": "Little hideout on Hyde. Great drinks and atmosphere. Highly recommend the beer coctail Catch 222 and Dr. Turk and Mr. Hyde. Everlyn is a sweat bartender.", 
    "review_date": "2014-10-31"
  }, 
  "3K_kEI0iHKf-G8ePsBM4ZA": {
    "user_rating": 5.0, 
    "user_location": "Little Tokyo, Los Angeles, CA", 
    "user_name": "Angie F.", 
    "review_text": "My team and I recently hosted our holiday party at the Basement and had a wonderful experience. Larry, the owner was so kind and accommodating helping us get set up. The drinks were incredible (I recommend the Dr. Turk and Mr. Hyde if you like ginger) and the service was great. I would definitely recommend it if you're in the area!", 
    "review_date": "2014-12-19"
  }, 
  "7JWVWOr3To_9ongwxwza7w": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Melanie F.", 
    "review_text": "Great music, awesome soju cocktails, and welcoming ambiance. Hope they are here to stay....", 
    "review_date": "2014-10-30"
  }, 
  "o2KTMMFiep3QdWxH7luFtg": {
    "user_rating": 5.0, 
    "user_location": "North Oakland, Oakland, CA", 
    "user_name": "Julia F.", 
    "review_text": "Im going to keep it simple. When my friend said a let's go to a bar on Hyde and Turk I was a little weary, but this place is amazing. They have a large selection of beer and an amazing cocktail list. The layout is really nice downstairs, a lot of room for you and your friends to chill on the couches. I always get the \"where's Bill Murray?\".", 
    "review_date": "2015-01-25"
  }, 
  "3FZBQv-FODqL1kuZEw8WUA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven T.", 
    "review_text": "Cool hidden place... Try \"Where's Bill Murray\"", 
    "review_date": "2014-12-28"
  }, 
  "B818sHWR516wQODWLxPD4Q": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Kenny C.", 
    "review_text": "I used to live above this bar, its a great piece of architecture and atmosphere. I hope it gets popular as the inside is so nice. I know the neighborhood is a little rough but this place has TONS of potential. I'd encourage anyone to check it out and see what you think for yourself.", 
    "review_date": "2014-12-08"
  }, 
  "-QUMjIOpiM2ZBfmNYDC9Cg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle B.", 
    "review_text": "This place is a diamond in the rough! Completely hidden in the depths of the TL, The Basement has this very exclusive and regal vibe, but feels like home, due to its super friendly staff. The cocktail drinks are very creative and super tasty and I think they could give any gastro-pub a run for their money. They even have a decent selection of draft and bottle beers if you wanna keep it simple.  This place warrants you to return and explore,  the downstairs is plush and hosts different DJs.. this spot will definitely be in my regular hangouts from now on. It has the potential to be a landmark in this part of town.", 
    "review_date": "2014-10-29"
  }
}