{
  "eiTboCTfpX0t8mWXLwcwYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David P.", 
    "review_text": "Great bar, awesome bartenders, cheap chicken wings and bacon wrapped tator tots...plenty of tv's to watch sports.  Bar is full of 49er faithfuls...", 
    "review_date": "2014-02-09"
  }, 
  "aVaa64zb_-d6VTY3XcXyIQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jane A.", 
    "review_text": "THE BURGER (3 stars)  So, I've been to The Boardroom and had their tator tots there and they were delicious. I was happy to see them participate at the Ft. Mason Burger Brawl but was kind of disappointed in the food. The tator tots were not what I recall. Their burger looked pretty plain but something about the patty was pretty tasty, what killed it though... the bread - it was dry as hell.   Will I be back? I'd skip them next time at the Burger Brawl and would rather to go their bar to eat.", 
    "review_date": "2013-06-10"
  }, 
  "ws6VBKkh6RhZH1afgAtFqA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Wayne C.", 
    "review_text": "holy crap, the bacon wrapped tots were simply amazing!  worth it to come here just for them!", 
    "review_date": "2015-01-15"
  }, 
  "qDZON_eIlgEG6XZUrk9-lw": {
    "user_rating": 4.0, 
    "user_location": "Auckland, New Zealand", 
    "user_name": "Lauren T.", 
    "review_text": "Wine was pricier than I anticipated ($8 for a house red). But it's a cute bar with friendly staff and a relaxed atmosphere. Good for people looking for a comfortable spot to have a drink and a snack.", 
    "review_date": "2014-11-21"
  }, 
  "0t-O5--DOfS55A620fO_GA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrea H.", 
    "review_text": "Yay! I'm a fan.  Here are 5 reasons why I give two thumbs up to The Boardroom:  1.  The Boardroom is an Arizona State University bar! Fork 'em, Devils! The NorCal ASU alums congregate here for games 2.  Bacon-wrapped tater tots are amazing 3.  This little dive bar is cozy and has a great neighborhood feel!  4.  You can get poutine here!  5.  The regulars are friendly and the management is too!  There is good company here", 
    "review_date": "2014-09-11"
  }, 
  "wJgtf18VKKZq9A6ZQUybQw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Candace R.", 
    "review_text": "My alumni group scheduled a game viewing here which is probably the only reason I would have stumbled upon this place. It's not a huge bar, but I didn't feel claustrophobic when it started getting pretty packed after the game started. I scored some seats up front by the window and when it wasn't too busy, the service was great. I had an order of the crispy pork buns (good+) and the bacon wrapped tater tots (over-hyped and only okay), as well as my fair share of drinks. My main complaint is that well into the evening, there was a TON of people in the bar and only one bartender, so it took forever to get a drink after he noticed you at the huge bar. This wouldn't stop me from returning, but I hope they plan for better coverage when they have events like that.", 
    "review_date": "2014-12-11"
  }, 
  "bpgbVPJcG-wQ4cNBcPPIxw": {
    "user_rating": 3.0, 
    "user_location": "Tempe, AZ", 
    "user_name": "Monica O.", 
    "review_text": "Looking for a dive bar in the city that locals frequent and the tourist don't wander into? Then The Boardroom is your place to go!  This place is a dive, but you can get bacon wrapped tater tots, WHAT?  BACON on potato action, hell yea! They were good, not mind blowing but good, its bacon how can you go wrong.  Couple of TVs on the wall to catch some games, nice seating area, looks like it could get packed, was there on a Sunday afternoon and it was 50% full.  Blue Moon on tap and that's what I drank.  Restrooms are a hot mess, do go, HOLD IT!  Took some pics, shared a laugh or two, so good times happened in this place.", 
    "review_date": "2014-08-07"
  }, 
  "XvKdp9PB4rKJKwI798mJgg": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Alexandra I.", 
    "review_text": "We were able to get a table and it was comfortable and big. I got a beer and tried a couple of a friend's fries and they were yummy! I've heard this place has better than average food.  Lots of TVs too...", 
    "review_date": "2014-04-18"
  }, 
  "AsJ5TxY87oSFcGxu5tuc9g": {
    "user_rating": 4.0, 
    "user_location": "Canyon Country, CA", 
    "user_name": "Sam D.", 
    "review_text": "Cool bartender and a chill vibe in this neighborhood bar. Don't pass up the bacon wrapped tater tots. Truly an appetizer born from binge drinking.", 
    "review_date": "2014-07-09"
  }, 
  "AG3qumWJW32yJtizz7-saQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nic S.", 
    "review_text": "This bar is a great neighborhood spot.  I always have a good time - whether it is for weekly Tuesday Trivia, Thursday night football, college football Saturdays...or just to pop in for a few drinks.  The beer+shot specials are always a solid choice!  Tuesday Tacos are delicious - not greasy, more gourmet.  Only complaint - sometimes when they are hosting a college team's fan base, it feels as though the bar is over capacity and impossible to even get a drink or move (I'm used to crowded rowdy bars, so this isn't just a dumb girl complaining about being squished and sweaty)...Usually find a hideout in the back dart room when this happens so it's all good!", 
    "review_date": "2014-03-07"
  }, 
  "Rd_k48XNACxaSBN0D8uk3Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristan B.", 
    "review_text": "Great place to catch a game (what ever sport you want to see). There are at least 5 tvs inside. Its a casual local bar that can get packed depending on the day.   Goods good, had the tachos - tater tot nachos. they came out piping hot with lots of steak. A great price for the amount of food.   The bloody marry was good, some spiciness to it with olives, peppers and green bean vs a celery stalk. YUM", 
    "review_date": "2014-11-06"
  }, 
  "BmadK3z9p31Ua3MYsZQyyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom L.", 
    "review_text": "Went here because someone that I share a workspace with said they have good wings and other bar food.  Luckily went on the wings special night and had several tasting items from the bar menu.  Really liked the onion rings, nachos and wings while the bacon wrapped tater tots didn't quite live up to billing.  The bartender Sal was really fantastic - nice guy mellow great serving.  This place is everything you want from a local bar hang-out (not fancy)- I've already been back with my wife and she loved it as well.", 
    "review_date": "2014-01-09"
  }, 
  "Hnu5s_myOZZIS2eny7liVA": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Emily J.", 
    "review_text": "Post-Awesome 80s 5K (<a href=\"http://www.yelp.com/biz/awesome-80s-run-san-francisco#hrid:1utkwLbIxRyRkSfJKYsK6A\">yelp.com/biz/awesome-80s…</a>), we arrived in North Beach a bit early for our brunch reservation at Trattoria Contadina (<a href=\"http://www.yelp.com/biz/trattoria-contadina-san-francisco\">yelp.com/biz/trattoria-c…</a>).   After parking, I quickly searched \"bloody marys\" on my yelp app and this place popped up. There just so happened to be four stools available at the bar and the bartender whipped up some delicious, perfect-amount-of-spice, bloody marys.   We almost canceled our brunch reservation elsewhere when we spotted some of the delicious food offerings being served around us. I'm glad we didn't because our brunch at Trattoria Contadina was incredible. However, I am bookmarking this place for another visit so we can try the food. Mostly because...tater tots!", 
    "review_date": "2013-11-21"
  }, 
  "yW-GBoKnzyduaG86Y1NLzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily W.", 
    "review_text": "I have fond memories of the Boardroom. It was where I had my last round of drinks pre-sobriety (darn you medicine!). It was one of many places I went post-sobriety. It was where I was thoroughly entertained by witnessing a cute (girl) bartender hitting on my cute (male) colleague...while my other colleague and I pointed out all her moves. In another language, of course. We have some decency...well, not really. Bartender probably knew...but colleague didn't until we pointed it out!  Found myself stumbling back here the other day...and they have bacon-wrapped tater tots. That's right. Bacon makes everything better, and they have made the tater tot into something amazing. AMAZING. We were also tempted by the hot wings...which had the scent, but didn't taste as good as we'd like. It has a good crisp and flavor, but...it was JUST this side of dry. Boo.  Current bartenders here are very friendly and attentive. Is a very comfortable place to hang out!", 
    "review_date": "2013-11-15"
  }, 
  "vnV0eJVf0hb7MKu4tHCBJw": {
    "user_rating": 4.0, 
    "user_location": "Brisbane, CA", 
    "user_name": "Meghan B.", 
    "review_text": "Wandered into the Boardroom by myself to catch some of the NCAA tournament. I'm from out of town so the bartender was very friendly since I was all by myself. I think his name was Lou... The place had a good atmosphere and a good group of people trying to get their Friday drink on.   The food was delicious! At the suggestion of the bartender I ordered the BLT with avocado and sweet potato fries. Delicious!! Everything tasted fresh. I wish I lived closer so I could visit this spot regularly.", 
    "review_date": "2014-03-24"
  }, 
  "CqVM1P-jjY7wy52K6gEqow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roxanne D.", 
    "review_text": "To the guy below that call the place \"Racist\". I was there and I'm african-american. You were kicked out for taking your beer outside. No place allows that if they can't serve liquor outside. The Bartender ( Sal ) was super polite, reasonable and gave you NUMEROUS WARNINGS. You and your friends were out of line and rude. You can't break the rules and be sh*tty!!!! Sorry... you gotta Pick One! That is why you got the Deuces, bruh!  This place is amazing. Great Food and Great Staff. The perfect local sports bar!!!!! From the drinks specials to the neighborhood, it doesn't get much better than this. It's kind of place you can walk in alone and leave with new friends. Love y'all!!!", 
    "review_date": "2014-09-04"
  }, 
  "4FXbovgSEFZ5_9S5wddFIg": {
    "user_rating": 3.0, 
    "user_location": "Glasgow, United Kingdom", 
    "user_name": "Lisa E.", 
    "review_text": "Try the bacon wrapped tater tots!  I am not sure they are '$9 good' but it is bacon and tater tots, you really can't go wrong.  The Boardroom was a typical dive, order at the bar and disgusting bathrooms, but it was fabulous to get away from all the tourists!!  We each had a cold beer, wolfed down some bacon wrapped tots, then decided it was time to move onto the next watering hole.", 
    "review_date": "2014-08-05"
  }, 
  "vvGHIcfCr2toX6Bts5W7ew": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephenie S.", 
    "review_text": "I'll give the bar itself 4 stars, but if I was rating the clientele, they'd get a big FAT 1 star. Talk about a Sausage Fest. And not the good kind of Sausage Fest, ladies! All the worst kind of douchey sausages that you could never want to meet. I truly hope that we had an off experience last night when we went to trivia because I feel sorry for the Boardroom staff if that is what their normal patrons are like. I'll probably only go back if I feel like it's a good night to get constantly harassed.  BUT the bar. The most important part of the review. The people working there are great. Nice people. But there were no waiters, so be prepared to go to the bar to order. The food, for the most part, was good bar food. Bacon wrapped tater tots: Delicious (though few in quantity. Not shareable, in my humble, bacon-loving opinion). Tacos: Yum Yum. Nachos: Great. Mac 'n Cheese: Not great. Just avoid it. They lured me with the promise of cheese and bacon and I felt duped! It was more watery than cheesy and even the bacon couldn't save the dish!  $5 margaritas were okay, but not strong at all. I had four and felt fine. I should have been buzzin' hard though; I am quite the lightweight. But they have $2 Tecates on Tuesday, which is a sweet deal, so you should definitely go for that.  The reason we went to The Boardroom, however, was to participate in Trivia Tuesday, which was disappointing, in my opinion. It started about a half hour late, which, in fairness, was due to the A's vs. Royals game going into extra innings, but it just got going too late for a work night, if you ask me. I couldn't hear the woman reading the questions. When she spoke at a good volume, she was kinda mumbling (drink much, lady?). And there were HUGE time gaps between rounds. I heard that it is usually better organized than that, but it was frustrating for me and my gal pals.  My general experience there probably warrants less than 4 stars, but I truly believe it was an off night based on what I've heard from others, the yumminess of the greasy food, and the quality of the service. Worth a shot, just beware of male patrons: they just may be nacho-stealing tards.", 
    "review_date": "2014-10-01"
  }, 
  "7kPR3NAhl72EGbUU1h9FOw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Greg F.", 
    "review_text": "What a pleasant football Sunday we had because of the boardroom!  The TVs aren't the biggest, but there are enough of them all around this cozy bar to make every seat front row.   The bartender was very attentive, and never left us with a dry glass. The food was plentiful, basic and tasty. I strongly suggest the biscuits and gravy, but would not frown on the moco loco either. Their buffalo chicken tenders hit the spot for our second round, but the most impressive we're the nachos and the BACON WRAPPED TATER TOTS!  The crowd was excellent, a mix of all ages appropriate for a bar. There were pats, Vikings, skins, Seahawks, and of course 9'ers fans. Everyone had actress time cheering for their respective teams in this highly inclusive environment.   My only gripe is in regards to the pitcher of mimosas. The bottom line is that idea needs to be reworked in a way that is tastier. (Most likely a bit more OJ is in order)", 
    "review_date": "2013-09-23"
  }, 
  "cY2O_YfM_e45jkiYl4U3Sg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jordan S.", 
    "review_text": "We came in last night for trivia and had a blast.  Service is great, considering how busy they were. $5 margaritas all night. ***I accidentally gave a lousy tip, I mean I did have 5 margs (but I felt really bad about this morning). So if you're reading this i promise to give you more the next time we are there (most likely next tuesday).  The food was delish too, grilled cheese and tomato soup and I split the bacon mac n cheese (only $6 for a big dish) it was amazing. I definitely want to try their brunch sometime.  The bar is pretty small so you wanna get there early if you are doing trivia to get a spot!  We will be back next week!!", 
    "review_date": "2014-08-20"
  }, 
  "m5ssxEA0FTwYpGKi646Rjg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lara O.", 
    "review_text": "I was drawn to this place with the promise of bacon wrapped tater tots and brunch.  I understood this is a dive bar, so I didn't expect too much. The food is cheap bar fare. There are lots of tvs showing sports and lots of frat alumni for those that enjoy those things.  The fact their cocktails lacked essential ingredients, however, is the reason I'm giving this bar a low rating.  I ordered an irish coffee that didn't have any whipped cream on top and a pisco sour that didn't have any egg whites in it. I can excuse a poorly made cocktail in a dive bar, but an incorrectly made one is where I have to draw the line.   BONUS TIP: For good cocktails nearby, check out Tony Nic's Cafe or 15 Romolo.", 
    "review_date": "2014-03-02"
  }, 
  "ww0UBHkI-XJ9_1oIdv6Uyw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Michelle S.", 
    "review_text": "Friendly service. Great food (bacon wrapped tators,! Deep fried pork buns with awesome sweet and spicy sauce!). Great drinks! Non pretentious patrons that will sing along to Whitney Houston and do push ups for shoes! What more can you ask for?", 
    "review_date": "2014-02-07"
  }, 
  "OMoBzr4FhDkk7yV8zYtmiw": {
    "user_rating": 5.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Noel M.", 
    "review_text": "I had forgotten that the 750 Restaurant no longer serves brunch so a quick look at my Yelp bookmarks in the area saved the day.  The Boardroom no longer offers bottomless mimosas but you should order the Bloody Mary anyway.  Martin quickly became one of my favorite bartenders after bragging about his mix, rightfully so too!  It complemented my bangin' Brisket Breakfast (poached eggs, brisket and potatoes swimming in au jus) quite nicely.", 
    "review_date": "2013-11-20"
  }, 
  "PbmtoKdQ_Td9Ez_WwlEZig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam S.", 
    "review_text": "Everyone has their favorite bar.  This is my favorite in SF.  Why, you ask?  Reasonably priced drinks - particularly at Happy Hour. ($4 pints - some good stuff on tap)  They introduced me to Frenet.  Excellent service.  The bartenders are super cool and take the time to get to know their customers.  The patrons are always interesting - Definitely the 25-40 (mostly male), affluent/professional but not flashy set.  There are plenty of the fratty types, but I have yet to see the obnoxious variety (I'm looking at you, Wreck Room ;) )  I've had a lot of good conversations with folks while grabbing a few pints and watching games.  Generally, there are some gals there too.  It's a good sports scene.  I go for MNF and hockey games.  One of the bartenders is a Leafs fan.  Overall, it's a relaxing place to unwind and grab a few drinks with buddies, and a good place to pop in by yourself.  And, the food.  I love tater-tots!  They've got'em.  The sandwiches are all good - I'm a big fan of their burger ($10 if you get it with Cheddar and Bacon, with a side of tots).  I've tried the Pulled Pork, and that was also terrific.  They do Bacon-Wrapped Tater-Tots, which was actually how I found out about the joint.  Yes, they're great!  Also, for Happy Hour they do $4 tots and nachos (and, I believe they make their own chips - they're good.)    I won't hold the fact that it's an ASU bar against them  ;)", 
    "review_date": "2013-11-17"
  }, 
  "NZwGgyT2BVjfWm6h-orOrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve B.", 
    "review_text": "A solid, local neighborhood bar with a great atmosphere. My go-to for 49ers football. The bar food is damn good too. I've had a burger, veggie burger, breakfast chroizo tacos, and the famous bacon-wrapped tots--all are really, really good. Solid bloody mary's as well, albeit a little pricey at $8.  Order a PBR and guess the playing card number/suit that's underneath the cap and they'll pay for your beer. I actually won the last time I was there.", 
    "review_date": "2014-11-20"
  }, 
  "iY41hl-J7Nw32spi0BalUg": {
    "user_rating": 5.0, 
    "user_location": "PORTER RANCH, CA", 
    "user_name": "Linette P.", 
    "review_text": "Was visiting San Fran for the weekend and ended up following a few guys there after Columbus Cafe ( another cools spot). They suggested we check this place out and a friend and I followed. :)  The people there were awesome and everybody looked like they just wanted to have a good time. Glad I joined! :) Oh yea and the tater tots went awesome with my beer.. Cheers!", 
    "review_date": "2013-06-10"
  }, 
  "KB6gQqzPVtHBcD40wf09pg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Crystal C.", 
    "review_text": "I have mixed emotions about The Boardroom. On the one hand, it's in North Beach, a place I love, the staff is incredibly kind, they play great music, and have lots of big TVs for ample sports viewing.   On the other hand, it smells like my college boyfriend's shared dorm apartment, ie, dirty towels and bong water, trivia night was a huge bust as the hostess was absolutley schwaaasted (like blurting out answers to trivia questions and heckling some guys in the crowd), the place is very tiny and dark, and last but not least (and at no fault of the establishment) we were infultrated by the *biggest douchebags* I have encountered in a while - seriously, they ate the better part our nachos and bacon mac n' cheese and got really angry when we told them to stop and moved our food away.  Me and the girlies started off the day yesterday in high spirits, looking forward to Dr Teeth's Tuesday Trivia / Two-for-One Maragarita deal / Two Dolla Taco fest, only to have our dreams squashed roadside after we learned that *Dr Teeth NO LONGER DOES TRIVIA* (fyi, y'all). So we had to resort to other options. Boardroom is somewhere between all of our offices, so we landed there.   Rita I and I got there waaaay before the trivia rush and planted ourselves at one of the two long tables and filled ourselves with a Margarita and a Corona ($5 each) and waited for our homegirls to grace us with their presence. I had the Fernet and Tecate deal for $6 which was pretty sweet.  Now kiddies, I welcome you to flashforward a few hours to almost trivia time. We were joined by some random menfolk from Canada who made a good impression - at first. Then they proceeded to take and eat our food and tried to justify it. Um, I hate you. Thankfully the staff saw what was happening and took the charge off our bill and put it onto theirs. The chef in the kitchen does major work - cooking and bringing everything out to the many people who order, good work!  We shared Nachos with Carne Asada ($9) which was pretty bomb, plus an order of Mac N' Cheese with Bacon ($8) which was no bueno. It was basically large elbow pasta with a watery cheese sauce and topped with nearly burned bacon bits. Sad face central. Stephanie S got the Bacon Wrapped Tater Tots aka Bac-o-Tots ($8 for five) which she said were yummy, but not a lot came in an order. Rita I had the Buffalo Wings in Island Flavor ($9), which were not particularly meaty, but had good flavor. During trivia we got all fat kid and ordered Tot-chos ($8) and they were OK, a combo of soggy and then dried out, I could probably live without them.  Anywho, I'd like to go back and try brunch. I think last night was also slightly tainted because there was a Wild Card A's v. Royals game on that went to the 12th inning, and there were way too many A's fans clogging up the joint. So that's that: I hope to be back, I hope no more awful men approach me and my friends, and I hope the staff continues to rock on.", 
    "review_date": "2014-10-01"
  }, 
  "S-eb2s_2Ec_1rcmvec-H2A": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Alanna R.", 
    "review_text": "Cool bar, BUT there are a few douchey guys that  run rampant 'round this place. I guess that could be just about any bar in SF, so I'm not hating, just saying.. I will definitely be back but I will bring friends and ignore all weirdos lol", 
    "review_date": "2014-11-17"
  }, 
  "TV1o8G-Pvk0NYt5taaeuiw": {
    "user_rating": 1.0, 
    "user_location": "Phoenix, AZ", 
    "user_name": "Tre M.", 
    "review_text": "After eating several entrees of food and enjoying a couple drinks, my friends and I were outside chatting with some other guests and my girlfriend brought me a beer while I was outside. She claimed that the bartender was cool with this. While we were outside talking, a man who claimed to be the owner happened to be walking into the bar at the same time. He stated that we could not have our drinks outside, to which we gladly obliged and brought our beverages inside. At this point the owner seemed very upset with the bartender for letting this happen. Once inside, my girlfriend went back outside to have a smoke and did not have any drinks with her. She had been outside for about 20 min and since the area is a little dark and shady, I decided to peek my head out the front door to check on her. Let me clarify, I did not set foot outside of the door I only looked outside to make sure my girlfriend was OK. At this point, the bartender very rudely asked me to give him my drink. I believe he was trying to make up for his prior mistake of letting us take the drinks outside and to look good in front of the owner. Once again, I did not put up a fight and gave him my drink and the bartender never mentioned that I was cut off or could not have another drink. About 5 minutes later, my buddy had an extra drink, which he gave to me. When the bartender saw me with another drink he proceeded to officially kick me and my whole group of friends out of the bar. My other friends asked why they were being kicked out as well and the owner claimed \"Because you are with him and I have to backup my bartender\". My friends were from outside of the area and I felt we were being treated unjustly and unfairly because we were seen as outsiders. Message to the bartender: own up to your mistakes and don't try and make up for it by being overly strict to customers, that is not a fair way to treat your business.  tl;dr: I had a terrible experience at this bar. Even though our entire group was being respectful, and under control we were told to leave. Mind you, the bartender had already received his payment for our $80 tab, which included food and drinks, when he decided to kick us out. Which I'm sure had something to do with the ease in which he kicked us out.", 
    "review_date": "2014-08-31"
  }, 
  "tcRhKVs9Tr6-7ohP3TIeaA": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Jacob W.", 
    "review_text": "Taco Tuesday is off the hook. Try the carnitas tacos. And you can never go wrong with bacon wrapped tots", 
    "review_date": "2014-10-14"
  }, 
  "WnzRueYdRWNSbkXB0_0i4Q": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Chuck N.", 
    "review_text": "A true North Beach gem. A must goto bar / food spot.  Service = excellent. The bartender I've seen twice, forgot his name (has a beard) is awesome. Big fan.  Drinks = $5 for Jameson and Ginger Ale. Cheapish shot and beer specials. Beers on tap are great (love the various IPA's).  Food = The world's best (as claimed) bacon wrapped tater tots. Pretty good. Not the thickest cut of quality bacon, but wrapped in tots with a nice mayo/ketchup mix sauce is great.! ~$9 for a small plate, bit pricey but tasty.  The burgers are big and tasty, friends shared.  I got a taco salad for $9 in a cool pho bowl and the salad and beef (you can get chicken too) were great. The taco wrap on the outside was obviously from a wrapper, but hey, can't expect a bar to fry it like a Mexican restaurant.  Big fan. I'll be back for food and drink.", 
    "review_date": "2014-07-22"
  }, 
  "9lKCs1d4AE5eOmtIpuviAA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chuck R.", 
    "review_text": "An \"ASU bar\" but don't have the PAC-12 network. ? nuff said.  This makes me sad.  #GoDevils #getthepac12networksoon", 
    "review_date": "2013-11-30"
  }, 
  "rX9yVuBgqDF-j8nxWIzonQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Curtis L.", 
    "review_text": "This is one of the best bars in SF for good, blue collar, eating and drinking. The bartender (Dom I think?) is a great dude and pours you a beer quickly. They have several TVs and they even put on the Sacramento Kings for me (which no one else cared about). If you haven't been, swing by on a Monday for 50 cent wings. They have about 20 flavors and the guy cooking them takes real pride in his wings. Bars like this are becoming rare in SF so support them when you can.", 
    "review_date": "2014-12-04"
  }, 
  "aXuxyyTDs5RGoFrhajPLYg": {
    "user_rating": 4.0, 
    "user_location": "Rowland Heights, CA", 
    "user_name": "Alexander Y.", 
    "review_text": "Needed a place for food and mimosas since we were super hungry after a successful night out.  So...bacon-wrapped tater tots?  SIGN ME UP THEN PLZ.  Surprisingly very good for a weekend brunch, especially given the dive bar nature of the place.    Surprisingly though, a very good brunch.  I would've never thought that a beef brisket with poached eggs to be so good at a place like this.  But they said the beef just came in that day, and it was fresh as hell.  Gave it a shot...man I was not disappointed.  That brisket was flavored very well, and the broth was quite tasty.  Must also mention how friendly our bartender was, made our stay that much more enjoyable!  Definitely worth coming back here for sure.", 
    "review_date": "2012-09-16"
  }, 
  "2GnEiGnw968a-h-v52mSSg": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Aaron W.", 
    "review_text": "A couple reasons why this place is great:   1) I took a girl here once and she HATED it. That's now I knew it was good. So I kicked that bitch to the curb.   2) The bartender is a cool ass dude. This is weird that I have to even say this because I feel like one of the prerequisites of being a bartender should be \"don't be a dick\", but we all know how that usually goes.   3) I like mimosas.   4) The brunch was awesome as hell. I haven't had anything bad from the brunch menu. You also got to have respect for a place where the guy cooking your food, brings it to you. So you know he wouldn't dare bring you something shitty because he has to look you in the eye.   5) I got to piss off everyone with my musical selections on the \"juke box\"", 
    "review_date": "2014-06-17"
  }, 
  "bLbSNkLggFnqwNNzzq-Ijw": {
    "user_rating": 3.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Stefany V.", 
    "review_text": "Came here with the BF and his sister when I got a hankering for some burgers- this place came up and was nearby, so off we went. Was told upfront that it was a bar that serves food rather than a burger place, specifically. Good thing too, because when we arrived there was only bar seating and we hesitated at first, thinking maybe we would not be able to eat here.  Luckily, we stayed- probably because the game was on and we didn't want to waste time finding a new spot, but the fact that wings were on special really helped, too.  Fifty cent wings on Mondays, 5pm-10pm.  We ordered a round of beers (had the hawaiian one on draft- can't remember the name, but it was light and sweet, refreshing) and a ton of food: a burger and the brisket dip to share, with sides of bac-o-tots and onion rings, plus (what amounted to) 25 wings in spicy bbq, hot, and spicy island. More on those in a minute.  Burger was just okay, dip sandwich was dry and tough and we did not finish it- very unusual for us. Bac o tots were awesome, but seemed overrated based on other reviews we read here. Onion rings were okay.  The WINGS are where it's at though- specifically the SPICY ISLAND. I could bathe myself in that sauce. It was phenomenal- I was expecting something with pineapple that's overly sweet and not usually my thing, but this one.. dude, I can't even figure out what was in it! A fresh green herb/spice was present, possibly basil? Or maybe thai basil? Overall the taste to me was more thai than island, but whatever the hell you want to call it, we ordered extras of it, and even then I was dipping my pieces in the extra sauce puddled at the bottom of our basket.  Service was good- bartender/server clearly enjoys his job and was making conversation with most at the bar. Made good food/drink recommendations. Space itself is divey, and that's okay- all the TVs were working and the food was good, so that's all that matters.  Definitely want to add that the unisex bathroom was surprisingly VERY clean, which I almost didn't expect based on the looks of this place- but the appearance is deceiving. Most dive bars have mediocre foods and questionable cleanliness- and you'll find the exact opposite here: phenomenal island wings and tidy space, from the bathroom to the bartop.", 
    "review_date": "2013-10-15"
  }, 
  "JZwZxnYdCxb8Z-DWT6H3dA": {
    "user_rating": 5.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "daniel w.", 
    "review_text": "This place is awesome!  Salvador was the bartender and he was incredibly friendly the food is delicious.   Take my advice,  ask the cook to \"get crazy\" with their Boardroom burger.   You won't be sorry.   Also,  have to heard of bacon wrapped tater tots? Because you should have.", 
    "review_date": "2014-05-02"
  }, 
  "6M9vEozgZy-uTXVKr-zXvw": {
    "user_rating": 5.0, 
    "user_location": "Fairfax, CA", 
    "user_name": "Jason G.", 
    "review_text": "Bacon wrapped tator tots !!! Surf movies and a great atmosphere  I love the boardroom", 
    "review_date": "2014-09-17"
  }, 
  "NHKJowBM-8mY2Iegfc87pQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Albertino M.", 
    "review_text": "Time: 9:07pm/59°F clear  Purpose: Needed to find a nearby bar to catch the last half of the warriors/cavaliers game without being notice alot. Didn't feel like walking around saying hi to everyone like a town mayor as I know most of the businesses nearby, just didn't feel like talking much.  Ambiance: Small neighborhood joint were the owners knows everyone by their names. Even if you don't know much about the place you will when you leave. Not much going on here it's all about locals stopping by for a drink or so. Since it's small place when there's Giant's or 49er's you will have to use a megaphone to reach someone across the room. 4-5 flatscreen spread through the place nice wooden bar counter with smooth contour groove sit about 12+ at bar if you counter the ends too. A dartboard lot's of pennants and posters articles of local teams some trophys but couldn't get close enough to read the plaque.   Staff: Guy at counter was nice greeted me how you doing? I sat down he said I've seen you around before and I answer I bet you have. We started talking about the upcoming 2014 season for the Giant's.  Cleanliness: It's a bar/restaurant type so I can't say it was clean or not as some areas maybe opposite of what a business should be, let's say I will eat here again.  Eats/Drinks: Order wings $9 and thinking about the bacon wrap tots. Not a fan of fried food but once in a while, yes. Not really sure as I was watching only second half of the game. So bartender walks off and brought me 5pcs on the house. Thank you! Quite delicious. Wash it down with speakeasy $6 including tips.  Products: Mostly finger foods that are easily made in matter of minutes, deep frying. Wings,tots,bacon wrap tots,nachos,sweet pototo fries,hummus, chips/dips,onion rings etc.  Punch Lines: Neighborhood bar,chinatown,little Italy,SFPD Central Station,parking garages,funeral home,Washington square park,fisherman wharf,cafes,italian restaurants,muni buses,post office,banks,delis,trinket shops,coit tower (closed for remodeling),Russian hill,Fairmont hotel,Mark Hopkins hotel.  Tradeoffs: A nearby friendly environment for the locals to meet up or socialized.  Final Thoughts: Don't get me wrong it's a cool place it's just the menu options and noise level is unbearable. I understand it's a sports bar too. Guy yaps on his phone probably to no one because he was to drunk to recognized there's no one on the other side. Those ghost calls can really mess you up pair with drinking. The kind that you think it's vibrating picks up phone no call inbound so you yap about your day to no one. I will come back again with my Giant's/49er's jerseys depending on sports season.", 
    "review_date": "2014-03-15"
  }, 
  "Rnfozp5HL7OTR6rbaDg64Q": {
    "user_rating": 2.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Alvin Y.", 
    "review_text": "As charming and friendly the bartender was, as much as I tried to like this place, The Boardroom is not recommended for breakfast.   The breakfast foods are average at best. Major complaints at my table were the dry biscuits and too many salty beans in the breakfast burritos.  However we did really like the $14 pitchers of mimosas.", 
    "review_date": "2013-10-23"
  }
}