{
  "5Z-3tcM07Pyc4mOF2Rjt6Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy G.", 
    "review_text": "Delicious, but overpriced.  That is all.", 
    "review_date": "2013-10-28"
  }, 
  "CU_q-P-eEaMC12xrDvOdhA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Matt T.", 
    "review_text": "I walk by here on my way to the parking garage around the corner and finally decided to stop by for lunch one day. Yes, their \"big ass burgers\" are definitely that. I came here hungry around 2 pm and saw the ad. didn't quite believe it. My coworker and I each ordered a burger, fries, drinks. Yea, we couldn't move after wolfing down the food. So good.  They also have an awesome happy hour. This place is always bumping. Lots of space, board games, billiards, people. It's great. And sometimes there's \"mystery\" shots for $3. Haha! Who can say no to that?!", 
    "review_date": "2013-10-20"
  }, 
  "XDIJZGOqPkv2Sp6mpkyhFg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elisha A.", 
    "review_text": "A great place for friends with cute nooks. Great beers on tap!", 
    "review_date": "2013-11-26"
  }, 
  "xfO5UNKaPQiakpcYOrrQgQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lillian C.", 
    "review_text": "I came here with a friend for a late lunch/ early dinner. I ordered a burger and a Sweet tea drink. The burger was similar to regular bar food and the drink was mediocre. The bartender was very chill and seemed like he could only handle one order at a time (we had to order the drink and food separately each time.  This bar is somewhat divey and chill. They offer a few board games, arcade games and pool if people are interested in them. There's lots of space and 3 rooms/areas for people to hang.   I wasn't particularly impressed by their food or their drinks, hence the 3 stars. However, I really like the relaxed atmosphere and would come here again to play board games with friends.", 
    "review_date": "2014-04-15"
  }, 
  "JG2-Z87cVoVQRiCaTtc7jw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison S.", 
    "review_text": "Really enjoyed my visit here. Food was good, drinks were cheap, price was right. Big, comfortable space, plenty of room to spread out and play games in. I'll be back whenever I'm hanging around later in SOMA.", 
    "review_date": "2014-01-27"
  }, 
  "Sg57jIu1D7s9jTQy94xo6A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natasha E.", 
    "review_text": "Great burgers and fries! Wasn't expecting a that from a bar. Great vibes came and had lunch with a coworker and played cards a after.", 
    "review_date": "2014-11-25"
  }, 
  "u-Ii6mpA0jmMGdYXuyjMvg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe W.", 
    "review_text": "We LOVE The Willows.  It is a great beer bar, dive bar, neighborhood bar.  It is anything but pretentious and achieves everything it aims to be.  With that said, let's be clear:  The Willows sits in the western end of SoMa.  It is a bar where you can hang out, play pool, play cards, eat great bar food, drink exquisite beer.  It is NOT a pick-up joint.  It is NOT a place to come and flaunt your latest app.  It is NOT a place to flaunt yourself or your wares.  LOVE this bar because the staff is relaxed, yet completely dedicated.  There is a craft beer side of the bar with about 12-14 taps and some nice bottles (for in-bar consumption).  Excellent tap choices, usually focused on West Coast offerings, but their ability to obtain unusual beers from the East Coast (especially Maine) is impressive.  Obviously, one of the owners has a special \"in\" with several local breweries because this bar occasionally taps a keg that is only available at Willows, or at its sister bar, The Sycamore.  They also have macrobrews in bottles for those who drink bad beer (blech ... Why those folks even bother to wake up in the morning, I'll never know).    The pub menu is perfect for those who have no guilt about what they will eat while imbibing.  On a diet? This isn't the bar menu for you.  Are you a hedonist?  You have hit the jackpot, buddy, because they grill their sandwich bread in BUTTER before slapping on the meat.  The OMFC is a hamburger served inside two grilled cheese sandwiches.  Jackpot.  Seriously.  I haven't spent much time at the non-craft beer side, but I do see they have a full bar and lots of drink specials.  That room is much larger, with tables, gaming areas, pool tables and a large standing 'share' table.  Let's also be joyous of the fact that this was one of the first bars in SF to ban Google glasses.  Keep the glassholes away!  Thank you, Willows!    I highly recommend this bar to folks who live in SoMa and the Mission.  It's very reminiscent of the way SF used to be.  And I love that.", 
    "review_date": "2014-08-09"
  }, 
  "gvqZ_yjW6Xu8CLHN339ixg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matthew G.", 
    "review_text": "Good beer selection.  Happy hour food selections are limited, and though the price is good, they make up for it in smallish portions.  If you're hungry, just order off the regular menu.  Watch out on your bill -- I ordered a happy hour slider combo that supposedly came with fries.  They forgot the fries, and when I pointed it out, they brought the missing fries, but charged me.  It's not worth fighting over $1.75, but I probably won't be going back, either.", 
    "review_date": "2013-11-25"
  }, 
  "F9yf6eFZMyt0rPgjLFrHCw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Matt Y.", 
    "review_text": "This bar just opened about six blocks from me, and it might be a new favorite.  Pool table, board games, jukebox, and lots of large tables.  Really chill and fun vibe.  There's also two bars, one that's a fully stocked cocktail bar, and the other that deals only in craft beers.  I've never had a cocktail, but the craft beer selection is a lot of fun -- I'm no beer connoisseur, but I get a kick out of trying lots of random new beers.  The food is also pretty good, as should be expected from the team at The Sycamore in the Mission.  Burger and fries were excellent.  Service was great.  The bartender, an older guy with glasses, was friendly without being chatty.  They did forget my friend's burger, but apologized profusely, brought me out a new plate of fries, and bought us a round of beers.  Can't really stay mad after that.  :)", 
    "review_date": "2013-07-31"
  }, 
  "WSgB_eQK5p5kPjyLQ4YT-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dominic P.", 
    "review_text": "Gave the pork belly donuts a try and they were pretty great. I loved the added sea salt on top.  It complimented to maple syrup perfectly.  I also tried the veggie pitta pizza and the fried mac and cheese balls. The pizza had tried tomatoes, artichoke hearts and a killer balsamic vinegarette. The mac and cheese balls were typical not the worst not the best. The Willows is a pretty cool dive bar. Main bar area has some classic arcade games and pool table. Music was playing and the majority of people were in this room. There's also a back room, which on this particular day was the quite room. Less crowded and the music wasn't blasting back there. Had some nice private booths built into the walls.   I'd totally come back here just for some of their food.", 
    "review_date": "2014-03-07"
  }, 
  "Ow_oHwqaBBRuUAiNrL8rRw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susie S.", 
    "review_text": "Checked this place out for a bite. Still looks like \"Hamburger Mary's they even have the same bar and the space is really the same. Pinball Machines in the back and tables were the always were.  Had the Burger ( a tribute to Mary) good burger, but don't expect the Mary Burger.  The place is airy, relaxed casual and comfy. Met the owner , former USF staff and student.  Gets loud but really laid back. Will go back , friendly staff. Check it out, you will get nostalgic for Mary's or Cissy's Salon.", 
    "review_date": "2013-08-29"
  }, 
  "2ENfLnZRVCjeoG5i0vGZjg": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Mariana S.", 
    "review_text": "It's hard yo find decent vegetarian burgers but the black beans burger was awesome! Great beers and great food at a great location!", 
    "review_date": "2013-09-14"
  }, 
  "f9xHtDot9Yjqalc1x_8-0g": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "William C.", 
    "review_text": "Great all around venue  Brunch, Drinks, Lunch, Dinner, video games, pin ball, and much, much more. I blew five hours in here like it was nothing.  Count me in every time I'm invited (oh, and happen to be in SF.)", 
    "review_date": "2014-02-17"
  }, 
  "f2_ORdto2MUlxp6-LlmKgg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Trav M.", 
    "review_text": "Nice joint. Decently priced. Attentive staff. All the things that make a bar great can be found at The Willows, the sister of The Mission neighborhood's The Sycamore. A few things I like about this place:  - The Beer Bar: You can find some great brews here, including the super exclusive Speakeasy XXX Triple IPA. With a 12.5% ABV, don't drink this guy on an empty stomach  - Space! The venue is very spacey and the huge windows in the main area are a great touch as well. Note this place also has board games, pinball machines and a pool table. There are some really cute intimate booths to the side which I love sitting at  - Food: Great food. Pork Belly Donuts are LEGIT. Truth.", 
    "review_date": "2013-08-08"
  }, 
  "7JaPfN1PERmkbCHOaBjw9g": {
    "user_rating": 5.0, 
    "user_location": "Noe Valley, San Francisco, CA", 
    "user_name": "Erin L.", 
    "review_text": "I am so so so excited that The Willows is finally open!    As a long-time Sycamore fan, the temptation of a new bar by Liz, Trista, and Tym was too great to resist. I had my birthday party there and it was the perfect place for it: tons of space, amazing staff, delicious food, games for days, and all my guests were raving about how much they loved the bar.   Dark burnt wood walls flicker with candlelight, beautiful nooks tuck you away for more private conversations, a gorgeous craft beer bar with wrought iron details... PLUS a pool table, Buckhunter, pinball, board games AND Cards Against Humanity?? Not to mention the food (fried chicken! sloppy joes!) and specialty drinks (the Tish!)... I daresay, I think I've found my next local bar.   See you there.", 
    "review_date": "2013-06-19"
  }, 
  "fNnp8NuLuPauJXXTnz8rbQ": {
    "user_rating": 4.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "XiaoChuan Y.", 
    "review_text": "Enjoyed their trivia night which was very fun. Tried the \"lava challenge\" flavour of their wings, only ate 6 and my stomach was not happy for the night, but I don't regret it.", 
    "review_date": "2014-01-18"
  }, 
  "2Qfa3o72sq04_MCUxy3Shg": {
    "user_rating": 2.0, 
    "user_location": "Costa Mesa, CA", 
    "user_name": "Emily D.", 
    "review_text": "....This place screams 1800s hipster steam punk.   I ordered a signature drink, which... the bartender didn't know how to make, served with a side of sass (thanks but... you wanna be sassy? gGo to Zeitgeist and give me all the sass you want - at least there I'll get my drink made properly.)   Crowd seemed older, prices were eh, and there are just so many better bars to go to... not a fan.", 
    "review_date": "2013-07-11"
  }, 
  "o5STsEtfvD1Ig0J7Z-1uxA": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Alex L.", 
    "review_text": "A warm and friendly little gathering spot in SoMa. I stopped in for an evening of booze, burgers and brains (trivia) with some co-workers and was overall very impressed.   What excited me the most was two-fold. First, the separate bar specializing in craft beers featured a fantastic selection, making for some satisfactory head nods with every new brew I ordered. Second, I love their menu, which had me salivating before ever trying the food. I settled on a DIY burger which comes with lettuce, vine ripe tomato, pickles and mayo. I added some cheddar and caramelized onions. For some reason I thought this would be just another bar where the menu was too clever and health-oriented for its own good, but the burger, like everything else, was clearly designed for someone who loves flavor over concerns about getting fat.   The only downside was the service. We sat at our table for what must have been 30 minutes before figuring out ourselves that our orders must be placed at the bar. The waiter pretty much ignored us except when bringing out food, and even then he had no idea who ordered what. I ordered my burger with the salt and pepper fries but got regular ones, though they were still damn tasty.   Tip: Be sure to stop in for trivia Wednesday nights after 7 pm. We scored second place!", 
    "review_date": "2013-11-18"
  }, 
  "AOFDB60pjiXby08lx5HHYQ": {
    "user_rating": 3.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Lisa T.", 
    "review_text": "The strictly work burger was very good. The beet salad was ok, just wish the beets were fresher. Great selection of sour beers here. I really liked the Monk cafe Flemish sour ale, however they're all bottled. Wish they had more draft craft beers. Place has more of a divey feel. There's a pool table and a bunch of old school games like pin ball. Good place if you just want to meet with friends for beers.", 
    "review_date": "2014-03-01"
  }, 
  "AVSylpAISyFs1cDryDpskQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathryn C.", 
    "review_text": "Went here on a Friday night.  Good vibe -- fun, but not too crowded.  Good place for friends to hang out.  The bartender was very friendly and recommended a good beer (Ommegang Witte) based on my liking Hoegaarden -- well priced!  $6!  The music can be a bit loud if you're looking to chat / catch up with friends, but generally quite a convivial space! Great place to grab a drink and hang out with friends!", 
    "review_date": "2014-07-26"
  }, 
  "hZRDW7lFIO3ZRMIxLtvtoA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Stephani M.", 
    "review_text": "#7 I had such a great time at the Willows!  My friend and I were in the city visiting a BFF of mine, David, and we were all super hungry.  David suggested the Willows, I love it, but my other friend had not been before--but he was hungry and really did not care, \"Just feed me,\" he said.    We walked one block to the tavern.  They were really crowded but we found three unoccupied stools.  The bartender came right over to greet us, placing bev naps in front of us and offering beverages, starters, etc.  He also handed us some food menus so we could figure out how to solve our hunger problem while we waited for our drinks.    I decided on a black bean burger--one of the BEST I have ever had!  David grabbed a basket of salt and pepper fries and our other friend ordered some mozzarella sticks.    The black bean burger was so delicious, and every bite was exquisite.  (I am getting hungry right now thinking about it!). It was served with a tiny little salad on the side which complimented the burger perfectly.  The salt and pepper fries were crispy and amazing.  Sometimes, a huge basket of fries is kinda good, some burned and some soggy--not at the Willows--every fry was crispy, salty and peppery...yummie!  The fried mozzarella sticks were terrific as well.  Crispy and full of melted mozzarella.  They were exceptionally large for cheese sticks too.    Needless to say, after all that food we were extremely full, almost to the point of being uncomfortable!  We played Trivia Crack at the bar and while there is no reason to embarrass anyone--I killed it!!!  The service was wonderful.  The food was marvelous.  The drinks were great.  No complaints whatsoever.  We had a really great time just visiting and playing games.    Stephani Smiles for The Willows ;)", 
    "review_date": "2015-01-06"
  }, 
  "knReN1F-2WbpQzyhElvnYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Margaret I.", 
    "review_text": "Every time I visit the Willows I love it more.  Two bars, with two different/relaxing rooms.  I actually prefer to sit on the craft beer side because it typically seems less crowded, plus I like the little cubby hole booths.    Service has always been stellar.  Everyone there obviously loves their job.  Great selection of food, whether you're ordering small bites or a full meal everything is pretty yummy.  I haven't tried brunch yet, but I'm very excited about it.  Over all this place is great! I wish it was a little closer to my house!", 
    "review_date": "2014-11-05"
  }, 
  "o2O7Rwwenfz46CRwf5qPeA": {
    "user_rating": 5.0, 
    "user_location": "Rocklin, CA", 
    "user_name": "Phillip M.", 
    "review_text": "Amazing burgers!!! I'm from scaramento and its a far drive but I'm definitely coming back here again!!!!", 
    "review_date": "2014-11-23"
  }, 
  "HopOscI5oTIQs_Xku92SMg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "KA K.", 
    "review_text": "The concept is cool: one bar for cocktails and then a bar for craft beer. However, the one time I went it was nearly impossible to order a drink from the beer side. The one bartender blamed it on lack of a second person, which I was fine with. But, when the second bartender came on it was no easier to get a drink. This was a slow Sunday early evening and there were maybe twenty people in the whole bar.  The food was pretty good. Cheaper than most places for a basket of fries and a sandwich. My partner got the sloppy joe and I got the pulled pork. Both just a bit above average and could really be quite exceptional if the bun quality was just a bit better. The fries were well seasoned with salt and pepper. Satisfying with beer, so I was happy.  Pork belly \"donuts\" were really disgusting and I love eating crap like this. First of all, they are not donuts. They are battered chunks of pork, fried and then put into a pool of syrup. They were also really over salted with big chunks of salt.  Tap list is a nice mix of imported and domestic beer, I am always pleased with a few things that pop up there weekly and have gone out of my way to come here to try some of them.  The board games are fun and on a slow day, it's a nice place to bring a few friends and throw a few back. Though, hands down... I'd rather be in a cramped The Sycamore than in a comfortable The Willows.", 
    "review_date": "2013-07-24"
  }, 
  "daYV5IBz88PVLDifv32Epg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe S.", 
    "review_text": "This bar is so new that they don't even have a sign yet -- it took me a couple minutes to find the door to get in!  That said, it seems like an excellent bar! There are two rooms -- the front room has a bar with a great selection of beers on tap, and the back room has a full bar with delicious cocktails.  The bar is nice and spacious, good for groups. They even have a pool table, which all too few bars in the city do.  I didn't get a chance to try the food, but it looked tasty.", 
    "review_date": "2013-06-20"
  }, 
  "Kr9sA9gKISX5i8WN4_nXcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "George M.", 
    "review_text": "I'm not sure what this place is like during regular nights, but I went here for a SF Beer Club event where they had beers from Oregon and the selection was great. Bartender was on top of it and veery helpful if you didn't know much about the individual brews. Food was really good...I got their black bean burger and it was surprisingly delicious.", 
    "review_date": "2014-07-19"
  }, 
  "nbf64GRke8rhnYqoeUzjWw": {
    "user_rating": 1.0, 
    "user_location": "Jersey City, NJ", 
    "user_name": "heidiologies g.", 
    "review_text": "Dear Willows owner &amp; staff: it was totally unnecessary to lie to our group of 30 tonight to get our business. We would have stayed to eat, drink, play pool and board games, and generally be merry anyway. But telling us every 30 minutes that the pork belly donuts would be \"ready in one hour\" every 30 minutes, and finally that \"they would be ready at 9:30\" is just infuriating. We dropped quite a bit of money in 4.5 hours, but sadly none of us will ever go back. Way to lose our business!", 
    "review_date": "2013-12-28"
  }, 
  "i2KocsDcufoW5PNi_1LJnQ": {
    "user_rating": 3.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Dan M.", 
    "review_text": "Digging the burgers here. Looks like a non-descript bar outside, but inside, it's a large space that has food and a good selection of beers...crafts on one side, regular bottles (not that many draughts) on the other. Juicy Floozy burger was tasty, but the burger had too much sauce on it, causing my bottom bun to deteriorate rather fast, and I was eating it open faced after a few bites. Working Stiff was a little easier to eat, and I'm always a fan of burgers with jalapenos on it. To save money (beers are a tad pricey, even for bottles), I went with a High Life with my food. On the other side, went Belgian, which I always enjoy. The bartenders are extremely nice and accommodating, which always rocks. Just bring some extra money, this isn't your run-of-the-mill dive bar. Also bring quarters for pinball in the back.", 
    "review_date": "2014-03-05"
  }, 
  "yTnUHQ76cfZyk0ryD2RLtg": {
    "user_rating": 4.0, 
    "user_location": "Stanford, CA", 
    "user_name": "Helen H.", 
    "review_text": "Since I did not plan ahead, me and my boyfriend decided to go to the Willows for the New Year's celebration instead of going to a club.   I bought the New Year's tickets online, the day of, and had no problem getting in.   We got beef sliders with fries and I thought both were divine! However, the bartender did not have any mint, so no mojitos for me :( Also, since it was pretty busy the service was slow.   The New Year's deal included sliders, campaign toast at midnight, as well as other drink specials. The fruit punch was one of the specials, but it was just ok, not much alcohol there :P   I guess my biggest frustration was the music - some weird indie stuff. The dj seemed to be the only one digging her own music :P I was hoping for something to dance to, but it was simply impossible. No one else was dancing either...   Anyway, I would like to come back there on a regular day :)  PS. I loved party hats and glasses provided by the venue", 
    "review_date": "2015-01-08"
  }, 
  "djxnI8Ux8ZYQJhiOQkrRhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby S.", 
    "review_text": "Come for drinks and food during happy hour, sticking around to participate in trivia is questionable.  Per a recommendation of a co-worker, a group of four headed to The Willows after work on Wednesday. On our minds? Beer, a stiff cocktail, and non-healthy food. The Willows meets all of these requirements AND plays some pretty awesome music while you wait.  The good: + Two bars! One serving craft beer and another with the hard stuff. + Fried mac 'n' cheese balls - way better than the stuff you have at TGI Friday's! + Mix 'n' match sliders, go for the fried chicken. + Comfy seating, good for smaller groups. + Pool table and board games handy for those who need to be entertained.   Not so good: + Trivia - we were temped to stick around and give it a go, as the four of us were truly intrigued. Not terribly impressed with the questions, the other players, and how it's managed. And no, we're not hardcore trivia buffs by any means, just like to play a fair game with a host who doesn't seem so scattered.  Overall, The Willows is a great new hangout in SoMa and I hope they stick around!", 
    "review_date": "2013-11-19"
  }, 
  "5gbkhlWANGVzQYi_0m3vOQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess C.", 
    "review_text": "Pork belly donuts?!!! I was intrigued. These donuts are really battered chunks of fatty pork belly, in theory delicious but actually lacking in seasoning.   The chili cheese fries were pretty good but again nothing special.   They have a happy hour which ends at 7pm (not bad!) but even without the discount the prices are very reasonable. Note they have 2 sections of the restaurant, one serves beer wine and food and the other side serves cocktails. Order on the right side, get a number and find a table.   Enjoy!", 
    "review_date": "2013-12-13"
  }, 
  "MYg44ZF2rr2NE89fM5JgaA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Twee L.", 
    "review_text": "We heard good things about this place but the service was awful. The bartender took 25 minutes to take our order and it was only 7pm and it wasn't even crowded! Then we all ordered food and they were out of about half of the menu. Really? At 7pm?? Get yourself together, Willows.", 
    "review_date": "2014-05-07"
  }, 
  "Z1MwRLOuNnVBXqFd9F09pQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victor H.", 
    "review_text": "With bartenders like the ones found at Willows and progressive owners like Tim, the winds of change are upon the Willows and all of downtown for that matter.  Great bar!", 
    "review_date": "2013-12-16"
  }, 
  "vJ7GOtIzgSm7lUquqGSCtA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed S.", 
    "review_text": "Stopped by for a bite to eat late Saturday afternoon. I came in as I saw the pictures on Yelp and wanted to try the food. However when we sat down the only menu available was the brunch menu and there was NO way of ordering from the other menu that was set to start in 30 minutes....We were hungry so we ordered. The pork belly doughnuts were AMAZING! The rest of our order was MEH, whatever. I still want to try the dinner menu so I might go back, however I will not go for brunch again.", 
    "review_date": "2014-11-17"
  }, 
  "jxH0_5WiALvMyXSXkyPKSw": {
    "user_rating": 5.0, 
    "user_location": "Outer Sunset, San Francisco, CA", 
    "user_name": "Hao B.", 
    "review_text": "Came here for a gathering and was fun! The place is located at the corner of folsom and 11th, close to couple of other bars nearby and has plenty of windows. Going in, there's two different bar area, and best of all, happy hour from 4-7pm!! I got a pbr for just 2$ of course i had to tip, so equates to 4$ a beer, awesomeness! They also have small bites and a pool table in there. Not only that, but also card games, how cool is that? Great place to socialize, drink and play!", 
    "review_date": "2014-01-08"
  }, 
  "P0gnA1aeRHlfqSjrbC5TOg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz R.", 
    "review_text": "My last meal there was the OMFC burger, which actually blew my mind it was so yummy. I ordered it in part for the ridiculous factor, and then promptly devoured it.  I am also a fan of the FU Grandpa cocktail, and the just-announced ban on Google recording devices.  Thank you for that.  And to anyone who choses to be offended by Cards Against Humanity, I say that you are missing the point &amp; need to consider that it is the very transgression that makes it such an entertaining and fun game to play.", 
    "review_date": "2014-03-04"
  }, 
  "2xb2kHnC-mFhtGggWBhZFQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krista L.", 
    "review_text": "So happy to see hooks under every seat at the bar and at the high tables!  Boasting a full bar and a tasty menu, the Willows is a great spot for a wide audience (some of whom may or may not be your cup of tea), whether you're killing time before a show at Slim's or DNA, or just hanging out.   Order everything at either bar, take a number to your seat and they'll bring the food. If I'm ravenous I get the pulled pork sandwich; for a medium appetite, a couple of sliders will do (my top 3: lamb, fish, and fried chicken w/ tomatoes), or the chicken salad (the low-carb version of the sliders).   Granted, I found out about this place from their (smaller, beer-only) sister bar, the Sycamore, but I don't think I can call myself too biased if I only got to know them from being a regular customer over the last couple years. Run by good people with good hearts (and good taste in music), and in my book that's pretty great.", 
    "review_date": "2014-05-05"
  }, 
  "bA6sFAZTIc5ddwpnB_WJUw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gil S.", 
    "review_text": "Got to say, the concept works. Turning an old building into a comfy bar, with games, food, cubbies, friendly bartenders, well-made drinks, rare beers, a serious kitchen with mostly meat and hamburgers but some salads. I mean, people are taking things to new levels these days. The lighting is nice, the flooring, decoration. I feel like the old guy who had to tell the kids he walked five miles to go to school. Back in my day, you were lucky if they cracked open a Rolling Rock -- though that used to cost about seventy five cents. Today, just around the corner there is a bar with sincere (crazy, alternative lifestyle) people who will cater to your five senses and then some.  Anyway, if you are looking to adopt a bar like some people adopt a puppy, this could be your go-to place.", 
    "review_date": "2013-10-23"
  }, 
  "D01KrKs9izEdoT0Eh4i4rQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dipesh G.", 
    "review_text": "Situation: - Almanac tasting on a Thursday evening  Pros: - Great service - Great beer options - Nice decor - Takes credit cards - Awesome Happy Hour  Overall I just had gone for happy hour, but I'd definitely go back and perhaps try the food this time around.", 
    "review_date": "2014-01-18"
  }, 
  "JycHzRPyWcAWeUrt5pPKgQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mr. X.", 
    "review_text": "I LOVE this place. The drinks, food, and music are all awesome. The pork belly doughnuts are a must-try. There are two bars in the space. One serves craft beer. The other serves cocktails and mixed drinks (and limited beer selection). I actually really like this set-up especially since the two rooms have slightly different vibes. The people here are great.", 
    "review_date": "2015-01-15"
  }, 
  "K3naoshUG8fYZ2XncMSSrw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justine K.", 
    "review_text": "Had a really great time here. The food was excellent and the beer selection good; although they were out of what I wanted the bartender suggested a few good alternates and let me taste until I decided. Also, any bar with a great selection of board games definitely gets my vote!", 
    "review_date": "2014-02-13"
  }, 
  "nd1Z0OCN5H6BaEr77HMLuA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "vlad k.", 
    "review_text": "i really wanted to like this place.. but the service was just so incredibly shitty.  with only 2 or 3 people trying to get drinks at a time, and two bartenders, we still had to wait 20ish minutes each time for a drink.  and the bartenders weren't even making drinks... just pouring beers!!  yet, they were so clueless that they had no idea who's turn it was to order, how long people had been waiting, or anything else.  they consistently served people that had just walked up to the bar, though we had been already waiting for ages.  we practically had to beg them to get drinks, and then again had to ask multiple times to close out our tab.  i've been to *a lot* of bars in my time... bars that are insanely busy, crowded and jam packed w/ people, and yet every time i still had better service than i had here w/ a nearly empty bar.  ugh!", 
    "review_date": "2013-07-20"
  }, 
  "-PoCbyNa4xc4yvReuj5pqw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Poppy C.", 
    "review_text": "Had the best time here. Craft beer room, full bar room with pool table, board games, jukebox and very very tasty food. Beef sandwich did not disappoint. Seasonal cocktail hilarious and delicious. Pork belly donuts slightly misnamed...but yummy. Bathroom looks like a dive but has auto flush and self dispensing soap.", 
    "review_date": "2013-07-30"
  }, 
  "1_WCnEFLFI6igUYtwbCbTw": {
    "user_rating": 5.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Jon K.", 
    "review_text": "Craft Beers and Cocktails. Board games. Pinball. Put those all together and you've got a recipe for an awesome hangout spot at the Willows!  Stepping into the Willows you are greeted almost immediately with a sign listing all their craft beers in their first room. Craft brews from as far reaches as Portland, Maine or as closely hidden as Santa Rosa they have great tasting brews from near and far reaches of the country! My personal favorite is the Allagash Curieux- this bourbon barrel aged ale seems to fit so well with the decor- it just works!  The second room is what my friends and I call the fun and games room! Why? Because the room is set up for as stated earlier- fun and games! There are huge tables with ample seats where those who come in for a drink can also grab some of their favorite board games to test their skills with their friends! To top it all off there's a bar in this room just 10 feet from the board games! So you can hang out and share a tasty drink in the front room or you can take it to the second room and test your wit and creativity with Cards against Humanity (my personal favorite game because I do better when I get more drinks from the bar in me; win -win!).   Lastly, what could make a night better than some good beer, cocktails, and board games? The delicious food! A must have any time I visit is their infamous Pork Belly \"Donuts\"/beignets- warm dough and pork never tasted so good while glazed over with maple bourbon syrup! Other favorites include their fried mac and cheese balls and the simple yet savory salt and pepper fries.   Before you finish the night off, remember to check out their pinball room since next to the board game room. I'm not sure why, but every time I go, I am compelled to play a round or two... when was the last time most of us can remember play pinball? Exactly.   The Willows is definitely a great place to unwind and hangout with your friends over some nice drinks and board game competition-friendly of course! Loser buys the next round!", 
    "review_date": "2013-10-03"
  }, 
  "HdpYBRA3ATInWmkw0Znssg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bob B.", 
    "review_text": "Excited about coming to the new bar that is a sister of the Sycamore. I asked for their specialty drink, and the bartender was not too informed and it wasn't great. I use to go frequently to the Sycamore about a year ago and loved their food so I had high hopes for their new place, but it was awful. Service was slow. Food not tasty. Somehow they are really missing something in this new place that I loved in the Sycamore. I'll never return. Too bad.", 
    "review_date": "2013-07-27"
  }, 
  "HzvtsyFgdEAfwAIxcN63MA": {
    "user_rating": 3.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Elizabeth H.", 
    "review_text": "Chose this place to meet up with some friends to play board games because 1. they have their own and 2. it`s close enough to the Caltrain so that we could walk. I like that the place is sort of split into two, with two bars, but it`s a little too loud to play board games in. I don`t know why I expected it not to be, when I drink, I apparently lose all ability to speak at a reasonable volume. However, the side where the board games and pool table are is louder than the other side, so we just took the games to the quieter side [ which has nice, cushy booths, so it`s even better.] There`s a pretty selection of games to choose from, I just wish that they maintained it better, because most of the ones we tried that came with paper/charts were filled by other people. A few things were also missing from the boxes, here and there. I had a sweet tea drink [alcoholic] and it was really good - not too sweet, which is perfect for me, but if you see the name and get it in hopes that it`s like McDonald's sweet tea or something, it`s not.   3 stars for now, but if I come back sometime, I`d like to try some of the food, and then maybe I`ll add another star. Or take another one away, who knows.", 
    "review_date": "2014-03-19"
  }, 
  "qqp3dB1GMk5iwM0_KvYrxg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephen C.", 
    "review_text": "Great bar with great beer and a great atmosphere. The front room has a nice selection of craft beer that is constantly changing. The back room has a full bar and a number of board games for any and all to play, as well as pinball machines, pool table and a jukebox. It's never too crowded whenever I've been on weekend nights and just a great place to hang out and get a drink.", 
    "review_date": "2013-12-07"
  }, 
  "tpxvkXi71_nMkTyynnAe4g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanna R.", 
    "review_text": "Love The Sycamore so could only expect imagine good things. I wasn't disappointed. I totally love this new place AND it's closer to my house. Great staff, yummy food, drinks to quench your thirst and a ton of games to boot. What's not to like?", 
    "review_date": "2013-07-10"
  }, 
  "kNIWlxpEekeDgGjLMBC9tg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nic E.", 
    "review_text": "I've found a new favorite drink/food spot! We happened to be here on trivia night. Unfortunately I didn't participate, but I wish I had! The trivia seemed so easy! Great mix of questions, too. The bartenders rocked, the little private tables in the coves are great and the food was sooo delicious. I will be back for sure!", 
    "review_date": "2014-09-07"
  }, 
  "gytFjzBw-z5LZD-6JSMChg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeremy R.", 
    "review_text": "Pinball ... Board games and good food.  What else could you ask for? My only complaint is that the portions aren't that large but still awesome and delicious.", 
    "review_date": "2014-01-08"
  }, 
  "TmDaYip-8qSuSIMtYW872Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johanna L.", 
    "review_text": "Living near by, I've been waiting for something to open up in this space where The Mercury Lounge formerly inhabited. It was about 3 weeks ago when the bf and I walked by and noticed there were some renovations going on - arcade additions, new tables, etc. The other night after leaving Izakaya House we decided to stop by.  Immediately walking in, I noticed the bartender from The Sycamore and mentioned it to my bf. There is a larger area along 12th Street, but the entrance is on Folsom, FYI, with a smaller seating area. We walked through to the main room and sat down at the bar. We ended up speaking to Liz and while I was taking a phone call, I came back to find out that Liz and her brother also own The Sycamore - duh!   Glad to see another local spot open up that has food and liquor. Hope they do well - please get your hours up on Yelp!", 
    "review_date": "2013-06-25"
  }, 
  "IRyxc0zeYs8hGHgE16CqMg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K. E.", 
    "review_text": "I have been vegetarian for ten years. Tonight I ordered a veggie sloppy joe at The Willows. I was served a beef one. The server said, \"veggie sloppy joe?\" as he served it to me, so I did not think there could be a mistake. I ate about a third of it before realizing (I initially assumed it was boca meat). When I stopped a server and asked if my meal was veggie because it seemed suspect, he was like \"No, that's meat. Oh, did you order veggie?\" as if it was no big deal. I'm really upset. I have been throwing up for the past 20 minutes. They did not really care. They refunded me my eight bucks as if that makes it okay. Disgusted by this business's lack of care or respect toward their customers. I literally live less than a block away. I will never set foot in this establishment ever again. If you are vegetarian and actually care about remaining so, avoid these shitty people at all costs.", 
    "review_date": "2014-10-24"
  }, 
  "H8Z0JvYiMcel1YqDAvSIpw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris R.", 
    "review_text": "Worst service I've ever had. You have to do everything through the bartender. So you have to compete for his attention and wait while he does shots. He charged me and gave me a number, but never put the order in. After waiting half an hour I asked the bartender about our food. That's when he finally put our order in.   Once it arrived the aioli was missing. I told the guy who brought our food and he said that he didn't know. I showed him the menu which says it comes with aioli. He said he didn't know and walked away. Had to talk to  bartender again. He did bring the aioli quickly after that.   Also, they were out of wings.", 
    "review_date": "2014-06-01"
  }, 
  "iBWdEgj_FqdBB9tU_xlaJw": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Laura B.", 
    "review_text": "Great place to hangout with friends.  The beer selection is amazing, and apparently they switch out the beers one by one when the keg is done, so there will always be another beer to try.   There are two bars and two rooms.  The bathroom was clean.  Parking was not a problem. Trista was a fabulous hostess and treated us like royalty.  I like the game tournaments,  art shows, Oktoberfest, board games, and FOOD. The crowd was friendly.   I was the oldest person there,  but I didn't feel out of place.  Check it out, you'll be pleasantly surprised.", 
    "review_date": "2013-09-21"
  }, 
  "W73g9rMm2j21iTQWig3mLQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alison M.", 
    "review_text": "Great bar with delicious bar food and wonderful service! Lots of seating, pool table, buck hunter (really!) and tons of board games. Two bars - full bar and a craft beer bar! And delicious reasonably priced food. Friendly staff. Will definitely be back!", 
    "review_date": "2014-06-17"
  }, 
  "gdTAebkameev_DQq_NCZzw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine W.", 
    "review_text": "This is the sister bar to the sycamore out in the mission so it has that same great decor and feel to it. Seems like they have more room here.   I love the pork belly donuts and so a couple of my friends and I stopped in for a beer and the donuts specifically. The beer selection is similar to the sycamore so you can't go wrong with that. The pork belly donuts with that makers mark maple glaze is divine!   This is a great place to grab a couple of beers and hang out/ catch up with some buddies.  They have a separate section which has a poll table and a couple of pinball games so there's lots to keep u entertained!  One thing was that the women's bathroom was out of order when I was there. They put caution tape all around the door and had a note that said hell inside do not open or anything. Hopefully they've fixed this? The guys bathroom was pretty clean though :)", 
    "review_date": "2014-05-11"
  }, 
  "2mIygxYYhxoH16nTXntR4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessie'sGirl m.", 
    "review_text": "Having a slow Sunday getting out of bed?  Last night's party left you with an appetite that demands RIGHT NOW but you dread the idea of battling the Sunday brunch crowds?  Willows saves the day with this dilemma-  not only is parking a breeze (take that Mission!), but the food service starts at 1pm on Sundays.  Perfect for brunching on little sliders and a bloody mary!  And really- bring your friends.  You can play Cards Against Humanity while your brain wakes up and you wait for your food.", 
    "review_date": "2013-09-23"
  }, 
  "VQESTHHrsXcBanqZK5kxqw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Renee M.", 
    "review_text": "I went there last weekend for the first time and loved it!  They have a separate craft beer bar and then the fully stocked cocktail bar as well.  Tasty menu!  My favorites were the pickled veggies and mac'n cheese balls.  The atmosphere was another bonus with the red walls, wood furniture/bars, large windows, and pool table.  Will definitely go back!  Cheers :-)", 
    "review_date": "2013-07-02"
  }, 
  "ybnJoXphDsVeg299y5A3hQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael W.", 
    "review_text": "This place is awesome! I came on a Saturday night around 6 with a couple of friends and grabbed a free table.  They have great drink specials every day. Saturday was sweet tea vodka, which basically tasted like iced tea and no alcohol, and comes in a mason jar. Soo good.  To eat: Pork Belly Donuts - not really a donut, but deep fried pork belly in batter with sweet flavoring. Incredibly good. I also got the fried chicken and fried catfish slider. I think I just like fried things. Both were served quickly and were really juicy and full of flavor.  What makes this bar awesome is the board games that they have in the place. We played Cards Against Humanity, as well as Jenga with crazy commands on them, like go dry hump the jukebox.  The crowd here is pretty hip and very chill. They cheered on my drunk friends dry humping the jukebox and doing crazy dances.  The bathroom is sadly just 1 single men's and 1 single women's, so the lines can get long sometimes.", 
    "review_date": "2013-07-21"
  }, 
  "RB4e39jYx8jetCY5ktzQ9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sara R.", 
    "review_text": "The bartenders are super friendly and service is quick. Great beer selection. Get the pork belly donuts! They're heaven.", 
    "review_date": "2013-09-10"
  }, 
  "fyRujtU9WM4R9xcH_KbgCg": {
    "user_rating": 4.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Ashley K.", 
    "review_text": "Fun atmosphere. Board games, grilled cheese sandwiches, beer on tap. What more could you ask for? Decent pricing as well.", 
    "review_date": "2014-10-25"
  }, 
  "bNpy0uzbh7BT2Wnd5eReTw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam L.", 
    "review_text": "What's not to like about this place? They have arcade games, a pool table, little seating nooks, and taller bar tables, and 2 bar areas with a decent selection of $5-8 beers on tap.   I had the jalapeno mac and cheese balls to accompany my beer and it was pretty good...although I think they could've put a little more jalapeno heat into the mix, but hey, that's just the asian in me talking.  Apparently they have a sister bar in the Mission called the Sycamore that I need to check out now, but I'm guessing it's the same, relaxed vibe and affordable drinks. I'll be back!", 
    "review_date": "2014-06-01"
  }, 
  "1WpYGy2ByT25RlXMhe29XQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie B.", 
    "review_text": "Meh. Came here for a late night meal but felt I could've gotten better quality food for the price.   I saw mac n cheese balls on the menu and my expectations far exceeded the outcome. Very little flavor and not much cheese. I thought the sloppy joe was pretty tasty although the sandwich could've used cheese. Also, I tried some of our friends' carne asada fries and... just no. Perhaps they're known for some items we didn't order but I wasn't very satisfied with what we got.   I did like the ambience of the first room but the connected larger room with a pool table felt much more grungy. May return but probably not for food.", 
    "review_date": "2014-10-19"
  }, 
  "6JOD7pAVHb3oC7gYWuOLkA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany C.", 
    "review_text": "This place definitely has potential, although I didn't really get to fully experience it because I wasn't feeling so well when we went.   Here are my thoughts though:   Positives +: + Two bars, one with craft beers and another with hard alcohols. They also have daily specials with different drinks each day, and a great happy hour for both food and drinks.  + Games! Lots of board games all over the place for you to lounge and hang out with friends +Dog friendly(?) - I don't know for sure, but there was a dog sitting on a bar stool when we went. So, that's cool.  +Fried mac'n'cheese balls - they were pretty good +Pork belly donut - pretty unique, although it was a bit too greasy for my liking. Very rich in flavor though!   This place is pretty cool, I'd definitely go back for a night of drinking with friends.", 
    "review_date": "2014-10-19"
  }, 
  "cIA2HJi9TGiZ4EK0fbrXgA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alyssa L.", 
    "review_text": "The owners of The Sycamore (if you haven't been, you need to get your're booty on over), have done a great job with their new venue, The Willows.  A group of us went there a few nights ago and were impressed with the space.  It's huge with two spacious rooms plus a small game room.  They serve up tasty diverse morsels for veggies and non veggies at a decent price, along with some delicious cocktails and a diverse selection of hearty beers.  The service was also excellent fast and friendly.  I hope this place knocks the socks off of SOMA in the same manner that The Sycamore has warmed up the Mission.", 
    "review_date": "2013-06-24"
  }, 
  "V_Y2e30CvavAaA_Y63vhUw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alan T.", 
    "review_text": "Meh. Even though happy hour offers quite a lot of options, the margarita was way too sour and the music was extremely lame.", 
    "review_date": "2014-10-09"
  }, 
  "-qFuoSVFlKgQdZdbFcjDWw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren D.", 
    "review_text": "Pork belly donuts. I don't even want to write this review because then the secret will be out and I may not be able to get my paws on those crispy, bourbon and maple infused pork belly balls.  There's board games too.", 
    "review_date": "2013-09-13"
  }, 
  "oCxPG8xEKI-dbJByb2vPAw": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Shaina J.", 
    "review_text": "This is our go-to after-work happy hour bar. The beer on tap selection is always good. There's at least 2 or 3 beers I like to try every time I go. There's also a full bar if beer is not your thing.    It gets pretty busy on Friday nights, but it's never overly crowded. Also never too noisy so you can hold decent conversation here with co-workers and/or friends.  Also tried their loaded fries, which is delicious!", 
    "review_date": "2014-09-15"
  }, 
  "hcYoeBtJmkIupV7EmZmu2A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sean M.", 
    "review_text": "Great beer selection in the beer room/side and good cocktails in the bar side!  Been here twice now and on both visits the food was great!  Love the salt and pepper French fries, the pork belly donuts, the burger and the DRINKS!  Had the \"Fuck You, Grandpa\" as it seemed most appropriate as my younger buddies have made that my nickname.  They have three pinball machines and a pool table as well as a jukebox.  Good times!!  Special thanks to bartender Show-wa (misspelled for sure!)!!", 
    "review_date": "2013-08-05"
  }, 
  "OMoBzr4FhDkk7yV8zYtmiw": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Noel M.", 
    "review_text": "Another amazing event by Bay Area Beer Socials led me to The Willows.  Their \"Kick The Kegs: End of Beer Week Blow Out\" event was delicious!  Being a member of the Meetup group gave us an additional $2 off already incredibly priced micro brews.  My experience would have been 5 stars if the food were a little better.  Everything fried tasted like the same old grease.  Sadly, I ordered the Pork Belly Donuts for friends who have never had the experience and regretted it.  It was a poor example of a SF delicacy.", 
    "review_date": "2014-02-20"
  }, 
  "cRonkYAwS6c3XehTH7dxtg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Spartevan V.", 
    "review_text": "Dastardly dashing handsome companion and I stopped in on a Sunday night. Desolate crowd, but I can see how it would be a fun ambiance during the day.   Pros: *Kitchen open at 10PM on a Sunday evening. (HUGE PRO). C'mon San Francisco, you're not Kenosha, WI. Why do you shut down so early???? *Addams Family pinball game seemed to be complimentary, or maybe we were just lucky.  Cons: *Simpsons pinball machine was busted. Quarter stuck in slot. DOH! 90's kid here, Simpsons vs. Addams Family . . . Simpsons trumps and smokes it off each and every time.  *Very small.   I would return during the day if I were in the area and if the Simpsons game was operative.", 
    "review_date": "2015-01-27"
  }, 
  "7wS68ArAYnc7BY2DGxaLLQ": {
    "user_rating": 4.0, 
    "user_location": "Davis, CA", 
    "user_name": "Mindy Y.", 
    "review_text": "(1) DIY Burger - got to pick two items, came in a delish beef patty, the bun.. omg.. carbs.. soooo good!!! 4 stars! Fries were fatten ... and great! 5 stars for the fries!  (2) Pull Pork Burger - Oh man, where do I start! SOOOOO AMAZING! 5 Stars!!! Addicted!   (3) Service - homeboy was great!   (4) Beer... lots of selection!!! Dog something snake IPA.. yums! 5 stars  **OVERALL - Must get Pull Pork Burger + IPA ... yeahhh! 4 stars overall!", 
    "review_date": "2014-07-30"
  }, 
  "kpmXrDNIhnQbZSuJxCbmwQ": {
    "user_rating": 1.0, 
    "user_location": "Daly City, CA", 
    "user_name": "John Louie B.", 
    "review_text": "I was excited for a new place to open up since I work so close.  But the experience was horrible.   The food was ok to say the lease. The service is horrible.   I don't think I'd come back. Unfortunate cause its a block away", 
    "review_date": "2013-06-24"
  }, 
  "q3rE18fI92M28FxfHHB6Vw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron M.", 
    "review_text": "Everything is super rad!! Great beer selection and the food is hella good!! I will definitely be back!!", 
    "review_date": "2013-08-24"
  }, 
  "YnzceCjDglgkfFejkOGNPg": {
    "user_rating": 2.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Mei B.", 
    "review_text": "I had the DIY Burger w/fries for lunch.  The meat was good, but I felt the specialty garnishes should have been better.    The restaurant is like a bar/pool hall setting.", 
    "review_date": "2014-07-31"
  }, 
  "CZnWFZHA0QywZyhF3f0bSg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Whitney D.", 
    "review_text": "This place rules.  Liz is really awesome and it's a good vibe.  Got food too.  Excellent.  Great job.", 
    "review_date": "2014-03-13"
  }, 
  "VlVx6clfF7iZfO_idvuMfA": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Amanda G.", 
    "review_text": "I had this place on my radar for awhile, and we finally made it here on a Friday night a few weeks ago.  The servers and bartenders are nice, although one bartender had no idea how to make some very basic drinks.  I like that they have different seating areas . Depending on the amount of people you're with, whether you're eating or not, the variety is pretty cool. If you're in a party mood or more a mellow chill mood, there's a seating area that suits it.  The hubby and I split a burger and pulled pork sandwich. I liked both, and the fries were pretty awesome.  The burger was a little over what we requested, but not enough to send it back.  This seems like a fantastic neighborhood place. Good food, great beer selection as well as full bar, arcade games, a pool table, and they have pub trivia nights and beer events.  I SO wish it was in my neighborhood!", 
    "review_date": "2014-08-12"
  }, 
  "XzgLFg8r_BvwEYJeZB0t-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick F.", 
    "review_text": "Amazing beer selection. A lot of great craft beers. The burger was ok. It was very big, had lots of great toppings, but there was just something missing with the flavor of the meat. However, I really enjoyed the atmosphere and beer selection so I will definitely be going back.", 
    "review_date": "2013-11-09"
  }, 
  "uqgiQat2CNLIHBdctG4EiA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Ross S.", 
    "review_text": "Please reprimand the ginger waitress. She is nothing but rude and bitter about working at your bar. Very rude and unhelpful   In addition, please work on consistency. Every time I have visited, the portions differ. It's very disappointing.  Love the carnitas fries, but will not be returning due to the terrible service and poor portion consistency.", 
    "review_date": "2015-01-11"
  }, 
  "W_9HBNDOwzKZ-Is4fNYS2w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Damien G.", 
    "review_text": "I love a spot I can go to and just relax in the well curated vibes. Not really a dive &amp; not a place designed for arrogant tech geeks either. I love it. Also, they have a southern punk bartender who is super hot.", 
    "review_date": "2014-03-25"
  }, 
  "Insw8t0hP3pW4kD4Mu4RXw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "brian z.", 
    "review_text": "there are too many pubs in the city to worry about the ones that come up short. service was really slow at lunch. took about 10-15 minutes just to close my check. so, i took that time to do my first yelp check-in and post a picture of the dead mouse at the bar.  i work in the area. this was my first and last time to eat here for lunch.", 
    "review_date": "2015-02-03"
  }, 
  "t1NmJ-g09NijXqycgF-evA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonya Z.", 
    "review_text": "badass bar with cave like seating &amp; yum food", 
    "review_date": "2014-06-20"
  }, 
  "kkteyLV-nBhNcyi-mwUIBw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nate P.", 
    "review_text": "Happy hour all day Sunday!  Great drink specials every night, nice bartenders, and games!  (Food could be a little better, but it's bar food....)", 
    "review_date": "2014-04-07"
  }, 
  "p6zVjHdVFhM_b5lB6fH5xw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick S.", 
    "review_text": "Went in for a burger and beer at lunch. Despite there only being about 5 people in the whole place, the food took a LONG time. Upwards of 30 minutes. I was kinda mad, thinking \"this burger had better be freaking amazing to justify this wait\".  But then it was. Absolutely fantastic. Very generous on the toppings, especially the bacon, and the fries were well seasoned. Very solid overall, and with a good vibe.", 
    "review_date": "2014-06-08"
  }, 
  "2E1733GhitBksZJZb6AgvA": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Stephanie G.", 
    "review_text": "Came to SF on a Sunday with no expectations.  Well an expectation that fell through and then the unexpected happened.  Came to the Willows in the afternoon and there is plenty of street parking nearby.  Plenty enough being that it is San Francisco and usually there is NONE! Back to the Willows, we shared a burger and each had a beer.  I loved that they had quite the variety of beer for both my BF and I.  After all they do say that opposites attract.  The burger was delicious. The beer complimented it. Willows won a piece of my heart that day and I'd return next time I'm in the city.", 
    "review_date": "2014-12-29"
  }, 
  "z1aE5EXdEIY2MyO25NoIPQ": {
    "user_rating": 3.0, 
    "user_location": "Sonoma, CA", 
    "user_name": "Cellar Rat D.", 
    "review_text": "Too expensive for the quantity of food. Typical \"new San Francisco\" prices that hipster douchebag  techbros that infest this place are willing to spend. Sad  Good beer selection, though. Come for the beer...not the food.", 
    "review_date": "2015-01-23"
  }, 
  "aVRO9GnGttsUu1llAcy_6g": {
    "user_rating": 5.0, 
    "user_location": "Culver City, CA", 
    "user_name": "Megan M.", 
    "review_text": "I stayed around the corner from here and it was my first stop in SF. It's welcoming vibe lured me right in. We had a couple great beers. A Sour beer and a farmhouse brew. Both tasty. We also grabbed an order of the Mac n cheese balls. Very good! If this place was in my neighborhood in LA I would be there often!", 
    "review_date": "2014-06-29"
  }, 
  "Kw0mRXcSYgQ3q05L3yIjsQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jordan P.", 
    "review_text": "This place is awesome.  They have indulgent mozzarella sticks and great beer.  Trivia night is super fun and the board games are fun as well (though \"Operation\" is missing a few parts).  I read recently that they politely ask that Google Glass be removed.  There is a lot of tension in the city today and I think this is an attempt to be proactive.  Frankly, I love being told to put my cell phone far away during Trivia nights.  It's nice to unplug from everything else and simply enjoy the surroundings.", 
    "review_date": "2014-03-04"
  }, 
  "O9iVmgS_hPtNd887LDBctw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Saminda W.", 
    "review_text": "My wife and I strolled by this joint a few months back and I bookmarked it for future inspection.  Inspection day was today, and we arrived with a balanced thirst and appetite.  Upon walking in on a lazy Sunday afternoon, the Willows looked like a bar or lounge in the pre-amp hours, lots of dark wood and black leather booths, but with rock music wonderfully blasting on the sound system.  We were greeted amiably by the bartenders, sat down and browsed the cocktail and menus.  Peering up, we saw the selection of board games and local denizens playing pool and pinball in the periphery.  Solid.  Onto the food/drink: they have an indulgent selection of gastropub menu items and some interesting cocktail offerings, too. We ordered the fried mac 'n' cheese bites, the Western burger and the Black Bean Patty burger.  I'd pass on the mac 'n' cheese bites, they were somewhere in the realm of meh, just tasted liked a breaded version of the Kraft variety.  Both burgers were quite good, not epic but solid in taste and freshness.    The cocktails were so-so; I had the margarita and it was a bit too sweet and syrupy, not enough kick.  The followup, the Lo Siento, with grapefruit juice + tequila was better but nothing to write home about either.   So if the food and drink was just slightly above average overall, why the 4 stars you ask?  The bartenders, that's why.  They were super-friendly and provided great service, even with the chill vibe on a Sunday afternoon.    For Missionites, this place is kinda like a spacious Sycamore, both in food quality and atmosphere, and better in service and attitude.  Worth checking out for sure.", 
    "review_date": "2014-04-20"
  }, 
  "WDsr8RnPqbceR3s2yZYr3Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron M.", 
    "review_text": "It's called \"the willows\" but it should be called \"the aioli\" since that's pretty much what's going on here.  Came here with a friend and we had: - Pork belly donuts (which are just battered and fried bacon chunks served in syrup) which, to be fair, didn't have aioli. - The fries with a \"threesome of aioli\" or something - two of which were awesome and one of which was too mayoey.  This dish was probably my fav. - The sliders, which were all good and had aioli on them. - Mac and cheese balls, which were a little bland (full disclosure: I make the best mac n cheese everrr, with truffle oil and sriracha) served with a big thing of, you guessed it, aioli!  Fortunately, I didn't kiss anyone that night.  I would come back for sure, since their menu had tons of other exciting-sounding things and sh*t tons of bottled beers - which, reader please note, differ depending on whether you are in the small bar (tons) or big bar (few).", 
    "review_date": "2014-03-01"
  }, 
  "jy_RGAeAvNeCv5BxZsUWFA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tom R.", 
    "review_text": "Great beer selection, Decent prices and The Best burgers in town. That isn't hyperbole, I'm very picky about burgers and these are better than the over priced and over hyped burger at Zuni.  If you are a beer lover they have quality craft brews on rotating taps at some of the best prices in town.  The atmosphere is warm and friendly, it's a very comfortable place to be.", 
    "review_date": "2015-01-26"
  }, 
  "Zs8ANXHX4d9FSqLi_u1Y9Q": {
    "user_rating": 4.0, 
    "user_location": "Atherton, CA", 
    "user_name": "Veneta N.", 
    "review_text": "Great place to chill with friends and play some board games (they have an interesting selection) and grab some Crabbies alcoholic ginger beer.  There is a pool table and pinball machines.  The burgers are up to par, the slider are big enough to feed someone with a small appetite. Loved the Mac and cheese fried balls.", 
    "review_date": "2015-01-25"
  }, 
  "duymKKwUruH8GwbvcaFd0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gene X.", 
    "review_text": "Just been here once, but so far I dig this place.  I went because I heard they have pinball and they have three machines here: Monster Bash, South Park and Road Show.  They also have some decent beers on tap like Almanac Farmers Reserve #3 (yum) and Drake's Blue Bottle Imperial Stout.   Definitely wanna come back and try more here.  Go play some pinball and have a beer!", 
    "review_date": "2013-06-30"
  }, 
  "RyTQDBJlRiC-xs7KYVeI0w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonathan B.", 
    "review_text": "Big, open space with a billiard table and plenty of lounge seating. They have some pinball machines in the back too. Lots of great beer on tap, and the service was exceptional!  The food menu was brief but everything was really good.  Especially enjoyed the fries and provolone cheese sticks.  Will definitely be coming back!", 
    "review_date": "2013-08-31"
  }, 
  "ADUiM6fhdSZlnfwTJpaRKQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennie C.", 
    "review_text": "I came in really excited cause I love this bar. I love their wings and pulled pork sandwich. However if it gets busy and I have to wait more than 10 minutes for a drink I have to say service sucks. Hire another bartender at busy hours or even someone that works the cashier geez. Slow service ... !", 
    "review_date": "2014-04-17"
  }, 
  "lBmTMYQyg8oDEKARj98JqQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luke L.", 
    "review_text": "Love this place!  I've been here 4 times and love the awesome beers on tap enjoy the full bar option.  The bacon cheeseburger and fries I had on visit #2 was great too!  I even got to be a Mullet Store Owner and Wheelchair Stealer playing the Redneck Life board game they have in stock.  Oh, and Liz and Tim are 2 of the nicest restaurant/bar owners in town!  Highly recommend!", 
    "review_date": "2013-07-28"
  }, 
  "BtJDvVNwHVGrWy5qzhE4Ow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dennis K.", 
    "review_text": "Awesome. great place. reminds me of the old Hamburger Marys and not the three or 4 other places its been since. Great craft beer at the back bar.  Food is pretty dam good pub grub, they have a great salad and all the sliders were awesome so far. Lunch is a bit confusing. you order at the bar and need to go up there when ya want more stuff, not that im lazy, im totally cool with it just thought i would throw it out there as an FYI. first few times i kinds sat waiting when that aint the gig. All the staff is super cool as well. So stoked they moved into the hood.", 
    "review_date": "2013-08-01"
  }, 
  "DQwHU_gHFHsUoXtaDc3ong": {
    "user_rating": 4.0, 
    "user_location": "Savannah, GA", 
    "user_name": "Mona H.", 
    "review_text": "Great place to come with friends and play some games, munch on food, and have a few drinks. I had the Pulled pork sandwich and my boyfriend ordered the wings. They were both great, and good portions for the money.", 
    "review_date": "2014-03-29"
  }, 
  "3KqBf9avm_5e9wwodmudvQ": {
    "user_rating": 4.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Nick L.", 
    "review_text": "Came for lunch on a sunny Tuesday afternoon. Immediately from entering I knew this would be a fun night spot. Solid menu, solid setup inside, solid beer selection, both tap and bottles(very nice sour selection and special reserve bottles) and solid weekly drink specials. Everything is spread out, pool table, pinball machines, board games, and a chill side bar area with an eclectic tap selection separate from the main bar and room. I ordered the lamb and fried chicken sliders, side of fries with a random white beer. First off the fries were lightly salted, peppered, and crisped to perfection. I love a good crispy fry. The lamb slider was super juicy and packed with flavor...the fried chicken slider was crispy with accompanying pickled red onions that gave it a good flavor ....makes me want to come back to try the southern fried chicken sandwich. The sliders are tiny but ordering two mix and match sliders with a side of fries was just enough. I could probably eat a dozen sliders in one sitting, each slider takes about 3-4 bites to finish. I would  suggest the menu have a set price for three mix and match sliders but non the less both were tasty. Did I mention they have pork belly donuts. Say Whaaat? Did I mention the kick ass beer selection? Rye beer on tap?Yes please! I'll add the 5th star when I come back for a second review at night!", 
    "review_date": "2014-04-15"
  }, 
  "qOwaJbJAk0-Y6HXi7f9_6A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Madelyn M.", 
    "review_text": "It's clear immediately after walking in that this wasn't whoever designed this joint's first rodeo. The decor is understated but somehow manages to be warm at the same time. I came in for my first visit on a Wednesday evening and got a delicious \"Tish\" -fesh tasting peach martini. I then discovered the beer (and shots!) bar in the second room. They have a *very* well selected beer menu, and that's a tall order for someone who works in a brewery. I loved that there was a large table of people playing cards against humanity and the corner location with all windows on two sides gets great afternoon light. The service was prompt and friendly on both sides and  I'm looking forward to returning and trying some munchies! Extra points for the big jukebox and arcade games, and the fact that almost all the other patrons looked like people I might enjoy chatting with.", 
    "review_date": "2013-07-01"
  }, 
  "sJ4z77k52Qe7wxNJypuMsQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Denis Y.", 
    "review_text": "A great neighborhood bar/restaurant, period! This is not fuck'n Bar Agricole couple blocks over -- for fu@k sake, this is the real thing, grungy, plain, great bar food, caring people and hanging out with good old friends. Keep attitudes out. You may only like it if you're in the know!!! Are you...???", 
    "review_date": "2013-06-29"
  }, 
  "SuMBnQQ7G1dKAP7ciIC82w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colleen F.", 
    "review_text": "I'm so stoked there is a new bar with games, space and bomb food in SOMA. My friend and I got the arugula salad and pulled pork sando, which was THE BEST FRIGGING PULLED PORK SANDO I'VE HAD IN THE CITY. Not a pulled pork connoisseur, but I'd be willing to bet money on it.   Played pool too, which was nice because it is a brand new table. The place was pretty dead at 8:30pm on a Saturday, but I know that won't last. The Willows is well on its way to be as reputable as its sister bar The Sycamore- however this will never happen until they find a bartender who can get people drinks in under 30 minutes.... If my rating were on service alone I'd give it a hard 2 and 1/2 stars, but I have faith that this is just one of those kinks that needs to be worked out over time.   Be back soon!", 
    "review_date": "2013-06-30"
  }, 
  "piMcUWV01YODtt98wVVk4g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "g k.", 
    "review_text": "This place is AWESOME!  Great selection of local craft beer and really solid cocktail menu.  The staff is very friendly.  Love the decor and the fact that they have pool tables.  Food is great!  Definitely check out the pork belly doughnuts and mac n' cheese balls!", 
    "review_date": "2013-07-08"
  }, 
  "K1TUU1y3ChZ9wi5ZAVpjeA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "KC F.", 
    "review_text": "Positives: Good selection of craft beer on tap. Good atmosphere. Drink prices are pretty good too. Overall it feels like a solid bar.   Negatives: It's around the corner from my office but we never eat there because the food is WAY overpriced for what you get. $10-$13 burgers that don't come with fries is pretty absolutely terrible. Paying an extra $5.75 for fries and an extra $1.75 for a \"flight of aioli\" is just plain stupid (especially when you don't just offer ranch dressing as an alternative to ketchup). Seriously, a burger and fries/aioli is $20!? I'd much rather go eat at Catheads as it is a much better deal and the food is way superior. $12 for pulled pork, Mac n Cheese, and a beverage. Seating in the back bar is pretty lame. Need more table space to set drinks down on while standing around.", 
    "review_date": "2014-04-14"
  }, 
  "e8cCi-lb_BrlUkJ1qOtkFQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim S.", 
    "review_text": "Awesome new addition to the area! Food and service was great; looking forward to trying more.  Edit: this place is by my work so I've come back multiple times. Each experience with the service has been worse than the last. Staff love to bicker and food loves to never make it to the table. I'm writing this review while waiting half an hour for a burger. Done. Sorry guys.", 
    "review_date": "2013-06-27"
  }, 
  "2LDJfIYnAZxUwYNGcC5s2w": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Arlo T.", 
    "review_text": "Willows is a chill spot. The night we went there were only a handful of people. It's a relaxing environment and pretty laid back. A couple of friends and I just played the board games and had a couple of drinks.   I would recommend this place.", 
    "review_date": "2014-06-07"
  }, 
  "aRdK2MBqjVt8gGvb2nLOhg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott A.", 
    "review_text": "This place has everything you need: good food, drinks, games, a lot of open space, pool, and a jukebox. Going to become a regular.", 
    "review_date": "2013-09-21"
  }, 
  "ilesK4CRarjiblkxUDL_tQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vickie Z.", 
    "review_text": "Came here for a meet up group meeting on a Tuesday night. The place was very casual, good selection of drinks and bar food, the burger looked delicious (only if I did not have dinner :( ) would definitely be back to try out more drinks and have the burger!", 
    "review_date": "2014-02-22"
  }, 
  "ZWKAMHmZKRCZ9ty6RTHRfg": {
    "user_rating": 1.0, 
    "user_location": "North Oakland, Oakland, CA", 
    "user_name": "Andreea G.", 
    "review_text": "We went for the 1st time there on a Sunday evening . We ordered the Cobb salad and a Beet beat salad. The Cobb salad came without bacon at all, the quality of the ingredients also horrible and it had no taste . Then, in my beet salad I found on my fish some hair and the salad was so bad tasting... Ugh I'm definitely not gonna come here again .. The bartender was pretty nice and he gave us the money back on one salad at least ...", 
    "review_date": "2014-03-30"
  }, 
  "3VGsxY6-3tjnul_bIFgjvA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jorge E.", 
    "review_text": "This place is killer. Great beer and booze selection and nice strong cocktails. And when you get the boozy munchies your all set. The sliders are addicting and the pork belly donuts live up to the hype. Love the deviled eggs also. The whole staff is friendly and attentive and the jukebox rolls out great tunes. You can also get your games on with pinball, buck hunter and a pool table.", 
    "review_date": "2013-12-21"
  }, 
  "NjKncZuGEU9NGWxEmtHD-g": {
    "user_rating": 5.0, 
    "user_location": "Cupertino, CA", 
    "user_name": "Bing W.", 
    "review_text": "Came here for brunch. Great atmosphere, looking forward to returning for a beer later.", 
    "review_date": "2014-10-05"
  }, 
  "aTM03o4ZmFYCaD5E-WG0nw": {
    "user_rating": 5.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Vivek S.", 
    "review_text": "The best bar to hit the lower Soma area since Bar Agricole - and way less expensive/hip!  I love Bar Agricole - but I've slowly seen their average drink prices creep up from $8-10, to a solid $12-15... which is well worth their quality, but makes it harder to stomach fighting through the crowds.  The willows is fun, good beer selection, unpretentious menu, great deviled eggs, and how can you get mad at BOARD GAMES?  I hope that this place stays for the long run - we need a midpoint between Butter and Bar Agricole in this cozy part of Soma.", 
    "review_date": "2013-07-11"
  }, 
  "UPP1RCn3J4rtdmzVEMBoCw": {
    "user_rating": 4.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Ryan D.", 
    "review_text": "The Willows has been extremely accommodating and patient with my weekly visits after work on Wednesdays.  Coinciding with their trivia nights, every week for the past month has been nothing but a pleasant getaway from the work week.  Enjoy a couple beers, listen to their jukebox and play billiards. You can also choose from their great selection of board games and old-school pinball machines!  If you're scouting for a quick bite, I recommend the sliders, fries and carne asada fries during happy hour!", 
    "review_date": "2014-11-30"
  }, 
  "jVaiCNmWOjoI0led5LZuyA": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Danny C.", 
    "review_text": "The Willows, yes, I am down. Man, the bartender over at the beer end of the bar is snotty as heck, but everyone else is super cool. The beer selection also isn't the best, but drinks are pretty cheap for the SOMA district, and they have loads of board games, pinball machines, and pool tables. The food is pretty bomb, too, and unlike other places in the area, this space is huge, so you can definitely find a spot to sit and hang out and meet random people. Bathroom situation is a little funky, but everything else is great.", 
    "review_date": "2014-02-09"
  }, 
  "BdRMVROS1MXOHxr-bdZv0g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alice Z.", 
    "review_text": "Waited 17 minutes to get 2 drinks at 8pm on a Monday. There were 3 people in front of me.  17 minutes.  The bartender was probably the slowest service person I've ever come across.   Their house bubbly is also Wycliffe. yech.   I wanted to get food but after experiencing the wait for drinks, I decided I didn't want to die before getting my dinner.  Seems like a chill place, though I don't know why you'd make a special trip there. Seems like it caters to ppl who live close to it.", 
    "review_date": "2014-08-03"
  }, 
  "Y4DBgQUuecjUc7KGtWUVvA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Joanna B.", 
    "review_text": "These people do things with pork belly - lots of things.  They tell you to share the doughnut. Yes, there is a pork belly doughnut. If I were a single dude, I would get a couple of orders and walk around asking people if they wanted to try some. It is certainly a conversation starter and tasty - fortunately.  I'm more of a tea-toatler but I noticed both bottomless mimosas and bloody marys. I usually have only noticed the former.  There is a do-it-yourself bloody mary bar!  It seems to delight adults.  What is delightful for kids of all ages is that, in addition to 2 pool tables, there are boardgames. There are dozens of them. The seating is such that you could enjoy a game during your meal.  The menu is creative and solidly delicious. Service is nifty, I suggest visiting.", 
    "review_date": "2014-11-09"
  }, 
  "by1LQOChk-cMMAYAHbiPlg": {
    "user_rating": 1.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Johnny C.", 
    "review_text": "Last night the heavy-set woman bartender was too busy doing shots with a guy who appeared to be an off-duty co-worker to take a food order from me and my mom, who is confined to a wheelchair. I finally had to go into the other room and order from the other bartender. In the 30 minutes we were there, I saw her down four shots. Unbelievable.", 
    "review_date": "2015-01-21"
  }, 
  "AUZZofFreppw7QV-g3EwNQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katherine R.", 
    "review_text": "They make a good, strong mai tai! I'm hurting a bit this morning, but I really enjoyed this bar. They have a lot of seating space, and a lot of things to do: board games, cards, pool table, arcade games... not to mention two bars in one (full bar with cocktails, and craft beer bar). We had the pleasure of hanging out with one of their newest bartenders, Shea, who was a sweetheart! Check this place out, don't have TOO many mai tais, and make sure you count the deck of cards before you start playing, cause it might be missing a few :)", 
    "review_date": "2013-06-26"
  }, 
  "E0hnzH2Kx50pYjIOhMxfuA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie W.", 
    "review_text": "-Pros- Arcade games Pool Table Board Games Split Rooms (one for beer/another for liquor) Good amount of seating  Decent drink specials Low key, no where nearly as crowded as other places   -Cons- Weak drinks  Lack of craft cocktails   Overall Thoughts  Fun atmosphere with plenty of things to do but not sold on the drinks", 
    "review_date": "2013-11-01"
  }, 
  "c8FOqDRhtL7q_YsQio6bog": {
    "user_rating": 3.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Kevin B.", 
    "review_text": "Came here Wednesday night with some co-workers. Got a strange sense of deja-vu - like I've been here before back when it was another bar or restaurant.  In any case, this is definitely a strange place. Don't get me wrong - I had a decent time and all. It's just that this place doesn't really have an identity. It's kind of all over the map. On one hand, it's kind of a divey SOMA bar with a pool table. On the other hand, they sell food (burgers, sandwiches, pork belly donuts, etc.). They also have their own craft beer bar in the back, and a small video arcade in the front. This place is literally trying to be everything for everyone.  I ordered a Side Car to kick off my evening. It was tasty/strong - and made with their own special cognac. However, when I tried to order a second one, the bartender informed me that they they \"ran out of the ingredients.\"  Um... ok. No biggie. I'll have an Old Fashioned then.  In any case, the food is actually decent pub grub. I ordered the fried chicken slider and the lamb slider. Warning: although delicious, the sliders are quite small (even for a slider). So I'd recommend ordering at least 3 or 4 if you're really hungry. The burger looked large and scrumptious. The fried mac and cheese balls with dipping sauce was a winner. And even though they sound weird, the pork belly donuts were actually pretty good.  Service here is definitely spotty. Don't expect a waiter to come to your table (even though they have a full menu). All food orders need to be placed at the bar. It took us about 20 minutes to figure that one out (but that's our own fault). The bartender (who seemed a bit overwhelmed) typed in our order, and we received our food within 20 minutes.   FYI - they do trivia night on Wednesdays at 7pm. There's no cost to play. And the winning team gets $30. Though make sure the other teams aren't cheating. I'm convinced that the team behind us was using their smart phone to look up answers. Oh well.  All in all, this place is decent - not great. If I come back, it will def be for trivia night.", 
    "review_date": "2013-11-15"
  }, 
  "fSvOdnryI9FPJ2ylcsE2ig": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Natalie S.", 
    "review_text": "Fun place to grab a drink with friends. They also serve food so it's a good place to eat and drink.  It's on a corner that I've passed by a bizillion times and never noticed! Glad that parking is relatively easy on that stretch of 11th.", 
    "review_date": "2013-12-18"
  }, 
  "7N8y__Gq8KLys4cE7FAAoA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shalana M.", 
    "review_text": "Last Saturday at about 10:30pm I witnessed one of the bouncers throw a glass object at a tree on the sidewalk where it shattered. Welcome to the neighborhood!   Suggestion: tell your people working the door to have some respect for the neighborhood.", 
    "review_date": "2015-01-20"
  }
}