{
  "9sWf1QjQbmAHZMwRsCI6vg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelcey M.", 
    "review_text": "I'm so glad we conquered our 'we-can't-go-without-a-reservation fear!' and stopped in to The Square last night for dinner, anxious to try the new restaurant by the people who brought us Sons and Daughters. Just our luck: they had a last minute cancellation, so we were seated immediately around 7pm on a Thursday. I can hardly believe this restaurant occupies the same space as the former Bottle Cap!  The place now seems extremely open (they blew out that ugly wall), and the dark, dimly lit ambiance ups the chic factor of the somewhat touristy neighborhood.   We tried: - The pastrami spiced rillettes, caraway toast and mustard. This was our least favorite - way too salty, and we barely touched it. It was also topped with cornichons, so if you hate pickles...  - The delta asparagus, speck, and whipped whey. This was our favorite dish of the night! Our hostess recommended it, and even my gf who claimed she hated asparagus couldn't stop picking at the plate.  - The trout, braised baby fennel and new potatoes. The trout was cooked beautifully - crisp on the outside, juicy on the inside - and the new potatoes were very tender.  - The grilled sirloin bavette, spring vegetables, and wasabi. I did get one slice of slightly chewy bavette, but overall it was a solid dish.  - The beef tartare and salt &amp; vinegar chips. Beef tartare is pushing the limits of my culinary adventurousness, and I've only had it once before in Paris because, well, I was in Paris so I had to. While I still have a bit of a mental block preventing me from fully enjoying raw meat, the flavors of the tartare were outstanding and, dare I say it, better than my previous French version (mon dieu! mais oui!).  We opted out of the desserts, but what struck me even more than the delicious meal was the attentive, professional, polite, non-pretentious service .We never had to wait for water, we had many people asking us how we liked each dish, and we were even asked if we would like extra sets of serving cutlery so we could share the plates more easily.   Go for the food, stay for the service.", 
    "review_date": "2014-03-07"
  }, 
  "VdiorMo0Eh_18HxUHlpdRg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maggie Z.", 
    "review_text": "Nice atmosphere. Great brunch, though it took awhile for our food to come out. The beignets were amazing, as was the pork belly hash. The Square Breakfast was really good too. Excited to come back to check out their dinner menu.", 
    "review_date": "2014-07-12"
  }, 
  "ZN_AmBK2WiRm43m5k1dwLA": {
    "user_rating": 5.0, 
    "user_location": "Saint Helena, CA", 
    "user_name": "Sara W.", 
    "review_text": "I've dined 3 times in the 3 weeks that The Square has been opened and each week I am more and more impressed. Beautifully balanced neighborhood food, great cocktails and superb desserts.   Amongst my favorites are the Asparagus with speck, ginger beer cocktail, Roasted Crab and Rum Baba cake.   Neighborhood food that pleased both my Midwestern mother and my food critiquing friends. Interesting components combined with classic flavors. Yum!   Definitely get dessert at the end of this meal, you won't be disappointed! All too often a great meal like this is followed up by a boring, overly sweet dessert. All of the desserts here (and I've tried them all) are perfectly balanced, not too sweet and very well executed.", 
    "review_date": "2014-03-16"
  }, 
  "Yi5JKaD1VY4Edeww92PZWA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Regina L.", 
    "review_text": "My fiance and I had a wonderful date at the Square last night. The space is really inviting and cozy, and I really like the paint color that they chose for the walls. The hostess was very receptive and sat us immediately. Our server, Anthony (I think?), was friendly and engaging throughout the entire meal. We started with a class of Sauvignon Blanc and their daiquiri. Both were very good. For appetizers, we got the oysters and the beef tartar. The oysters were presented in a really nice dish full of rock salt, and their champagne mignonette added a great flavor to the oysters. The beer tartar was SO good. I thought the salt and vinegar chips were a tasty and fun addition to the beef. The beef tartar itself was perfectly seasoned, and I'm glad that the onion wasn't overpowering like it can be sometimes. It was a good amount of food for an appetizer.   My fiance got the risotto, which was one of the best ones I've ever had. The barley and mushroom combination was perfect. I kept stealing bites the entire time. I ordered the seafood/broth/artichoke/bread dish. When it first arrived the mussels tasted a bit off, so we asked if they could take it back, which they did without any hesitation. The new dish tasted great, and the cod was by far the best part. We ordered two beers off of their pretty beer list, which is quite impressive, and were given complimentary dessert because of the mussels issue.   Everyone was so friendly and I liked how all of the staff had roles that brought them in and out of the kitchen. I felt like we got to interact with everyone working there that night. We will definitely be coming back!", 
    "review_date": "2014-05-07"
  }, 
  "9q4vKHgnjKLPw0RTqOvyQA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alan S.", 
    "review_text": "Great food and great service. We went at 6 right when it opened and had the trout, and the short ribs. Both were really tasty. The cornbread that came with the ribs was great too.", 
    "review_date": "2014-06-06"
  }, 
  "i8YV4FKTZ74wC3KN98XY2w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacy W.", 
    "review_text": "Food is amazing. The menu descriptions do not do it justice. A welcome addition to the neighborhood.", 
    "review_date": "2014-05-18"
  }, 
  "Aeak_MtjLgtjje3BT5DSxA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sona P.", 
    "review_text": "Food - great veggie burger, which tasted more like a fritter and had delicious accompany sauces.  Large portion sizes. Drinks - so-so, not the best. Service - slow, only one waiter on a Friday night who only stopped at our table when flagged down.", 
    "review_date": "2014-09-16"
  }, 
  "pXwwbl4BsdXVmdBAqGVZfQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rohit G.", 
    "review_text": "The food was 3 stars, the service was -3, so that's how you get to zero, but that's not an option.   No matter how good the food is it ruins the atmosphere and dining experience when the service sucks. I came here with my family and friends for a Saturday brunch, so there were 8 of us, and the restaurant was about 30% full. Our food came literally in ten minute intervals per person, and three of the 8 items never even made it.  By the time the food for the last people came, everyone else's good was finished.   With all the excellent choices for meals in this city, you really can't charge $15 for eggs and survive. This place needs to improve or go.", 
    "review_date": "2014-09-20"
  }, 
  "NI3K8WNfAwmUuHtT5lgN3A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tami S.", 
    "review_text": "We dined on a double date on opening night...8:15 reservation was seated promptly.  The Square was very good -- though still with a few kinks in service (we waited a long time for our check). The ambience was good, and we liked our food.  I was personally disappointed in the bread service. Despite the nice presentation, it tasted like a packaged dinner roll you buy at the grocery store. Also, can we have more than one? Appetizers: We got oysters, which were good. The other apps (beef tartare and asparagus) were good, but I the asparagus was lukewarm. Both couples order entrees to share -- we got the ribs and they got the dungeness crab. We thought the ribs were VERY VERY good. They definitely liked the crab. Dessert: We didn't order because we wanted the galette but we needed 30 minute notice for that...which no one told us about.  We live in the neighborhood, we'll definitely be back. Unclear if this will be a dining destination like Park Tavern...but part of me hopes it isn't so I can actually get a table there!", 
    "review_date": "2014-03-04"
  }, 
  "c4bNOJ5XnKKoHJoQE4zrcQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amber M.", 
    "review_text": "I was sad to hear Bottle Cap closed but excited that the space turned around so quickly! I grabbed a reservation for last night with my husband at 8pm. The place was definitely packed with a lot of excitement!  We were seated quickly at a table at the end of a row of 2 tops in the middle of the dining room. The table we were sat at was right in front of the kitchen door (why? just why, would you ever put a table there?). I completely understand trying to fill your restaurant as much as possible but I don't understand the logic of seating someone at what is clearly your WORST table in the house, in plain view of 4 other open 2 tops. Especially since I had a reservation...  We waited almost 10 minutes before our server came over...who was a bit...strange. We asked to be moved and we were...right in front of the server side station. Eh, ok, pick my battles at this point. Our drinks came after another 10 minutes but the new server we ended up with was great and less robotic and very helpful. She was the best part about this evening.  My husband and I both ordered their old fashioned that is on their menu. We both agreed they were good, nice presentation (1 large cube, lemon peel, etc) but we'd had better (and bigger) especially for the price tag. We decided to split a bottle of Triple Karmelite (750ml bottle) which was great. Good beer selection!  They were already out of 2 things from their tiny menu. We ordered the chicken liver mousse to start on the recommendation of the server. It was great, but nothing to write home about. I ordered the risotto - it was forgettable. My husband had the hen which was sliced. He was hoping it would be as amazing as the hen at Park Tavern and he was sorely disappointed. The 1 ounce dribble of sauce tableside was like something out of a bad foodie comedy. The portion was tiny (which I normally don't mind if the price matches) and dry.  We ordered desert - cheese for me, devils food cake for him. Again, both decently good but the teeniest of portions!  I do like that they charge a 15% flat gratuity (and are very up front about it!). We spent $150 for 2 people including an over 20% tip (we added to the auto-grat). Given this cost I think I'll go elsewhere.  I miss Bottle Cap. For the price and quality I am going to head to Park Tavern, if PT was afraid of the competition they shouldn't be.", 
    "review_date": "2014-03-06"
  }, 
  "oPYX2kUATFxDyPUqk3o7wA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bill R.", 
    "review_text": "Another disappointment at one of the best locations in North Beach. Why do people continue to ignore the long lasting successes in the neighborhood?  At least Bottle Cap had a nice young couple pursuing their dream.  Stopped in to the bar last evening to check it out. The draft beer menu is eccentric and overpriced. No Anchor Steam. A pint of Guinness is a $7 joke. If you like Guinness, walk 1.5 blocks to O'Reilly's where an imperial pint is $4 (happy hour price till 7 M-F) and they change the keg on average twice a day.  They add tax to your drink and a mandatory 15% service charge. The competition includes any tax in the price at the bar so you don't have to deal with a lot of small change. I normally tip quite a bit more, but not when it's mandatory. I'm comfortable with the old ways which have worked well for the 50+ years I've sat on a stool.  The remodel has an appealing look, but the high table that replaced the hip wall defining the bar is way too tight - kind of a coach seat feel. And removing the center wall gives a sense of openness, but greatly increases the noise level.  I predict this place will be popular for a while with the tourist and SOMA crowd, but if you want to rub elbows with your neighbors this is NOT the place.", 
    "review_date": "2014-03-08"
  }, 
  "jhPAC7UyPiRFNPlNQYMMXg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kazu O.", 
    "review_text": "Sons&amp;Daughters was one of my favorite meals that in recent memory, so I was excited to try out this new second outpost of their franchise.   The complimentary bread, fresh out of the oven, with homemade Strauss butter was to die for -- I think I had about three of them. The drinks were good -- I enjoyed their mezcal-based cocktail in particular. Appetizers were AMAZING. Their steak tartare was very well-seasoned and fresh, and I loved the contrast of flavors on their chicken liver pate dish with some strawberry jam on top!  The entrees, though, were a little less impressive. The bbq ribs were tender and flavorful, but I didn't feel that it was worth the price tag of a high-end dining establishment. There are bbq specialty shops that can do just as good, if not better, for half the price. I was hoping for a little bit more creativity in that dish.   The real problem was their pork chop -- it was perfectly cooked and juicy,  which is hard to do with pork, but the flavoring of it was just completely off.  Our first piece was EXTREMELY salty -- so salty that when the waitress came to check on us, we told her, and they sent it back to be re-made. When we got it back, the first bite was still very salty.. but subsequent bites were less so. We even got some hint of sweetness in one portion of the chop. Perhaps this has to do with their brine (or marinade?) not being evenly coated, producing saltier bites in some part and sweetness in other parts....  The service, which everyone complained about in previous reviews, was TOP NOTCH. Just like Sons &amp; Daughters, this was one of the best services I've had at a restaurant, and I felt that it made up for the lackluster entrees.  This restaurant has a lot of potential, with fantastic appetizers, and a great staff. I'm hoping that they start producing better and more interesting entrees...", 
    "review_date": "2014-06-29"
  }, 
  "lQXIE8vP6rI406rZYXq7EQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ann S.", 
    "review_text": "A friend and I wandered in on a Sunday evening for drinks and a snack.  We enjoyed one of the best whiskey sours ever and an amazing persimmon salad.  The salad was pretty spectacular and kind of overshadowed the tomato flatbread and spicy chicken wings, but they were also very tasty.  The tab for four drinks and our appetizers was reasonable, and the kitchen sent out a donut-like dessert sample to sweeten our experience.  I'm really surprised this place isn't packed.  Great bar, good food, primo location.  Check it out, and leave a drink for me on the board by the bar!", 
    "review_date": "2014-10-07"
  }, 
  "zyLIp7DRFqeIE1Grrh3Zng": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derrick V.", 
    "review_text": "Had the burger, it wasn't that special, especially for $16. The menu is geared towards group dining, would not recommend this place for two people. My tequila mezcal cocktail was good. Service was not good, especially considering the automatic 15% gratuity.", 
    "review_date": "2014-03-31"
  }, 
  "ILz8ApVEgTqbv5LnC6PyuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nicolas H.", 
    "review_text": "Finally a place that might actually make it in this location! While I do miss Washington Square Bar and Grill for some things, Square is definitely an improvement across the board. The food was really good and reasonably priced. We had the pork belly with egg, chips and dip, pretzel, bone marrow, beef tartare, ribs. All were delicious and I'd come back again as there are still many items I want to try...", 
    "review_date": "2014-09-12"
  }, 
  "u0yM0OUva3mFYomr9UZajg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsay D.", 
    "review_text": "Absolutely love this place. Came here for HH 3-6pm on a Sunday and got a killer deal on a $6 burger, $5 tatar tots (which were amazing) and $2 coors. Helluva lunch for under $20 for 2 people!", 
    "review_date": "2014-11-02"
  }, 
  "aM608nuy5JqGE7aABMEJJg": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "M...I Love This Place S.", 
    "review_text": "Had to stop and try the Ginger whiskey.   Nice smooth refreshing drink. $5 come in and try it.", 
    "review_date": "2014-09-13"
  }, 
  "OVo7FDZjjsEP01cNRTH3kw": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Ken T.", 
    "review_text": "Very cool new restaurant in the North Beach area. My girlfriend and I stumbled upon this place while looking for a bar to have a few drinks at on a Sunday evening. The bartender was very friendly and the ambiance is inviting so we decided to give the food a try.   We started with the pork and brown egg appetizer. The pork was a bit fatty, but it practically melts in your mouth. The roasted radishes really compliment the dish well and helps cut into the saltiness of the pork.   We then ordered the house made pasta and kale salad. Each dish was excellent (I particularly enjoyed the pasta) and came with some really good bread and butter. Although, I don't think the butter needed the salt sprinkles. The food is a bit pricey, and the portions are relatively small, but I left satisfied and not feeling \"stuffed\".  As far as the drinks are concerned, the beer selection is adequate with a few notable selections available. There are also some very interesting cocktails available.   The menu seems to still be evolving. I have high hopes that as this place matures, so will the details within the dishes. We'll hopefully be back in a few months to see.", 
    "review_date": "2014-06-30"
  }, 
  "nem9PDmBui28eHf5At5uiA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miss b.", 
    "review_text": "Went for Sat happy hour 3-6 daily. Read the reviews and wasn't sure what to expect with 1 start and 5 star reviews. $6 burgers, $5 sides from 3-6, $2 beers and $5 signature cocktails. $12-$14 brunch plates till 3pm. Wasn't too busy on Sat, but food was great, ambiance was hip (miss the piano though), beers were great, service was chill. Tater tots were the largest tots i've seen. Delicious. We'll be going back.  Giving 4 stars instead of 5 so this place doesn't get too popular that I can't get a table.", 
    "review_date": "2014-12-06"
  }, 
  "r91LhapQ-0x8PXTd1UYOQg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate K.", 
    "review_text": "We ate at around 10:30 on a Saturday morning, and there were only two other couples in the restaurant- normally this would be a bad thing, but we seated ourselves, and after a couple minutes someone came by and took our drink orders- coffee.  My boyfriend was in zombie mode because he hadn't had his coffee yet, so he was kind of ticked that they didn't have any brewed and that we had to wait about 10 minutes for a couple cups.  The coffee was very good- but he was already cranky so it was hard to enjoy.  The food was *very* good- my pancakes were just $7, and came with syrup, some creamy stuff, and some apple stuff on top.  I would have preferred the syrup on the side- I usually like sweet, but this was incredibly cloying with the two sweet toppings plus syrup over everything.  Despite the super sweet, I thought it was lovely.  The boyfriend's pastrami hash thing was amazing.  I'm a little jealous.  I'm not really sure what the place can do to make it a little more breakfast-friendly; our food came out quickly (besides the coffee, which was brewed to order), the service was unintrusive but responsive.", 
    "review_date": "2014-09-27"
  }, 
  "6-7lxq3PIxOeAPn4WEklYg": {
    "user_rating": 5.0, 
    "user_location": "Adelaide, Australia", 
    "user_name": "Elizabeth A.", 
    "review_text": "I went to The Square back in July, but I can honestly say it was one of the best meals I ate while visiting America. Service was flawless - not bothersome, but perfectly attentive. Our waiter was happy to explain the dishes to us, and make recommendations where required. The food itself was amazing - well put together and thought out, and reasonably priced. I can't really remember the dishes given I visited so long ago, but for the record, we dined from the dinner menu.", 
    "review_date": "2014-10-12"
  }, 
  "3TtbC5MISWKlVYsGb90d9Q": {
    "user_rating": 5.0, 
    "user_location": "Glencoe, IL", 
    "user_name": "Shayn K.", 
    "review_text": "Friendliest restaurant staff I have ever seen. Girlfriend and I stopped in during happy hour and sat at the bar and had some great house cocktails. The chef came out and gave us some restaurant suggestions for Napa Valley and offered to help us book reservations. The free truffle popcorn at the bar is delicious.", 
    "review_date": "2014-07-03"
  }, 
  "NHKJowBM-8mY2Iegfc87pQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Albertino M.", 
    "review_text": "Time: 8pm/61°F cloudy  Purpose: Doing a follow up of TS since I put them on the map month ago. At the time I was pretty much excited as it 0.8 mile from my place. So tonight I just wanted to mellow in and see what comes of.  Ambiance: It's loud in here even for a weekday night in middle of week. The noise level never change here because the structure of building was never touch, only the decorations. When it was Washington Square Bar &amp; Grill then Bottlecap the ground was the same level cement just different tiles. Sitting at the bar tonight was loud you literally have to speak about 30+db louder than usual. I don't blame the construction design as it was the same when the last two businesses were here. The structure now resembles that of a high end restaurant but with a casual attire setting. The 10 seat bar with highchair actually have a concave back piece that fells so good. It felt like I was sitting in a Recaro seat for a bar, hard to fall off. Two communal tables for larger groups and couple of high top tables near the bar area.The white brick tile design at the bar when looking at it making thoughts in your head that a brewery is on the other side. The rest of the place has is nicely furnish with chairs like the bar only shorter. Didn't like the idea of the restroom near the end of bar when going/coming back people turn their head to look at you.   Staff: I came in and was greeted by Christina young naive gal. Told me to wait a little til she can find something. I said it's okay I'm not here to eat just maybe a drink so the bar will do.  Cleanliness: Too new to say something yet, well kept just the front door debris left when wind picks up, minor.  Eats/Drinks: Steak Tartare w/salt&amp;vinegar chips housemade $14. Waited over 20 minutes for a tartare that's it's main purpose was to be served raw. I even ask if the egg was pasteurized didn't get an indefinite answer so I said what the hell you lived once, I'll try it. While waiting another guy pops menu open and ask me what I'm having tonight? I told him they have steak tartare here. He said me too! Tartare was okay but needed more seasoning to conceal that refrigerator beef taste. Was thinking it came out like a patty style like about 3-3.5 inches round instead loosely scatter pieces in a round form. Nicely cut into small piece and put together garnish with small drizzles or maybe vinegrette sauce. Not saying that it was old it shows fresh consistency bright red sticky looking with egg on top. I was worry that it might come out a little of red or brownish but it didn't and I can tell it was made to order. I kinda fork out a dab here and there put it on the chips so everything bite I would have a crunch as well as cold high end grade beef. I really like this dish but next time will try old fashion items as well as the tartare again. Got a ultimate palabra $10 to sip and eat lime juice tasted like the kind in a plastic green lime bottle. Tequila part was strong open my throat clears my mucus instantly.  Products: American fare with a twist,full bar,wine list. Salad,soups,burgers,fries,oysters,livers,seafood,­guinea hens,desserts. Limited menu this week was just the first week of opening be patience there maybe something you like in coming weeks.   Punch Lines: Loud place,unusual american fare,full bar,North Beach/Russian Hill area,hard to find parking,little Italy,accessible by bus/taxi/walk/drop off,near chinatown/fi-di/wharf/,SF Giant's mural around the corner,park,cafes,bakeries,grocery stores,private parking lots,library,bike rentals,strip clubs,late night grubs etc.   Final Thoughts: Since it just open and usually I wait at least 3-4 weeks before trying any place out unless call upon. Tonight I was just being curious since I'm about 9 blocks away. Place was so loud when I left out the door I couldn't even hear the cars or people walking chatting among themselves. Ears adjusted after 2-3 minutes and I'm not hard of hearing or impaired from one drink.", 
    "review_date": "2014-03-06"
  }, 
  "88EUOyqayMxJkMyr7lmg7A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina W.", 
    "review_text": "Pretty good food, great atmosphere, but poor, poor service.  I came here on a Saturday with two friends, and it was fairly busy, but not packed to the brim. I believe they only had 1-2 servers taking care of the whole place. Our food took forever and when it arrived, it was all cold. I think it all would have been very good food (we got grilled cheese, tomato soup, and the special pastrami sandwich), but the temperature threw us off.  Right when we got our food, we ordered another meal for a friend who was coming to meet us. She didn't arrive for another 20 minutes or so, and even after she arrived, it took another half hour before her food came. We think they may have forgotten her meal and then quickly placed the order - because of this, at least hers came out hot!  I'm definitely willing to give this place another try, but from my experience it seems like they might need to hire some more staff on the weekends.", 
    "review_date": "2015-01-16"
  }, 
  "q2q0mZYs9c-iKU4pat31fQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany C.", 
    "review_text": "I've been excited to try this place since it's from the same people at Sons &amp; Daughters.  I was surprised to see so many comments about service in the yelp reviews since Son's &amp; Daughters has the most amazing service.  The service here was nonetheless amazing as well.  I'm not sure if this is the new help they brought in or if we lucked out, but this was probably the best service I've had at this price point.  Now onto the food.  The complimentary bread lived up to the standards set by Sons &amp; Daughters - hot, fresh, and with house made Strauss butter.  For starters we got steak tartare, probably my favorite item of the night, and chicken liver pate.  Personally I prefer to spread my own pate, whereas this one is pre-spread for you.  The entrees were a bit of a mix bag.  My friend raved about their amazing ribs which were good but not mind blowing.  I'm not sure if they are really that much better than a really good bbq joint (which would probably have it for half the price tag).  The accompanying corn bread was amazing.  These people sure know their bread.  The last place prize though goes to the pork chop, which was ridiculously salty although the condiments were great.  The waitress checked on us and ended up replacing our pork chop.  This time was was less salty, but seemed to have an uneven flavor.  Our first piece of the new pork chop was a bit salty but there was other pieces that were a tad sweet.    It seems like this place has a lot of potential but needs to work out the kinks.  Can't wait to try it again and see how things have changed.", 
    "review_date": "2014-06-29"
  }, 
  "s5oLCQtHGdXldfJdA77Yxg": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Ann L.", 
    "review_text": "This was my first time at the Square. I found the service to be indifferent and the ambience was big and empty (admittedly it is a Tuesday night and it's raining.) I think a better sound system would help that. I sat in the back by the windows and felt like I was on the moon. I had the sunchoke soup and the tater-tots. I wound up eating very little of it. The tater-tots seemed burned and the texture wasn't so much 'tater-tot' as baked potato with a dark crust. The soup was very bland. And where was this great bread other Yelpers are talking about? I 'm hoping this was just a one-off kind of night. I'll probably try it again with friends on a busier evening!", 
    "review_date": "2014-12-17"
  }, 
  "o6H0um2HO2JZfhRjUJe1xA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K R.", 
    "review_text": "Like most reviewers, I think this place is great potential. They still have some kinks to address. Also, I should Say that I am a fan of the former Washington Square Bar and Grill. The wash bag had a certain comfort level, order a well-dressed cocktail and drop your cares at the door ambiance, that its followers have not re-created successfully.  The noise level on a Friday night was practically off the chart. I was struggling to hear my companion's words. It looks like the management is trying to address this with acoustic ceiling panels. Perhaps more are needed on the angled pieces of the ceiling as well as the upper walls. I think the overall din gives the restaurant a certain stressful environment. The hundred plus small lightbulbs hanging from the ceiling produced a muddy, amber light without much contrast or shadow.  Moving onto the food, the grilled peppers, with salt crystals, were fantastic and combined well with the manhattan. I ordered the kale salad with feta cheese which was more a feta salad with kale.  Half the feta would be very adequate in my opinion. The roasted beets had a lovely sweet tart flavor.  Many reviewers are raving about the little bread rolls. Yes, the bread does have a very high moisture content which makes it chewy and unique. I am not personally a butter fan; I'm kind of indifferent to the butter. Yes, the service was excellent.  I'm sure that I'll return. I just really hope there more acoustic panels on the ceiling which would make the dining room considerably more pleasant.", 
    "review_date": "2014-07-19"
  }, 
  "nmD17mfnzd4HcBF8-DrcXg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Troy W.", 
    "review_text": "From start to finish, the dinner that the four of us experienced, was an absolute treat. It started with the service as we entered through the door, each employee seemed to truly be enjoying themselves and doing their best to pass along that sentiment along to each of us. The dining experience was everything we had thought it would be, absolutely wonderful, each and every course better than the last. I would love to sit here and detail each entree we enjoyed but I honestly don't remember all the particulars, just that the overall experience of the food was perfection. We've already made reservations for our next visit, we're bring two lunatic foodie couples with us and I'm sure The Square will not disappoint.", 
    "review_date": "2014-04-21"
  }, 
  "_pmYzognwrLoJMhUm5S1lg": {
    "user_rating": 5.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Jonny T.", 
    "review_text": "Hands down the best fish n chips. Amazing staff. Great place! Definitely coming back here!", 
    "review_date": "2014-12-29"
  }, 
  "Sf-5lIT3-BX3Zl61KcFJZQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John S.", 
    "review_text": "Is this a bar or a restaurant?  I don't think the owners even know, as this new place is suffering from an \"identity crisis.\"  The music is way too loud and the food/drinks are overpriced.  Food is meh and portions are small.  Went there on a Sunday night for dinner and had to literally scream across the table so that my date could hear me.  Don't go here unless you are prepared to deal with a loud bar-like atmosphere.  And unfortunately for The Square, there are so many better REAL bars to choose from in North Beach.  For this price, I would rather go across the street to Park Tavern for a nice dinner in a classy atmosphere, where I can actually enjoy listening to my date's conversation.  I don't need to pay high prices for sub-par food in a restaurant that is pretending to be something it is not..", 
    "review_date": "2014-04-27"
  }, 
  "86B1W5x4GQbAK6clDXgDPQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren W.", 
    "review_text": "My group of girlfriends and I dined here on Friday night.  We were seated 30 minutes late for our 8P reservation which is pretty unacceptable and has never happened to any of us in our 7 years in SF.  While we were waiting, management did not even offer us a cocktail or a glass of wine in good faith and we felt like we had to continually ask them what was going on with our table who apparently had a 3 hour + meal.   Once we were seated, they did send out some free appetizers which was nice but too little too late.  Food is lackluster, not too many choices and just not executed well, no flavors pop.   Not one of us really liked any of the entree or the appetizer we got outside of some fried beans.  I do not see this restaurant making it long term.  Do not waste your time or money here and go down the street to Park Tavern.", 
    "review_date": "2014-03-17"
  }, 
  "dVixj0VryhlTOMNXctJmSQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dallas B.", 
    "review_text": "The Square seems to be following a disturbing trend in recent SF bar/restaurants--designed to be casual, neighborhood, grab-a-drink-and-a-bite places, but eager to provide no local charm and to price themselves out of being taken seriously in this capacity.  The place itself is very attractive. Because of its location, it has to be self-consciously intimidating to the fanny-pack set wandering in from Fisherman's Wharf. But, the effect isn't really SF-it's more of a SoHo vibe inside The Square. There's no regional connection to its very colorful neighborhood, at the edge of North Beach and Russian Hill.  Service was friendly enough, but slow. We sat at the communal table in the bar area and ordered $11-$12 cocktails from their menu that took 10+ minutes to arrive. Within minutes, a child with Matchbox cars was seated next to us, causing us to request another high table in the bar area. I believe bars and the bar areas of restaurant bars should be off-limits to children. At the very least, the hostess should avoid seating them in the middle of the space, where the maximum number of other patrons are subjected to their presence.   Our cocktails were overly precious and trying too hard. My \"Muddled Old Fashioned\" was small and flavorless. My wife's concoction at least had an overly boozy taste of tequila and mezcal. I think the cocktail program needs another look.  We asked for food menus and found a poorly conceived mash-up of unappealing items that toed the line between bar food and pretentious, again, trying-too-hard items that seemed anything but \"casual, sharable\" things for a \"neighborhood gathering spot\". A soup was listed as a \"sharable\" item. There was a $56 crab. A $69 rabbit (albeit on the \"feast\" menu) etc.   If this were a quiet restaurant with pleasant ambiance, I would get it. But, this is supposed to be a casual hang-out joint. It's loud and sleek. The bar is not the place for a $69 menu item. Perhaps a \"bar bites\" menu is in order?  We declined the offer to order food and got the check. $40 for three cocktails. The 15% included service charge was clearly spelled out on the tab. I don't necessarily have a problem with it, as I would have tipped 20% for our slow and slightly obtrusive service. But their reasoning is off.   They state that they want to provide a livable wage for their employees. Great! I support that. The way to do that is to set your prices appropriately to pay them that wage (which I believe they have already done). When you presume to make me tip a certain amount -- the service charge is also taxed, by the way -- that is all you will get from me, unless your place really shines...and The Square does not.  A quick walk across the park to Park Tavern is a much better call--similar nice interior, but infinitely less full of itself.  Incidentally, we went up the hill to Cocotte, sat at the bar and got a bottle of Cotes du Rhone, some Coq au Vin, mussels, a half of a rotisserie chicken a couple of sides to snack on and a couple of desserts (by this time, the three of us were hungry for a bit more than bar snacks and a bit less than dinner)  for about $110.  That's a neighborhood joint.", 
    "review_date": "2014-03-29"
  }, 
  "cCTNj715aSxK9jK3tdaGkg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sean D.", 
    "review_text": "Found out The Square was opening its doors to the SF brunch scene - so we decided to go check it out this past weekend. Really glad we did.  Started with a few bloody's to spark the appetite and they were fresh and spicy, the way every bloody should be made. We ordered the breakfast beignets (phenomenal), eggs benedict (amazing), and the blueberry pancakes. The pancakes were BY FAR my favorite.   Brunch menu looks great and I'm really excited to try more of the well-curated dishes as they get going. This place could turn into a really great weekend morning tradition!", 
    "review_date": "2014-07-07"
  }, 
  "M2uYG3jHB9AGc4BLktGf1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "howie f.", 
    "review_text": "I thought this place was solid.  We ordered:  * Padrone Peppers.  My wife really likes them and I just play along.  I've never been a fan of these, but when they're in front of me, I eat them, so I guess I can't say anything bad about them * Corn Soup.  Okay, this one was a bit weird.  There wasn't very much corn in the soup.  Maybe they pureed the corn?  In that case, they should have called it \"Pureed Corn Soup.\"  I expected actual corn kernels but there were none to be found. * Pork Chop.  this was fantastic.  Super tender, juicy pork chop with just the right amount of char.  Would definitely come back for this dish.", 
    "review_date": "2014-08-27"
  }, 
  "0xSrmE4IbWhmqBvonAJx9g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alissa D.", 
    "review_text": "I really wanted to like this place.    We walked in and the room was nice.  Liked the color and vibe.  Served a very delicious roll to start.  Could eat those all day long.    For the first course we shared the kale salad.  It was very good.  Loved the texture, the cheese and the fresh ingredients.  But things went downhill from there.  For our main course we had ordered the seafood for 2.  It took Forever.  They came an apologized, told us it would be right out, but then it took another min, making over 40 in total.  Then, it was awful.  The fish was burned and the broth had big pieces of butter floating in it.  I picked up a clam and the clam had a huge spoonful of butter inside.  Picked up another, same thing.  Basically a big bowl of butter.  The grilled bread was great through, and I guess, it goes well with butter.", 
    "review_date": "2014-04-28"
  }, 
  "kZe2CUs-9OeIViFa6QC0wA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessie L.", 
    "review_text": "I'm really surprised by all the bad reviews. I just came here tonight with my boyfriend and a friend and the three of us had a great time. We ordered two beers and a glass of wine, the local seafood, the half rack if baby back ribs, and the baby kale salad. Everything was fantastic and very filling. We were stuffed by the end of the meal and were too full to even have dessert! The seafood was perfectly cooked and beautifully presented. The ribs fell off the bone but still had a nice, almost crisp outside. The baby kale salad was very refreshing and had a nice bitter bite to it. The service was also great, speedy, and unpretentious. We had a lovely seat by the window and had a nice view of the park across the street. I would definitely come here again.", 
    "review_date": "2014-04-17"
  }, 
  "t1U3tRb4RO8uTikGoyQ95w": {
    "user_rating": 5.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Lisa S.", 
    "review_text": "Drawn in by the House made whiskey Ginger. Well... Very smooth and refreshing. Nice, as I am walking to Bart. Yes it's long walk but who cares with a whiskey ginger under the skirt. Cheers. Nice casual chill atmosphere.  Cushy stools wooden tables, a great place for regulars and first timers. As soon as we walked in they poured water and took our order.  It felt like we were old friends. Nice! When we are in the city we will be back. Thank you.", 
    "review_date": "2014-09-13"
  }, 
  "8ozxJndeMSqObxZc4xDsbg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anoo L.", 
    "review_text": "I was kinda bummed when Bottle Cap shut down, but The Square seems an awfully lot more promising. The place is finally open starting 2/27.  One thing that you notice right off the bat is that there are too many people serving you: - 3 people welcomed us at the door - 2 people offered us water - 1 took the order - 3 or 4 serve us the meal, and take the dishes away - 1 checked on our meal   Talk about attentiveness, I guess.    We went in on a Sunday at 6pm, it wasn't too crowded.  Considering the place just opened, reservations aren't necessary yet, but I totally see this being a crowded spot, once the word gets out (thanks to reviews like these, of course).   Drinks:  The wine by the glass list isn't too extensive, so we opted for the cocktails instead.  We got - a hot toddy (hey its flu season) and Mame Taylor.  The Hot Toddy was alright, considering how much I drink it I'm a little hard to please on that one but they did use honey instead of sugar, and brandy instead of whiskey! The Mame Taylor was great!   Food: I'm a pseudo vegetarian, mostly outside my home.  The vegetarian entree option was a little too carby, though I would like to try it at some point in the future (Barley Risotto, with green garlic and mushrooms). Here's what we got: - Kale Salad, with ricotta and pistachios: omgahhh delicious and healthy. One thing that bothers me about salads at restaurants are that they don't make the leaves bitable (is that a word?).  I hate having to have a conversation with someone with leaves sticking out of my mouth, cause the salad needed to use the largest pieces out there.  So I LOVED this salad, small tiny pieces of kale, can be easily eaten with a fork, and did I mention delicious? - Steak Tartare (my friend's take on it) - tartar was really good. they paired it with salt 7 vinegar chips which was really yummy because the tartar itself wasn't very salty - Hen (my friend's take on it) - hen was great too. but tiny for the price. i also only got 4 small pieces of broccoli.  - Dessert (I obviously had dessert as my main dish to balance the healthy kale salad) - I got the Devil's food with grapefruit ice cream.  I'm still craving it, right now.  I was a little apprehensive about grapefruit ice cream, but I think it complimented the chocolate really well.  Plus, you can't really go wrong with chocolate.  Tip: the Galette (with rhubarb and pistachios) takes 30 mins, so if you're thinking of getting that, order with your main meal.   15% gratuity: I know this is a pain point based on a lot of reviews.  I'm conflicted on it - you either take it as tip included, but most of us would generally pay 20% and not 15%, but it seems a little silly to include a few extra bucks to make that 15% to 20%. Specially if you're splitting bills, that's like adding another $1-$3 to each bill.  On the other hand, as I mentioned earlier, you do get served by a lot of people attending to you, so it's nice that everyone gets a cut of the tip, not just the main server. Oh well, maybe The Square can revolutionize the restaurant scene instead by actually paying the staff a decent wage, versus banking on the 15%.", 
    "review_date": "2014-02-27"
  }, 
  "cdu04LTyEzG36KBqqkqCQg": {
    "user_rating": 5.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Nick B.", 
    "review_text": "Great spot! The food was incredible. Prices are very fair, especially considering the quality ingredients and excellent presentation. I would definitely recommend The Square to anyone who likes excellent food.", 
    "review_date": "2014-03-08"
  }, 
  "Qzz49HgnsRDYAIguj_0Nuw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert M.", 
    "review_text": "We had not made reservations, and though we got there at 6:00 and the place was almost empty, they sat us at the middle bar saying they were fully booked so could not give us a table.  It had only started to be full when we were paying our bill, so I don't know why they did not give us a table.  Overpriced, noisy, dark.  Interior feels cold and harsh for this warm Italian neighborhood.  Friendly service, but I won't rush back.  There are much more fun places to be in north beach. Food, if a bit salty, was good, but too precious.  I am glad they have Guinness on tap.  That was a plus.", 
    "review_date": "2014-03-31"
  }, 
  "jI_7Olry2n-ZiK6oFqbLOQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nikki G.", 
    "review_text": "Decided to check the new brunch spot in Washington Square.  Loved the dark, distressed wooden floors and rustic walls...but - is this just starting to become the norm in SF?    The food was delicious.  However, I plan on coming back here in hopes of better service.  My two friends and I waited for 20 minutes before we were asked for our drinks/coffee order.  It took over an hour to get our food.  And oh...the restaurant was more than halfway empty.", 
    "review_date": "2014-07-31"
  }, 
  "wruLzteKIsCvekKUZl2EPg": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Tiffany H.", 
    "review_text": "Went there on their opening night and was underwhelmed.    We were served drinks that were supposed to go to the table next to us, as well as the food for the next table.  Ok so it's opening night, maybe I should give them a break.  We shared a burger since we were there for a snack and thank goodness I wasn't hungry or I'd order more!  We got the burger, which was mediocre compared to their competition.  With places close by across the park and a few blocks down on pacific... Maybe I should still give them a break...   Or I can just wander across the park or down mason st for something more solid.", 
    "review_date": "2014-05-07"
  }, 
  "pPlaOTgYD_SEVphTeV7tKw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura D.", 
    "review_text": "My friends and I tried The Square for brunch last week and it was an all around great experience! Friendly staff, good ambiance... $12 bottomless mimosas, strong and good fruity drink choices. Smoked salmon was beautifully presented with edible flowers on top; fruit bowl with fresh house made cream - mix of berries, melons, and what the waitress told us were ground cherries; beignets were light, but big and served with warm honey; donuts with chocolate sauce were dense. I got the pancakes which had fresh blueberries in them, berries and flowers on top, served with house made butter that made me say wow when I tasted it (so rich!) and house made whipped cream... I'm a sweet feen but no syrup was even needed for them they were that good; best pancakes I've had in a long time! Sampled my friend's pork belly hash: fresh peppers, onions, eggs, all good! Only bit of improvement would be to put fresh potatoes in there (they were the freezer bag kind). Over 60% of their products come from the restaurant-owned farm in the Santa Cruz mountains too; they're doing the \"farm to table\" thing well! We'll be back, definitely for brunch, and maybe for dinner too!", 
    "review_date": "2014-08-10"
  }, 
  "5WmMFc-SJIllu77O7svFnQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David P.", 
    "review_text": "They deserve more based on the quality of food, but we have had some really weird service experiences here.  1.) We went here right when they opened with a baby in a stroller.  We were one of two tables in the restaurant.  A hostess came over and in a super bitchy tone said, \"Umm, you're going to have to move that stroller when I seat the table behind you.\"  I'm pretty sure we were inconveniencing ... exactly nobody.  2.) We just called to see if we could order some food to pick up, since we don't want to take up space in the place with a stroller ... and the guy on the phone was totally unnecessarily an asshole.  \"Umm, so we're like not a TO GO RESTAURANT, we umm, like to serve our food HOT\".  It was so unnecessary and randomly passive aggressive that my husband and I were cracking up before he even managed to get off the phone.  So - the food is good - but - seriously?", 
    "review_date": "2014-05-11"
  }, 
  "cGkaVApa14hAZWQCPLB4pA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alison D.", 
    "review_text": "Tried out this lovely new spot on Saturday night. We got there early and we're able to sit right away. The service was very friendly and definitely attentive. We split the tartare - delicious and then had the burger and trout. It was all very good - we cannot wait to go back.  The bar had a very nice vibe - definitely got loud as it filled up. Great addition to the neighborhood - we can't wait to go back!", 
    "review_date": "2014-03-09"
  }, 
  "CFtCdyGi319TOBaSG8x4qg": {
    "user_rating": 1.0, 
    "user_location": "Marin, CA", 
    "user_name": "Gregory C.", 
    "review_text": "Dumb and Dumber!  What happened to this place from the owners of Sons &amp; Daughters?  The chef owners were on the cover of Food Arts recently about sustainable and foraged ingredients and this is their work???  You knew it might be trouble when nobody bothered to confirm your reservation as well no need as there were 5 tables at 7 on a FR night!  No service for a long while and then it was like service by committee...very casual and nonchalant.  The beef tartar was a mushy ground mess as well under glazed pork belly.  The pork chop was so dry I left it uneaten.  The steak had a mush of wet salad in a sweet sauce which was gross.  Pastas had no toothiness and flappy.  Skipped dessert...ran out of there.", 
    "review_date": "2014-08-07"
  }, 
  "Z2ent9nNkGGray_DXHEFTQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick R.", 
    "review_text": "I normally don't use YELP to bitch about a place, but in this case I feel it's necessary.   My biggest complaint about The Square was that they added a 15% service charge automatically to my check. I was alone and seated at the bar. So, they are forcing you to pay a base tip of 15%. This was calculated on top of the tax, so it's actually more than what is customary by some. I complained to the General Manager and he said that they split the 15% among their staff. BFD. What they do with my tip is THEIR business. The amount I tip is MY business. For the record, I normally tip 20%, so this is not about the money, but about principle.   Now, on to the food...(I hate reviewing a restaurant until they have gotten their act together, but since I came on to YELP to mention the tip, I thought I would review the food.)   I eat out all the time in North Beach and have been excited to have a new place open. I stopped by tonight and granted, it was their first night, but the burger was marginal. For the price, I expected better. Park Tavern, Original Joes and Tony's Pizza all have much better burgers and for less money.   I would normally give a place a few times before I write it off, but because of the 15% forced tip, I won't go back.", 
    "review_date": "2014-02-28"
  }, 
  "Rx7DNBmPPShVjlcQidGuTw": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "helen t.", 
    "review_text": "i came here for a group dinner on thurs night, and it was a lot of fun.  they serve dinner til 1, so this is a good place to go if you are looking for a place to dine after going out.  my fave dishes of the night were the chicken liver mousse (served on a yummy flatbread/cracker) and the maitake barley risotto.  we also ordered the seafood stew, rack of ribs, lamb shank, beef tartare, oysters, and kale salad.  the \"feasting\" plates were gigantic and definitely meant for sharing.  the parker roll that was served at the beginning was delicious and had a light hint of fennel and sea salt.  my fave dessert was the rum baba w/ lemon curd.  drinks here are stiff, so be careful!", 
    "review_date": "2014-04-05"
  }, 
  "9MNumsdViMbqwH3LjGRCSw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Elease T.", 
    "review_text": "Yes to the Square! I love that Lil Italy circle but that circle definitely needed The Square. Very inviting. Came in. Read the chalkboard. Seat yourself and order at the bar/counter. Nice selections on the menu. Cool bartenders that made a good ass Old fashion. The food was good. I had the flatbread and fries. My cuz had an awesome burger. So happy that they were open late as many of the good places to eat over there stop serving food early.", 
    "review_date": "2014-09-07"
  }, 
  "IJlX2yIyZ4j-fEBDPMqJNw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arthur S.", 
    "review_text": "I happened into this latest incarnation of the old Washbag because I was in search of a good breakfast.  While the menu was not quite what I was looking for, I spied \"Pork Belly Hash with Eggs and Calabrian Chile\" on the menu.  Now how can a person not order that?  In getting the breakfast (which was great) I learned a lot about The Square...  There is a lot of passion about what they do, from the chefs to the food to the spirits and bar staff and the staff in general.  They really believe they are doing something unique there - and they may well be.  The Square bar area and offerings are special, some classic presentations with some new ones - but not superficially trendy or kitschy, they are doing some interesting stuff.  And the bar staff are flat-out Spirit wonks.  They have put a lot of thought into every facet of the restaurant in trying to create the appropriate vibe - good, fresh, interesting food, facilitating walk-ins and reservations, and keeping a certain 'energy' to the place.  I'm all in on The Square...  I stopped again for dinner and had some of the best lightly-creamed white corn soup ever, followed by pasta with lamb, cherry tomatoes, and fresh herbs.  All served with a fresh roll that came with a concoction of Strauss Creamery butter creamed with yogurt - which I am sure is healthier somehow but nevertheless tasted like frosting.  The coup de grâce for the visit though, even though I did not have it - one of the bar specials listed on the board was: \"Shot of Fernet &amp; Can of Hamms.\"  That's right, a can of Hamms Beer 'from the land of sky blue waters'... sheer genius...  In short, highly recommended.  The food, staff, and restaurant overall are just cool.  In truth probably too cool for yours truly, but that won't stop me from going there again...", 
    "review_date": "2014-08-15"
  }, 
  "_Co-FPjZaTUeVhqpkIYTmg": {
    "user_rating": 4.0, 
    "user_location": "Kapaa, HI", 
    "user_name": "K J.", 
    "review_text": "The one thing that stood out for me at The Square is that the wait help is extremely well-educated about their menu and extremely well-trained. I usually get this kind of service in restaurants of James Beard award caliber. We ordered the Trumer Pilsner, Bundaberg Ginger Beer, Grilled Beets, Pork Belly, Pappardelle Pasta, Cavatelli Pasta (lamb), Pork Chop, and the Peanut Butter Cake dessert--all for $119 before tip. My family raved about the food, but my daughter ended up eating my Pappardelle Pasta because the lamb in her Cavatelli Pasta was too gamy for her. I did not care so much for the Cavatelli Pasta. l am rating The Square 4 stars because my family said it was one of our most memorable meals while in the City. Personally, I would rate the food 3 1/2 stars with service at 5 stars.", 
    "review_date": "2014-09-07"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "Food, wine (syrah), service, ambiance all were great.  Pork belly appetizer and trout were highlights. Well seasoned, cooked, and just plain tasty!  Felt kind of like SOMA more than North Beach. Was good!", 
    "review_date": "2014-05-18"
  }, 
  "7Evw3el_Zayd6OXJjCEkig": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cerseilan T.", 
    "review_text": "\"The Square\" is an apt name for this place, as it describes both the ambience of the place and the personality of its proprietors. They are no doubt rookies who just got into the restaurant/bar business, and they are PARANOID.   I am 26 years old, and a frequent visitor to bars in this area. I had forgotten my wallet, so didn't have any ID on me, and they refused to sell me any beer. Fine - totally understandable. I told my boyfriend to go ahead and get his beer.  It was about midnight, and no one else was in the bar except a visibly drunk group of 3. The proprietors were for some reason terrified that the police would charge in and revoke their alcohol license, and they watched my boyfriend and I like hawks.  After some time I absent-mindedly, out of habit, took a sip out of my boyfriend's glass. The man behind the bar pointed at me and SHOUTED, \"You need to get out. You shouldn't have done that.\" Even the drunk group of 3 were surprised at his tone. I apologized and left - for taking a sip of beer.   I can respect your decision not to sell alcohol if the customer doesn't have an ID. I can never respect your poor grasp of the circumstance and the sheer rudeness of your response.", 
    "review_date": "2014-11-14"
  }, 
  "3SZCT6klYdI81TQrOJOcHA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sung C.", 
    "review_text": "Sweet, sweet spot. And to the first reviewer of this place, you probably shouldn't review a place if you hadn't even eaten there although you're extremely sweet for giving this place 5 stars.  Anyways, this place had a soft opening on Feb. 28th and their hard opening, I mean grand, today (March 1st). We showed up at 5:15 and it was pretty much empty. We were promptly seated at a nice table. I loved the openness of the place. I could tell how experienced the team was by just how already organized they were.   Food:  Beef Tartare with salt &amp; vinegar chips  Excellent, they really thought through this what could've been very underwhelming and boring. They didn't make the tartare all that salty, so the crispy and hardy chips worked really well with the well-seasoned tartare.  Pastrami Rillettes with pickles and mustard  At first, I thought the crostinis were a bit too hard then when spread the goooodness on it, it all made sense. It was a delicious starter.   Trout with goodness-that-I-don't-remember  Holy crap, the highlight of the dinner. The trout was cooked to perfection with great flavors from the sauce. I inhaled this dish and actually forgot what was in it but who cares!  Guinea Hen with sunchokes and broccoli  Another highlight of the dinner (am I even allowed to say this?). The vegetables were very delectable. The sauce really complemented and brought the whole dish together.   Rhubarb and pistachio galett, whole milk ice cream  This dessert will take 30 mins of prep time, so order it ahead. This was a great dessert. It really is what it sounds like although the salt made this dessert a whole different thing. Who doesn't love rhubarb anyways? Especially, if you can only get them during this time.  Devil's Food Cake, caramelized cacao and grapefruit  Yum! This is rather a small dessert, but it was packed with decadency and flavors! I loved this dish.  I really hope this place succeeds.. I could tell how much they've put into this restaurant.  I believe the chef Moriarty was working in the kitchen tonight, so I knew I was in good hand when I saw him.  Added notes:  I am not 100% sure if they added the 15% default gratuity to our bill. we ordered a total of 11 items (2 starts, 2 entrees, 2 desserts and 3 cocktails) and it came around about $140 total.. which is pretty reasonable? I should've double checked. I wonder if they don't automatically add the tax if your total bill is over an x amount..", 
    "review_date": "2014-03-01"
  }, 
  "EVaW-GGDEbYrYhgGUmO0DQ": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Karen H.", 
    "review_text": "The food and service were both excellent.   Started off with the salt and pepper fries-who doesn't love fries. I wish it was just a little bit crisper.   The bread they give you on the house is so yummy!  Beef Tartar w/ salt and vinegar chips-my friends said they loved this, but the salt and vinegar chips were a little too much  Love the pork belly with mustard seeds. Tender and full of flavor.  Pardon peppers-love these.   Smoked trout toast-one piece, but it is super tasty.   Corn soup w/ some fried thing-very filling. Sweet and salty. Had the perfect balance.  Mushroom pappardelle-light, but full of flavor  Steak-this wasn't bad. The potatoes it came with were super good. The steak needed more seasoning, but it was cooked perfectly.", 
    "review_date": "2014-09-08"
  }, 
  "oxWDdDsCOEIYZHa1YpPAOA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jane S.", 
    "review_text": "Went to The Square for Sunday brunch with some out of town friends. I picked The Square because of the buzz around it and the rave reviews of the food. I was sorely disappointed (!) for the following reasons:  1. The service was not good. We waited for about 20 minutes after we sat down for someone to even come over to our table. Service throughout the meal left much to be desired.  2. THE FOOD! It was awful. I couldn't even believe it. I ordered the potato hash. When it finally came out, the eggs were so cooked, they were like burnt rubber. The yolk was so cooked, it was like a hard boiled egg. The potatoes were so smooshie, they were almost like mashed potatoes. And the spinach was so overcooked, it was like slime.  I will say though, my friends' dishes were semi-ok, but still not the best. It was very disappointing considering I was very excited to eat there given all the buzz, but I will definitely not go back.", 
    "review_date": "2014-11-17"
  }, 
  "U4INQZOPSUaj8hMjLlZ3KA": {
    "user_rating": 2.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Michael U.", 
    "review_text": "Items Selected: Verve Coffee Parker Roll with Butter Crème Fraiche Gougeres with Dill and Chives Slow Cooked Pork Belly, Dark Hill Egg, Brussel Sprouts Blackberry Tart with Orange Fizz Geranium Ice Cream Roasted Strawberry Cream Puff Aerated Chocolate and Peanut Butter, Pansy Dusted Shortbread  Located on Russian Hill and conceptualized by the team behind Sons &amp; Daughters it was following a long walk after dinner at Quince that I stopped in at The Square and although one particular plate proved amongst the best I experienced during my six days in the city little else about my experience proved memorable save for the amicable service and excessive decibels.  Limited in menu with a focus on the bar it was just prior to 9:15 when I entered the renovated wood amidst brick space and finding the restaurant filled to perhaps half capacity beneath the glow of naked bulbs a seat was procured, orders soon to follow with a focus on small bites and desserts.  Deferring on cocktails and instead opting for coffee that would prove both luke-warm and acrid it was with a single buttery roll and cultured butter that the evening began and progressing onward to a 'snack' and an 'appetizer' the gougeres would prove far too sour for my palate while the tender pork belly topped with crisp ears was a perfectly fine savory, though largely forgettable save for peppery bitter notes lent by a fresh radish.  Moving onwards to desserts it was for two of the menu's three selections that I opted and although the well-buttered tart was tilted too far savory in by an aggressively alkaline ice cream the follow-up cream puff was nothing short of dazzling - the choux pastry lightly coated with sugar while ethereal cream played soft balance to Northern California's always impressive strawberries with a light smokiness tickling the palate in each bite.", 
    "review_date": "2014-06-19"
  }, 
  "CqVM1P-jjY7wy52K6gEqow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roxanne D.", 
    "review_text": "Love this place!!!!! Great food. The tater tots with jalapeno aioli are amazing!!! AWESOME STAFF!!!!! CJ was our bartender. He was incredibly accommodating  and made great recommendations for items on the menu to try. I had a blast. Lots of beer &amp; shot specials and tasty cocktails. It's the perfect place for casual dinner and/or drinks with friends.", 
    "review_date": "2014-11-23"
  }, 
  "_uIZ-f5sOoHCEyI-bOGD-g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sanil S.", 
    "review_text": "i kind of quit writing yelp reviews but wanted to give a shout out to the \"sons &amp; daughters\" team's new venture. in a word it was: great. from the addictive warm olive snack, grilled beet salad, succulent grilled pork chop and outstanding piping hot  berry filled gallette for dessert: all were top notch.  front of the house and service were spot on.  add to this we did a byob and a couple of glasses of dessert wine, we were more than satiated.  our good karma even extended to the following incident. a couple of couples came in dressed in shorts and baseball caps and i must say smelling like they had a long day doing whatever it is tourists do. they sat down at a four top next to us clearly feeling out of place and self-conscious. after looking at their menus for a brief period they got up and left. now it doesn't get any better than that, does it?  seriously, check it out, it's outstanding.", 
    "review_date": "2014-06-04"
  }, 
  "rO2YKN1PqAJjd6YgP0PM0A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen S.", 
    "review_text": "5 stars for the best Manhattan we have ever had - made with Templeton Rye. I wish I knew the bartender who made it last night (UPDATE: James made it (not that we don't love Jax too). The apps were good - tried the fried oysters, olives) but the dinner food &amp; service was just ok. Tried the seafood for two, burger/fries &amp; ribs. The bread roll was very overrated :)  Will definitely come back for happy hour &amp; apps.", 
    "review_date": "2014-04-13"
  }, 
  "vNasIeIJzFQT3c2rleSJRA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yum N.", 
    "review_text": "I was so excited to try out this new restaurant. Sadly, it didn't come close to living up to the hype. The drinks, the food, the service... all awful.  The drinks: I had a manhattan on the rocks. It was really, really bad. So bad that I gave it back. The response from the bartender was a shrug of the shoulders and she was off to the next customer. No apology. Nothing.  The Food: If I were to compare it to the standard tourist food that is typically found in North Beach, then the food was average. But, this isn't a tourist spot and they compete with Park Tavern across the street. 0.5 stars on the overly salted, not very hot and bland tasting dinner I had.  The service: Aside from being rushed through my meal... oh wait, yeah, that about sums it up.   I won't be going back anytime soon.", 
    "review_date": "2014-04-21"
  }, 
  "Hj_GF8MnikDy4BQzf0B8Dg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meredith K.", 
    "review_text": "Like the new space but the food was just ok.  We shared a bunch of items: chicken liver mousse, fries, ribs, and I can't remember the rest.  Service was great but maybe it was too early to give this place a try.", 
    "review_date": "2014-05-28"
  }, 
  "34zkdVuRbYNUUP0eyZesGQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa P.", 
    "review_text": "I was extremely excited for this new neighborhood joint to open up.  In general I would say it's fine (especially since it's so new).    We had: The carpaccio (highlight of the meal) which was rich and delicious The asparagus- ok The steak- husband felt it was a bit bland The burger- good but not memorable (certainly wayfare and park tavern have it beat hands down). cheese plate for dessert  I didn't find it as loud as some of the others commented- even for a saturday night.  The service was attentive- although I found it amusing that the waitress indicated they are \"famous for our small plates.\"  Um you've been open for a week how are you famous for anything?  But I digress...  All of the food was absolutely fine- but nothing blew me away.  And the prices all seemed slightly too high for what we were getting- not insanely high- just slightly too high given the portions are relatively small and my burger was pretty unimaginative.  I wouldn't be opposed to going back, but I won't be rushing there either.", 
    "review_date": "2014-03-10"
  }, 
  "5movf4njIHTuBOl9zNX7Iw": {
    "user_rating": 5.0, 
    "user_location": "Newton, MA", 
    "user_name": "Jonathan W.", 
    "review_text": "As a neighborhood local: fantastic!  The space nor the menu seem special, but the food and flavors were inventive, top quality, and hit the spot.  Service was stand-out professional and engaged.  A refreshing new competitor to Park Tavern across the park... hopefully the full booking and 1.5 hour wait settle down.  And food til 1am.", 
    "review_date": "2014-03-14"
  }, 
  "m1jzeTBPmQZ1ojxHUz4scQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lizzy U.", 
    "review_text": "Decided to try The Square as it was new to North Beach and the location is so convenient from downtown -- easy walk post work. The food was all good but prices were really steep. There were two of us, we split an app, a salad an entree and each had a glass of wine and the bill was $100 which seemed pretty high to me. Like I said the food was good but it was nothing to rave about.   The environment over all was super quiet, looks like they had a bit of a hard time filling the restaurant, given it's a big space and i was there on a Wednesday but it still seemed pretty empty. Our waiter was nice and attentive, he definitely had a good knowledge of the menu.  Honestly I probably won't be coming back, for all the amazing food there is in the city I think you can find better food at a lower price elsewhere. Unfortunately, there was nothing really noteworthy about my experience here.", 
    "review_date": "2014-07-30"
  }, 
  "_eJaJbPhyH14O8VN77wjgQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael S.", 
    "review_text": "Disappointing. Quite expensive for submedocre food. Everything was boderline flavorlesss. The seafood for 2 people dish was laughable, but the price wasn't funny. Bland and seafood for one, not 2. Spend your money at Park Tavern a block away instead. Same style, same price point, executed way better.", 
    "review_date": "2014-08-08"
  }, 
  "wqBDS-TzAVpREaOZ17jhVA": {
    "user_rating": 5.0, 
    "user_location": "San Luis Obispo, CA", 
    "user_name": "Jeff F.", 
    "review_text": "<a href=\"/redir?url=http%3A%2F%2Fbomb.com&amp;s=bb4f996415a9c2f21137e27cfb68f439a48cec2652b53e9b50dd7e766dbe177e\" rel=\"nofollow\" target=\"_blank\">bomb.com</a>...  The service was out of this world.", 
    "review_date": "2014-05-31"
  }, 
  "PVpeB-fTAd5qi1vxDTSehw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S. M.", 
    "review_text": "Excellent food. The seafood stew, despite the price tag, has the most delicious broth combined with the roasted cauliflower &amp; artichokes - it was pure perfection. I have been craving it since. Service was good, fries were great and the portions are way bigger then expected for a 'fancy' new SF restaurant. Try this place out - the food won't disappointed.", 
    "review_date": "2014-06-07"
  }, 
  "kkptW1c7RrsKrzI0u34Glg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren D.", 
    "review_text": "I'm very surprised by some of the negative reviews of this place...but that's San Francisco for you... ;)  I have been to The Square for dinner twice now and both times I have been extremely pleased with the experience.  I live a couple blocks away and The Square is turning out to be a perfect new addition to the neighborhood.  I love the ambiance - very cozy, simple, and beautiful.  The service is impeccable and each member of the waitstaff I've encountered has been extremely helpful.   First off, I'm a big believer that you can judge a restaurant by their bread...the bread here is ridiculously good.  Each person gets their own house made rosemary bread to start.  It's served warm, not too heavy, and pairs perfectly with the salted butter.  Last night they offered us an additional piece and we graciously accepted. :)  To start I would recommend the warm olives, beef tartare (when it's on the menu), and the kale salad (I'm not typically one to order a kale salad at a restaurant but this one is awesomely refreshing).   For entrees, the risotto with trumpet mushrooms is fantastic but I would say my favorite is the baby back ribs with polenta and the cucumber salad.  The baby back ribs are to die for and the polenta and cucumber salad were unexpectedly good sides.   Also - last night we tried the kennebec fries with garlic aioli. I don't believe they were on the menu the first time we dined but I highly recommend.    So basically my conclusion here is: great neighborhood spot with amazing food and great service.  Happy to have them as a new addition in North Beach!", 
    "review_date": "2014-05-09"
  }, 
  "JSPE5bMOg6rAKvKVEdfIXw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alita M.", 
    "review_text": "I'm still standing by my verdict on the dinner entrees not being impressive. I've gone back again and this time had the cheeseburger. Not only was it one of the most poorly formed burgers that fell apart after one bite, there was something in the bread or meat that gave it an overly sour flavor. It also was overcooked, no where near medium rare.   There is something added to every dish that just is one beat off what the flavor profile should be/wants to be. Such a bummer, but still great drinks and service!", 
    "review_date": "2014-09-12"
  }, 
  "5aAIOnGhrqkfTkX6b6BA7w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine S.", 
    "review_text": "Well, now I see that The Square has completely changed their menu and their restaurant experience since I was last there.  I don't get it.  You get a choice of small plates to share, and then if you are still hungry, you have to share a \"feasting\" plate. The feasting plate could be a guinea hen, a rack of ribs, a rabbit, or a lamb shank (all in the $50-$70 range). Too much sharing in my opinion.  My taste is not necessarily my companion's taste, and at these prices I don't want to compromise.", 
    "review_date": "2014-04-12"
  }, 
  "KIs_TYHxRnbfCF6PQNC8Sw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Diane S.", 
    "review_text": "We went to The Square for our anniversary last weekend and were thoroughly impressed!! The wait staff was well informed on the menu and attentive.  The atmosphere was great, and we loved the energy of the restaurant.  A lot of fun!  The restaurant was completely full, but we did NOT have a problem with it being too loud (as other reviewers noted).  As a matter of fact, my husband has trouble hearing and it wasn't a problem for him at all to hear our conversation.  We loved the beef-tartare and chicken liver mousse. The \"For Feasting\" part of the menu was plenty for 2 people.  We had the whole rabbit and it was delicious!   We were stuffed, but did get dessert!  YUM!  We had a wonderful time and really enjoyed the food.  We didn't mind the service charge and even left an additional tip because we were so impressed.  The waitstaff worked very hard and made sure we were pleased with EVERY detail.  Even with the drinks they brought us.  We will be recommending it to all of our friends and family.  Can't wait to go back!", 
    "review_date": "2014-04-10"
  }, 
  "JzyLlmML9u4vsLo5DsXJQg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian B.", 
    "review_text": "Brunch was delicious!  The tortilla in my ranchero eggs had just the right crisp, and my friend's mushroom omelette was a revelation in how good unusual wild mushrooms can taste. Much of the food is from the owner's own farm in Santa Cruz, which is super cool. Great attentive staff too.", 
    "review_date": "2014-08-03"
  }, 
  "sOMhmdxxRPbolQ2hmFZJqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve E.", 
    "review_text": "A great addition to Washington Square - food, service and ambiance are all on high standards. Being Italian, I really appreciated the \"al dente\" pasta, it's a rarity on these days. It tends to get hot inside, so you may want to pick a colder night to try it. Albeit it serves breakfast as well, I feel it's more appropriate for dinner.", 
    "review_date": "2014-07-29"
  }, 
  "XxTf-dF1lfOBgLGV-mbyfg": {
    "user_rating": 4.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Vince C.", 
    "review_text": "New room is gorgeous.  More open than before. Try the pork chop, top notch. Real good service and open late. Get there!", 
    "review_date": "2014-05-03"
  }, 
  "oAJAQNBaBDnB7G5tItCvAA": {
    "user_rating": 5.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "M. L.", 
    "review_text": "I rarely write reviews but felt compelled to do so for this gem of a place!    It's one of the handful of places that I know of where you can get amazing food on a Sunday at midnight.  The decor is classy but relaxed with warm woods, leather booths, and a gorgeously lit bar.  We had the barley risotto (great balance of extra density because of the barley vs. typical arborio rice with a touch of zestyness and smokiness from the mushrooms) and Guinea hen (well balanced flavors and very juicy).  The portion sizes were suitable; just enough so you're not uncomfortably stuffed if you have no self control but definitely not left still hungry!  Their wine list is quite good as well.  If you blindfolded me and told me they had a Michelin star, I would have believed you--on par with places like Range and Commonwealth.  Maybe the best part of the meal was the service.  Our server, Julianna, was such a delight; a great mix of humor, warmth, and attentiveness without being overbearing.  It's been a long time since I genuinely enjoyed my server so much.  (Coming from a person who used to manage restaurants, I can say this with quite a bit of conviction.)   I would say the 15% service fee is fair; they hold themselves up to a certain standard and to attract great servers, they need to be able to offer them something other places don't.  15% is pretty standard anyway.  Most people tip between 15-20%; this just makes the math easy!  (Sometimes, the patron would make a calculation error and tip under 10% = not satisfied with the service, and it seems wrong to punish the service staff for silly math mistakes.)  I never understood why people got so up in arms about  calculating the gratuity % before or after tax.  If most people claim they tip 20%, calculating the tip after tax makes marginal difference.  15% of the 8.75% sales tax is a measly 1.3%!  If you spend $100 and are bothered by tipping your hard-working service staff an extra $1.30...  The only thing is, I was trying to tip more than 15% but wanted the extra to go to our server, whom I thought did most of the work.  My husband works just down the street, so the next time he works late, I know exactly where to kidnap him to for dinner :)", 
    "review_date": "2014-03-12"
  }, 
  "8Io3kh3e22akC6MsuMMPWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine L.", 
    "review_text": "Review is for drinks and dessert: Jackson behind the bar was incredibly welcoming, generous and friendly, and the friend whom I went with and myself want to go back to visit The Square mainly for the chance to run into him again :) He gave us a taste of nasturtium-infused gin (omg sooo good) and some other mixers he's been making from scratch, and was very knowledgeable of The Square's offerings (we had the ice cream sandwich and the grilled strawberry dessert, both were delicious). Excellent bar service, I'll go back again!", 
    "review_date": "2014-07-27"
  }, 
  "nR91y6KbMbaKEix8_8BoyA": {
    "user_rating": 5.0, 
    "user_location": "Oldsmar, FL", 
    "user_name": "Roshni S.", 
    "review_text": "We came here because it was the closest restuarant near us that was sit down after walking mile from our hotel. The prices are very reasonable. The ambiance is nice and the place looks clean with cool decor.  The staff is very friendly with good service.  The food portions are decently big.  Even the small plate was enough food.  My husband got the egg sando and loved it.  It's big so it's a little hard to control but definitely delicious.  I got the SF pancakes.  The sourdough is thick but the apple butter and maple syrup compliment each other very well.  Overall, for the service, price, quality of food, portions and ambiance this place is a winner! What more can you really ask for? I would come back if I was in SF a lot.", 
    "review_date": "2014-09-14"
  }, 
  "qPmLHLKkcdsQxRlpQCizdQ": {
    "user_rating": 4.0, 
    "user_location": "La Crescenta, CA", 
    "user_name": "Carol K.", 
    "review_text": "Excellent service and really good food.  I like the sleek modern interior and layout.   There is only a small selection of food on the menu.  I'd recommend going for drinks and snacks since the entrees are pretty small portion-wise.", 
    "review_date": "2014-06-30"
  }, 
  "Wola-un_r8aaTsT2xOOMFg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "NewtoCali M.", 
    "review_text": "I'm a fan of the food and the service.   We sat at the bar, and had excellent service throughout our appetizer and burger entree.   The burger and fries was quite delicious.   They are more than happy to let you sample some wine before making a choice, which is always delightful before getting stuck with a glass that you don't prefer.    What I'm not a fan of is the 15% service charge.  While it does mention the service charge on the menu, it would be easy for people to miss on the bill (as there is a line for \"tip\", as opposed to \"additional gratuity\").  I think that the 15% charge is fine for larger parties, but we were only a party of 2.   Typically, we like to tip 20-25% on good service, so it's not the amount that turned us off -- more that if you weren't either looking at the menu closely, or at your bill, you could easily miss that the service charge was already included -- I imagine some people would end up double-tipping if they weren't careful.  I think that the servers should mention the service charge at the end of the meal, in good faith and to avoid having upset customers.  But all in all, if you are aware of the service charge -- it's a good place, good vibe, great service and good food.   So it is definitely worth checking out if you are looking for a new place in North Beach!", 
    "review_date": "2014-03-24"
  }, 
  "bdJpZBluXBba22vImfCYZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Grace K.", 
    "review_text": "We ordered the broccoli rabe and pork belly/Brussels sprouts as appetizers.  The broccoli tasted good with lots of garlic but it was overly salty.  Same with the pork belly...good flavor but very very salty.  The homemade bread was delicious, probably the best part of the meal. We had the crispy chicken as an entree  The chicken was  indeed crispy and pretty tasty but the grilled lettuce which accompanied it didn't add anything.  Overall, the food was okay but not terribly memorable.  I'm glad I tried the place but don't need to return.", 
    "review_date": "2014-06-30"
  }, 
  "JiIM2gCgb957U6WGjg-48Q": {
    "user_rating": 5.0, 
    "user_location": "Thousand Oaks, CA", 
    "user_name": "Sierra V.", 
    "review_text": "Great food-location-service.  *Must try item- beef tartare with salt and vinegar chips.  The Parker house roll you get complimentary is amazing, served with this soft salted whipped butter.  Must go back....", 
    "review_date": "2014-04-01"
  }, 
  "ZvLs57lN2YhT-m2yHnUpwQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charee L.", 
    "review_text": "This was a disappointment the first time and we went back three more times and was even less impressed.  The menu really has nothing affordable..they had a mediocre burger and they have even eliminate that....I live in the neighborhood and would not go back...over priced and poor menu selection...was looking for a place to meet friends for drinks and  food after work...this is NOT it...", 
    "review_date": "2014-06-09"
  }, 
  "t1yDC3FJB9zdR2F9N0-Z2w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "d p.", 
    "review_text": "Salt &amp; Vinegar chips withe the beef tartare?  Brilliant!  The chips make the dish.    Guinea Hen.  You must get the guinea hen with sunchokes and broccoli.", 
    "review_date": "2014-03-01"
  }, 
  "ZSeZ4kvaowFkr2c_1V-f8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "emily c.", 
    "review_text": "bomb.   as nb locals my roommate and i were stoked to see something promising like The Square open where Bottle Cap never quite got it right. we decided to check it out on opening night. we walked in without a reservation around 9p and although it was definitely popping and crowded we were seated right away. lucky girls!  bread and drink service came promptly and I personally enjoyed the super soft mini rolls. we ordered the steak tartar and the kale salad to start. both great but i don't think i'll ever pass on the tartar from here on out it was that delicious. we were feeling meaty so we split the cheeseburger &amp; fries. delicious! it came out perfectly split on separate plates - part of what that 15% service charge gets you.  definitely looking forward to visiting this neighborhood spot again soon and often!", 
    "review_date": "2014-03-06"
  }, 
  "aDaNqz0NesxYoA9RXBJNbQ": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Reese G.", 
    "review_text": "Awesome drinks and breakfast. Apple Puff pastry was amazing, along with the shrimp and grits...so buttery and tasty. I wanted to order everything on the menu! I highly recommend this place. Short and sweet menu, great comfort food.", 
    "review_date": "2014-11-02"
  }, 
  "cSNER_qF_bb1t7kN0kZ44Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina L.", 
    "review_text": "I was excited to try this new restaurant in SF, but was disappointed in the selection of food, the dishes, and the price.   I came with one other person and we shared 3 dishes:  Gougeres, Fromage Blanc &amp; Chive ($8) - I normally love these, who doesn't like cheesy bread? This was filled with too much fromage blanc / cream cheese, and just too heavy and rich for my taste. We each had one of them and left the rest. I wouldn't recommend this.  Barley Risotto, Green Garlic &amp; Maitakes ($16) - This was the best dish that I had here. The risotto was made with barley, and it was creamy, flavorful, and not overly garlicky. I liked the mushrooms that topped this dish. We finished all of this - I would recommend getting this.  Whole Pan Seared Trout ($24) - Compared to all the other meats on the menu, this was the most inexpensive of the bunch. We weren't super hungry, so we passed on all the feasting dishes, which were $50 - $70. For being an entire trout, this was a pretty good value. The fish was fresh, flaky, and was stuffed with herbs / garlic. It was pretty strong on the garlic, but in general, it was a good dish.  Our entire meal (including 2 cocktails) came out to about $70. I did like my cocktail, but wasn't overly impressed with the food here compared to other places in the city. Maybe I needed to have come with more people to get a larger variety, or to get the feasting plates. I'm glad I tried this place, but wouldn't go out of my way to come back here again or recommend it to friends.", 
    "review_date": "2014-04-09"
  }, 
  "ORxSz94hR0bSl1zS1LuuOw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa T.", 
    "review_text": "Omg this place gets loud! It was a Thursday night and my boyfriend and I wanted to check out the new neighborhood restaurant. We sat promptly at 8pm and had a window seat as requested. We barely could hear each other, especially over the (most likely) marina boys dropping the C word in every other sentence.   The fish was a small portion and way over priced. They ran out of the ribs. Cheapest glass of wine was $11.   15% charge is odd. Does they mean you only tip 5% more or do they want you to pay an additional tip on top of the 15%.  As a local I will most likely not be back...Unless they have a good brunch or happy hour menu to try.", 
    "review_date": "2014-03-08"
  }, 
  "gFBjPA0ZFZXdkQUUAoeSfQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeffrey S.", 
    "review_text": "Review is for dinner. The bread and butter is amazing, asked for seconds, and that was my favorite part of the meal. Everything else was decent:   -steak tartar: standard, but texture was odd and needed more seasoning. It seemed a little pasty. -pork belly: ehh,  good nothing to call home about  -pasta with lamb: lamb was good and well cooked, but would be better paired with a pappardelle or different type of pasta. The pasta was undercooked and crunchy.   Although the food was not phenomenal, the atmosphere was fun, the service is good, and the cocktails are great.  Not dying  to go back any time soon. If you're looking at this spot head across Washington square (500 yards) to Park Tavern (same owners and way better)", 
    "review_date": "2014-07-25"
  }, 
  "trClj15P1dxVlKo6AcjXgw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul M.", 
    "review_text": "I live a few blocks away and had high hopes that this might finally be a place at this location that sticks around.  However, in two visits I have been quite disappointed.  II sat at he bar and had drinks once and had dinner on my second visit.  The service is downright amateurish, including the bartenders.  This place needs some adult supervision, as in an onsite manager. Each time I wanted something I had to practically wave my arms to get attention.  I ordered a drink during happy hour (a Moscow mule) and no one had any idea how much it would cost (one time it was $5, another $12).  The bartenders seemed to treat the customers as an annoyance.  As for the food, well, in a word it mostly sucked.  The \"hand rolled tater tots\" were huge masses of potato which just tasted like mush.  Almost everything on the menu was fried and bland.  Whoever is doing the menu is not much of a cook.  Sadly, the food across the street at the Rogue is better and that's not saying much.  I don't see myself going here again.", 
    "review_date": "2014-11-17"
  }, 
  "S2qvRVfSD6sw6b4rtGFJ2Q": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Too M.", 
    "review_text": "officially the worst restaurant in san francisco. everything was awful. the service was just bad. our waitress didn't know anything about the menu, or service in a restaurant. she kept on bumping into me, she forgot to put the order for the food. cocktails were so bad we had to return them, i had better cocktails on a flight. food was terrible. not interesting to begin with and just didn't taste good at all. and for all of that we ended up paying much more than what the food there is worth. i'm not going to be back. just not worth it.", 
    "review_date": "2014-05-04"
  }, 
  "pux3tZ32Am3qU20LVxAFWA": {
    "user_rating": 5.0, 
    "user_location": "Sanger, CA", 
    "user_name": "Jake P.", 
    "review_text": "Great Food!  Service a tad slow but it was worth the wait.  Great bacon and the sourdough toast was fantastic.  Very San Francisco!", 
    "review_date": "2014-07-20"
  }, 
  "NMNauN3TXZapniWfQ6rYFw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela L.", 
    "review_text": "After wandering from FiDi to NB for over an hour looking for a non-packed, walk-in taking restaurant on a Friday evening, we stumbled upon The Square. I was actually looking for Bottle Caps, learned that it was closed, and didn't realize that this place took over till I read some of the reviews just now. It was packed when we walked in but luckily on the bar side of the restaurant a table had just paid we literally waited for 1 minute instead of 180 minutes.   The food was good, not the greatest I ever tasted but I was definitely satisfied. We had the guinea hen and the trout. The portions are pretty small.. if it weren't for two pieces of free bread, and our \"free\" order of beans (which were a little TOO SALTY - also, free is in quotations because when I come to think of it, I feel like they charged us although we didn't look too closely at the bill), I think I would have still been hungry after dinner.    Service was very attentive. A little over compensating. They kept apologizing for us waiting so long, but we didn't even think we had been, which got a little blegh.   Overall, I enjoyed my experience, but probably wouldn't frequent this place.", 
    "review_date": "2014-03-17"
  }, 
  "pGd3fzv1jWE-nnFj9QHy_A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Roman B.", 
    "review_text": "Absolutely exceptional food and service! Lovely neighborhood restaurant with a great atmosphere! Most of the ingredients are self-grown on the biodanamic Dark Hill Farm - wonderful concept! Constantly changing menus make this place a location to come back and back again. Amazing restaurant in the North Beach Neighborhood", 
    "review_date": "2014-07-26"
  }, 
  "a1gpp6NErV-qBcrB6PlA1g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susan L.", 
    "review_text": "Third time here. We came for brunch on a Sunday morning and had hoped for the same brunch menu as last time. Nope! It changed. We were sad to see the fried chicken with biscuit and gravy gone from the menu. I ordered the farm egg sandwich and my husband got the pork belly hash. You know its bad when you say the fries are the best thing.   Egg sandwich - big piece of roll with stuff in between. My egg was cooked over medium. Who eats a sandwich with yolk running everywhere? The bacon was mediocre with a huge slice of tomato and some arugula (like 3 pieces). I didn't eat half of it  Pork Belly hash - it was mostly potato with a few pieces of pork belly and a lot of egg. Did not taste good at all. My husband said it was bad  Service = horrible!!! They never refilled our coffee or water until we were done and never came to check on us. This place isn't packed since i am sitting here writing this review right now  In the end, we are taking it off our list of places to eat and not recommending.", 
    "review_date": "2014-10-26"
  }, 
  "7B2btJ-1YZ9oKrE_xeV_gw": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Alex B.", 
    "review_text": "Strong food choice, beer selection is solid. Great neighborhood spot. Great lighting.", 
    "review_date": "2014-10-09"
  }, 
  "4MzhTjmU8G8yUsIAa_omlw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Buddha B.", 
    "review_text": "This place is a self service restaurant with $16 burgers. No service, plastic cups w/ paper napkins, sub-par food, no atmosphere and no customers (see the pic I uploaded take at 7:30pm on a Wednesday night).", 
    "review_date": "2014-09-03"
  }, 
  "RSCmugPhh2R5tJOAYklzdQ": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Christine M.", 
    "review_text": "Amazing restaurant, fabulous food will definitely go back for more.  The menu is fresh, innovative, interesting and different.  Every dish we had was enjoyed by the entire table.  Great location and cool space.", 
    "review_date": "2014-03-08"
  }, 
  "D5uMny1pAVWhNGDvFDPp8g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "DeathandFood b.", 
    "review_text": "A very packed and busy neighborhood joint with good service and average food. Not destination dining but sure to be popular with the Marina and Pacific Height Crowd.  Food- upscale American  1.warm olives-pleasant but forgettable 7  2.Fried Bean-I had thought they would be tempured green beans but they were garbanzo beans and very tasty 7  3.Steak Tartare- very traditonal and unseasoned, didn't seen hand cut but tasty with an egg yolk on top and salt and vinegar chips 14  4. Fennel soup-this had the most interesting flavour and the server divided it into two bowls since we were sharing without us even needing to ask.  5. Asparagus with whey foam and speck- this was a disappointing with six tiny spears with a cream from whey.  6. Barley Risotto 14 this was a hearty risotto with a wild mushrooms on top in a pretty presentation.  7. complimentary bread rolls and sparkling water.  Overall the food was good but not exceptional.   Service- was excellent especially for a place open such a short time. The host station always had a person there. The bussers were almost too efficient. The server took it upon himself to make all the dishes were shared and was good about answering questions. The restaurant has a 15% percent flat service fee which the French Spouse likes but I think means that people probably wouldn't tip on top that. The service charge was done before tax not after as Patrick R. claimed.  The biggest negative of the place was the noise. Even with some sound panels on the ceiling, it was incredibly loud with a full house.", 
    "review_date": "2014-03-05"
  }, 
  "xMNS7Ryl1ptKLE9Ki5Zw1Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "I was too hard on this place at first. I'm coming around on it.   It's missing something though. I can't quite put my finger on it. I'm thinking maybe a few games of some sort, perhaps some live events and a better sound system.   But the people are nice and it feels very neighborhoody. I'll take it.", 
    "review_date": "2014-10-25"
  }, 
  "gayfgxrWRmnJoQZCqP4RpQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Aric Y.", 
    "review_text": "Came here on a weekend night. Was a little apprehensive of the prices since the restaurant looked pretty new and like a lot had been put into the decor. Surprisingly everything was reasonable, especially for SF. I ordered the burger and a beer, my friends got some of the other house favorites. Everything was spot on tasty. I'd classify it as high quality comfort food a la San Francisco. I would definitely come back here again the next time I'm in SF and get adventurous with my menu choice.", 
    "review_date": "2014-07-16"
  }, 
  "NRQ7RN_opFn_q3aB80vJMg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "e v.", 
    "review_text": "We tried this place for the first time and are pleased to have the addition to the neighborhood. The service was friendly &amp; not overly intrusive. The atmosphere seems to be a distinct upgrade over the previous tenants.  To start our meal, we split some oysters, which were served with a wonderfully bright champagne &amp; shallot dressing which really played well against the brine. We also tried their tartare which was a touch underseasoned but that was made up for by the salt &amp; vinegar chips that it accompanied it. For entrees, I had the guinea hen, which was a nice size, well prepared, and came set on a delicious sunchoke puree. My husband went basic and tried the burger, which was very tasty and held it's own against the other options in the neighborhood.  We definitely plan on returning, next time to split the crab for two! The Square earned a place in the rotation of our neighborhood spots.", 
    "review_date": "2014-03-09"
  }, 
  "IwS23TY4UtOIehxnYekCOg": {
    "user_rating": 1.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Mason H.", 
    "review_text": "No stars! Second time trying The Square and didn't even get to order due to wait staff. I've not seen service this bad in SF! It was Sunday at 1pm and the place was virtually empty. Walked out due lack of service. Hope you have deep enough pockets to keep this 'white elephant' alive. Good luck!", 
    "review_date": "2014-10-19"
  }
}