{
  "zmJRExWKAHykzzabi_Y93A": {
    "user_rating": 5.0, 
    "user_location": "Lake Balboa, Los Angeles, CA", 
    "user_name": "A M.", 
    "review_text": "Great place security offices were great staff was great the girls were sexy and not pushy and the drinks were nice and hard..", 
    "review_date": "2015-01-15"
  }, 
  "OXYtOFX9xXukagW5Ku5dfg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sofia R.", 
    "review_text": "My roommate and I were walking around when the bouncer or whoever told us we could get in without a cover fee. So we did.  We didn't really take a look at what we were walking into but I figured it was a strip club. My roommate didn't. Her reaction was the best.  The place is really big and has an old classic look to it. We weren't particularly interested in the strippers so we walked straight to the bar.  Check in and you'll get a free drink (but it's limited to beer, wine, non-alcoholic). I got a glass of their house chardonnay and my roommate got a White Russian ($8...meh). Bartenders are pretty chill. Drinks were whatever.  Strippers are everywhere (obviously). They're pretty cool. They're not aggressive unless you want them to be. We were just watching them.  Anyway, we were just there to kill time but the place wasn't bad. An experience!", 
    "review_date": "2012-03-21"
  }, 
  "5uj3ieQBITykIysin0aMAQ": {
    "user_rating": 5.0, 
    "user_location": "Sebastopol, CA", 
    "user_name": "Misty C.", 
    "review_text": "Love the staff and managers. Always great to go to a club that appreciates the customer and goes above and beyond. We always go with a group 6-10 people and have a great time. There is no other club in SF we go to that treat there clients (been there)like family.  You want a gentlemen's club that makes you feel like more then a customer go to the condor", 
    "review_date": "2014-04-27"
  }, 
  "c--TE-tUiQomDvHKyGHFTQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "One Black Mans POV.. ..", 
    "review_text": "Bachelor party...2nd stop.  Better than \"Hungry I\" around the corner.  Stripper said 20 girls were working that night.  Well only 3 of them had cute faces and nice bodies...the rest were not cute.  All of the strippers were pretty laid back.  A couple cute ones even came and sat with us for a while.  Plenty of space to sit.  French fries were good.  Dancing wasn't great, so I didn't seperate from one of my 20 dollar bills for a dance.  Although one girl inspired me to give up a dollar...cuz she worked that pole like seasoned pro.  Atlanta strip clubs are 10 times better than out here...so my standards may be a little to high.  Security was pretty chill too.  They let us in for free and didn't even make a big deal at the end of the night when the sh*t-faced bachelor climbed on stage and started dancing on the pole.", 
    "review_date": "2009-03-09"
  }, 
  "YwaKGmRNnSa3R3N4Hf9jLw": {
    "user_rating": 4.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Paolo D.", 
    "review_text": "We stopped in here during the day i.e. before it's a topless club.  The band playing at the time were absolutely insanely good.  They call themselves Los Diablos de Amor and are completely worth checking out.  Overall, this seems like a cool place to kick it and get a few drinks.", 
    "review_date": "2009-10-12"
  }, 
  "Z88N6qly3Dp5C06XbZ9IMQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice C.", 
    "review_text": "I don't know which is worse the stripper who looked like she was high on drugs and couldn't work the pole right or the MILF with stretch marks.   Swear on my boss' life that I only ended up here because they were playing Justin Timberlake's Suit and Tie!  I really dug the chick who could do the wooty with her legs in a split, so I made it rain here on a Sunday night.  Happy freakin birthday, Peter.", 
    "review_date": "2013-02-27"
  }, 
  "nYufXwZH9ooB_zjNJf8Xlg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Morris D.", 
    "review_text": "Came here on a Saturday afternoon maybe around 1-130..there was a me, my lady, the bartender, 3 guys playing music (no set list, they just appeared to be \"jamming\" ) and a funny looking German tourist with a red handkerchief around his neck. Very casual. Anyways, it was just a really laid back, fun atmosphere. Anymore people would have probably ruined it. We saw that Carol Doda pic. We both agreed big asses must not have been nearly as popular in the early 70s..I can imagine that this place isn't nearly as fun or eclectic at night. As with most things I review I recommend going during the day...", 
    "review_date": "2011-04-29"
  }, 
  "Kx4RtLVvwFuH2F4hWKB0ig": {
    "user_rating": 5.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Crystal H.", 
    "review_text": "My first strip club!! $5 jagerbombs on sundays! We came here on vday and got the $25 couples package that included a bottle of wine and a table. I was about to be let in free by the bouncer, but we told them we wanted the couples deal. It was a bit dead when we went around 9pm, but got crowded after an hour or so.   girls- alright looking, very friendly. Some will ask if you want lap dance. Only like 2 girls really could work the pole. The others just shake their booty, crawl, dance in front of the mirrors, hold the pole and dance around. I really liked this one girl who could really work the pole and did some sexy lap dance moves. She had a petite body and kinky when she performed on stage and private lap dances. She put the tips i put down on the stage and tucked the money in my bra (i dressed up for their lingerie event, but i was the only one who dressed up). She then took the money from my bra with her mouth. It was cool. She did other kinky stuff during our private lap dances in the back room, but those will remain unsaid. ;)  private lap dance for 2 people is $60 and $10 outside lap dance (stage area) They played pretty good music too! It was a 2 people for 3 songs special night for $60.  I noticed this couple in front of the stage. The woman looked drunk and kept cheering the strippers on and was like dancing.   overall, interesting experience. I had 1 lap dance from this tall blonde chick and 2 from the petite girl. Sadly, I don't remember my 3rd lap dance because I was wayy drunk.", 
    "review_date": "2010-02-16"
  }, 
  "Mw2tHGDn3Ec5NNYAm7J_Bw": {
    "user_rating": 5.0, 
    "user_location": "Gardena, CA", 
    "user_name": "T D.", 
    "review_text": "Starla- all I can say is she is AWESOME. I went in with my boyfriend and she waited for us to get up from stage and was very happy to give us a couples dance. She has the best attitude and is super cute with her all natural/ Bettie Paige look. Definitely recommend. And this club is pretty cute. We were expecting a total dive but the place is very cute with a lot of history.", 
    "review_date": "2014-04-21"
  }, 
  "40pYoBJA9rcoXPZqWGyyfg": {
    "user_rating": 3.0, 
    "user_location": "Berwyn Heights, MD", 
    "user_name": "Sara M.", 
    "review_text": "The Condor Club is a name attached to groundbreaking history in the adult entertainment business - the original club in the location was purportedly the world's first topless and bottomless entertainment venue (which only lasted for a few years, until California made full nudity illegal in establishments that served alcohol).  The club hasn't been there continuously (it changed hands multiple times, re-opened as a sports bar, etc.) but now it is the Condor once more!  A friend and I got in for free on a slow night, and checked it out.    It's a pretty typical dive-y club, located alongside the others in North Beach with blaring neon signs.  The inside is dark and provides plenty of corners for suitable anonymity.  The main stage is large, with a mirrored back wall and a nice tall pole for acrobatics and such.  There are tables and chairs at varying distances from the stage, depending on how much you want to get into the action.  As with any club, the dancers vary significantly in body type, style, talent, and how engaged they are with their dancing and the audience.  While I was there, I saw three performers.  One was alright, doing the sway-and-pose.  The second seemed totally disinterested in being there, and I'm not sure that anyone tipped during her two songs because she seemed so bored!  The third performer was pretty spectacular - a woman with a curvy, all-natural body, very gymnastic and clearly having a good time on stage (or really good at faking it).  She was wonderful to watch, and I sort of wish I'd stuck around to watch her when she came up again.  I didn't pay a cover, but the weak gin and tonic I had was $6.50.  The waitress was friendly and pretty prompt.  The DJ was completely unintelligible, never could understand what he was saying about the dancers or specials.", 
    "review_date": "2011-11-18"
  }, 
  "vRziAXWI72nOFWNml4ldMA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hyung L.", 
    "review_text": "Friday....happy hour.....I'm at the Royal Exchange and the following convo happens trying to figure out the next destination.  \"Let's go to Broadway\"  \"cool where?\"  \"what about that sports bar on Columbus and Braodway\"  \"man it's been awhile since I've been there suuure lets go\"  \"Yah it's a tapas bar\" (our friend actually said topless)  So we get there pay 5 bucks to get in and its a strip club! What the hell happened to the sports bar. lol No small plates of food...the game wasn't playing...and it's really dark....super \"affectionate\" staff. lol So we stayed, drank, ate and were just all around merry.", 
    "review_date": "2008-07-21"
  }, 
  "4uRUhLEf8XX78FZOUwR0hQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Peter B.", 
    "review_text": "I really cannot complain.  I've been to several strip clubs near here and else where in SFO and Condor is the most laid back I've been too.  I really like the bar area.  You don't have to be at a \"strip club\" you can just sit down have a drink, talk to some people while the occasional hot girl walks by and looks at you ready to strike up a conversation.  It's unlike any other club I've been to.  As mentioned else where another great benefit is the diversity of the girls - w o w.  You can go here, have a great time and not spend a lot of money on girls with restraint of course.  Just drink and have fun if you like.  The place is clean and friendly.  The mens restroom could be larger and that's my only complaint but it does have the broadway girls like dude helping you clean your hands.  An unnecessary touch of high class.    I would suggest managers of such clubs develop a way clients can actually dance with girls and not just get a lap dance.  Money's talking.  Bravo.", 
    "review_date": "2008-11-18"
  }, 
  "52gLFIvBeiCwxsxHV1SLyg": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Ramon M.", 
    "review_text": "The best strip club in the world. Teamcondor is what it's about. I love my family. LET ME GET A JAMERSON!!!!", 
    "review_date": "2014-12-27"
  }, 
  "u3vubrtJ4yKX9IRItOf5nQ": {
    "user_rating": 5.0, 
    "user_location": "Raleigh, NC", 
    "user_name": "C. L.", 
    "review_text": "I've been to strip clubs across the country and Condor has the most welcoming staff and dancers ever. Like most strip clubs, it's changed a lot in the past year, and the current manager, Mark, is awesome--he's hospitable and honest and will go to great lengths to make sure you are having a great time. Not an easy strip club find! It also looks like he's done a lot to make sure the dancers he hires are equal parts professional, witty, and beautiful. Every night is a great show, with a variety of dance styles and, my favorite, the super-tall pole that dancers will climb up and suddenly drop down. I also think it's cool that they have bands play there, though I usually don't get in early enough to catch the music. One more thing on the to-do list!", 
    "review_date": "2014-04-20"
  }, 
  "9_dHJM9z0Pn_4W8v6u4fSg": {
    "user_rating": 4.0, 
    "user_location": "Rodeo, CA", 
    "user_name": "Meena N.", 
    "review_text": "I actually had a good time here.  The drinks were pretty good, and when I asked the bartender to surprise me, he did well.  Drinks are reasonably priced and there's an awesome happy hour that goes on as well. The girls- well you can't really judge since they always change. Although when I went, this girl.. she wasn't hot- she was beautiful and for SOME reason when she asked me if I wanted a lapdance I blushed, became all shy all of a sudden and shook my head while i squeaked a meek \"no thank you\"   I like the fact that this place has a lot of history, and I kinda like how you can tell.  The decor- plush velvet seating, dark and dim screams... i don't know..  old-time sleazy.. which I love.  I like how at this place the girls don't push it for you to buy a dance.  They ask, and they leave. They don't hustle you like other places do.", 
    "review_date": "2010-10-13"
  }, 
  "zo4Y3qadH45LF1UVez1SuQ": {
    "user_rating": 2.0, 
    "user_location": "Reno, NV", 
    "user_name": "Bryan L.", 
    "review_text": "I LITERALLY stumbled into the condor after dinner in NB expecting to see the live music Condor i remembered a year or so ago, and to my surprise, its now titty city.  Never shy, my wife and i stayed for a drink and we found the staff to be very friendly and nice, the place is clean, but...and i repeat BUT, what a let down on what the place could have been.  My point is that the Condor is one of the true cool buildings in SF with a gigantic history dating back to who knows when.  Carol Doda decended from her piano in this very building and rather than make it a cool retro chic place, they have taken the parchment walls and leather booths and somehow classed it below a crappy sports bar.  It is presently a crappy feeling, disjointed, strip club with no ambiance.  I actually think that you couldnt make less ambiance if you tried...short of folding chairs.  With such a perfect pallet, history, reputation, and the busiest location in north beach, how can you not create the premiere gentlemens club experience on the planet?  If youre going to go the boobie barn route, at least make it impessive.  That area has plenty of 3rd rate strip clubs, how about an upscale one???  Take another swing at it guys...see if you can whip it back into shape.  WBV", 
    "review_date": "2007-09-10"
  }, 
  "fSf5tu9u_luRvX0QTCw_lA": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Fatima Valentine H.", 
    "review_text": "Happy Halloween!  Great atmosphere.  Friendly staff. Fun and amazing performers.  India is the best!", 
    "review_date": "2014-11-01"
  }, 
  "UfqIsZEbqUNnirMECANy-w": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Ying L.", 
    "review_text": "The Condor Club is great. It's more than just another strip on Broadway, it is a historical landmark,  being the first legal strip club in the United States and maybe the world. The interior is elegant with vintage style decor and old photos of former dancers including the legendary Carol Doda.  I actually lead a tour through the club to tell visitors about the history and some ghost stories attached to this place (one of the most bizarre deaths in SF history occurred here).  The manager, Mark, and other employees were super friendly and accommodating. They greeted all the guests and showed them around. Everyone came out impressed. In addition  to the dancers, they also have live bands and food. The Condor Club is a must see if you're in the North Beach area.", 
    "review_date": "2014-04-13"
  }, 
  "fEoBk3QxwDp38drtjndYhA": {
    "user_rating": 3.0, 
    "user_location": "Chino, CA", 
    "user_name": "marlon e.", 
    "review_text": "boobs!!!!   boooooooobs!!!!!!  boooooooooooooooooooooooooooobs!!!!!  booooooooooooooooooooooooooooooooooooooooooooooobs­!!!!  who doesn't like them?   squeeze those things!!!!   mmmmmmm  mmmmmm  mmmm  mmmm!!!  fantastic!!!!!", 
    "review_date": "2013-02-10"
  }, 
  "PlRQBvaBCEkZeetp9QUNXg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie N.", 
    "review_text": "The Condor Club is the worst part about living in North Beach. They play terrible live music on the weekends and all their windows open. You can't escape the bad music. Never will I ever enjoy a nice a Saturday at home. Thanks a lot, Condor.", 
    "review_date": "2010-09-18"
  }, 
  "PBV2ogZm4BHPQcvT3KvYtw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lily H.", 
    "review_text": "The best club in the city! The manager is super friendly, the women are beautiful and love what they do (it's always an amazing show, especially on Friday/Saturday!), and they have drink and dance specials.   I've been to The Condor a few times and went last night with some friends after the Giants game. We ordered bottle service and the welcoming attitude I received from all employees ensured I'll be back--this is my go-to Gentlemen's club in SF!", 
    "review_date": "2014-04-11"
  }, 
  "dGy6LmfgfJyftpcHVkPtEw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick B.", 
    "review_text": "Wooo Bachelor Party Stop Number One! What idiot suggested we go here?  This club is old and dirrrrttttyyyyy (not in the good way). Free to get in because we had a big group of guys! Then it was downhill from there.  We were all pretty apprehensive looking around. This was supposed to be a fun night and this place just has that cheap vibe. The first girl we saw hitting the stage was okay. No offense to Jason B but I like when the girls strip to Motley Crew and Van Halen.  But aside from her decent looks she could not dance worth a $h**. A quick glance around and we were all in agreement - it was time to bail.  No thumbs, no snaps, no coming back.", 
    "review_date": "2011-10-16"
  }, 
  "dQ2_iKvhr1Rhe1nbgn-cIQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pratik J.", 
    "review_text": "This is a nice place to spend some time after the whole day work. It has a nice bar and I liked it.", 
    "review_date": "2014-08-01"
  }, 
  "elwrpxz0-0N5LQ2BeH9HxQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "andrew p.", 
    "review_text": "This place is great! Excellent service from the door, to the bar, to the girls. Everyone was very helpful and friendly. The doorman was really cool and friendly. When we finally got to the bar everyone was all smiles and they gave the place a real party vibe. Finally, the girls! Not only were they super hot, but they were fun! None of them made me feel awkward or uncomfortable and I definitely had a great time! I highly recommend The Condor Club!", 
    "review_date": "2014-04-16"
  }, 
  "YAyg7eXAsoSHEe5Z45Z1EA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sarah s.", 
    "review_text": "one stripper was so flexibile she can lick herself.  nuff said.", 
    "review_date": "2008-02-17"
  }, 
  "ODSH1it5oAUPu2clIgOvyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Phan H.", 
    "review_text": "Came here on a friday night at around 2am, and we made it for last drinks. The guy at the door were nice enough to let us in without a cover because we were veterans, which is always a plus in my book. The place is huge and the drinks were relatively cheap. The girls weren't too pushy, they'll leave you alone if you aren't specifically looking for dances. I can't remember much due to me being slammered and I had my girlfriend with me so I couldn't oogle as much hahah", 
    "review_date": "2012-03-03"
  }, 
  "LnKKecZoHzfOBUUAsjYIpg": {
    "user_rating": 3.0, 
    "user_location": "East Oakland, Oakland, CA", 
    "user_name": "Rosie D.", 
    "review_text": "Very nice bar and the doorman waz very nice but the bartender suckz at least the one workin last night, not too many people there and i still waited a long time to even get her attention for a drink", 
    "review_date": "2014-08-20"
  }, 
  "zDltf7SGyDANcA6ndZkF7A": {
    "user_rating": 2.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Julia N.", 
    "review_text": "Wandered in here after a long day at work with a friend thinking it was just some dive bar in North Beach. It had really nice big open windows with empty tables sitting in the sun just begging us to sit in them.   Oh hey, there's a stripper pole. Nice. We ordered a beer and sat near the window with light streaming in; I was nice and toasty and loving my Corona. Ahhhh  Suddenly the owner came by and said that it was time to close up the curtains. We had just sat down so naturally we were disappointed. They closed everything up and suddenly the bar that we were thoroughly enjoying turned in to a nasty, dark, dank, tacky, strip joint with pervy dudes sitting at the bar. Half naked women were walking up and down the stairs; it was very brothel-like.  I'm all for a good peep show but this place just kinda creeped me out.", 
    "review_date": "2009-08-11"
  }, 
  "mnrbVt8DZOhSyu-b5uEEJg": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Travis G.", 
    "review_text": "I went to the condor club on this past Monday and I was absolutely blown away. First off they had a gigantic pole where there was a stripper who climbed all the way to the top and literally walked on the ceiling and wall. It was amazing. After which there was a classy cabaret show with a fucking rocking live jazz band, so great. Not only were the woman extremely sexy, but they were also funny and interesting. It was like each girl had an image to portray. The belly dancer rocky was amazing, never seen anyone move like her. Kinder had amazing costumes and outfits. Astrid was absolutely alluring. Franky had this beautiful steam punk sort of look to her and was an amazing short haired beauty. They gave away prizes, they had funny skits in between. This club was an experience that I will never forget. On top of that, I'm in the navy and was hoping to show my other friends in town for fleet week the show. Even though he said it was in not a monthly thing, their general manager, mark, told us to give him a call and he would get as many of the girls together that he could to put on another show. I was blown away by the level of customer service by someone who really cared. I love this place and will miss it when I leave. Please do yourself a favor and check this place out.", 
    "review_date": "2014-10-07"
  }, 
  "ijpRP-xcbAtzE-Y-EVjEhg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cat of a Donut J.", 
    "review_text": "Well hello :) Hell yeaaaah!", 
    "review_date": "2008-08-22"
  }, 
  "k-1x3GizSFR7wU-HMtNxKw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kathy M.", 
    "review_text": "Hot hot hot! Strong drinks, friendly bouncers, and sexy ladies. I'll definitely be back, especially for another lap dance from the amazingly gorgeous Astrid! This is also a great place for couples. The ladies are treated with respect and I really liked that the bouncers sweep up the money for the girls and help them down from the stage. Its little touches like that that set a place apart. The club itself is really amazing inside - its pretty much a San Francisco institution and has lots of different areas to hang out. The bar/lounge is cool if you want to just have a drink and be casual in your boobie watching, while the main stage gets you up close and personal with your favorite dancers, plus lots of cozy little corners for private dances.", 
    "review_date": "2014-04-05"
  }, 
  "fdVCBVz4VWLo2bMbPsco9Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fong L.", 
    "review_text": "Correction to the 2 other yelpers before me, MAYLEE, the half japanese, half irish girl, had the best rack I'd seen ALL DAY.  Damn, that strip club crawl was pretty epic.  so yeah, it used to be a strip club, then it became a sports bar, and well... deja vu bought it, and now it's a strip club again.  After chatting with Maylee, I found out that the dancers at the club were pulled in from other Deja vu clubs around the city (hustler club, showgirls, gold club, etc).  Which made sense, since most of them didn't seem too happy about being there.  But at least the girls weren't all about the hustle, like they were at some other clubs we were at (ahem SHOWGIRLS ahem).  These two twin blondes from vegas worked the pole really well, but when a couple in our group wanted a lapdance with both of them, they disappeared--what's up with that?  turning down money.... weird.  Anyway, the layout was unfortunate.  The bar in the middle looked really awkward.  And the stairs in the center (probably going to the dressing room for the girls) looked like it belonged in a bordello of old.  The poledancing stage was a little awkward too--not quite large enough to house the people, but at least it made the dancing a little more \"intimate\" haha.  The far end of the bar is where the lapdances took place, and it was mostly empty all night--probably because they had only been open 3 days.  They had curtained off booths which looked strange, cause there wasn't space for lapdances there.  weird.  anyway, it all seemed like it needed a little better planning.  not too bad overall though.", 
    "review_date": "2007-08-10"
  }, 
  "isEMO0Bc75iPhFoX7NPMog": {
    "user_rating": 3.0, 
    "user_location": "Lafayette, CA", 
    "user_name": "Molly M.", 
    "review_text": "We use to work there and lets just say management needs an attitude adjustment.   The girls are very nice &amp; there are a lot of talented young women  But, please the women there are people and nobody likes to be judge as if they are property...or WORK FOR FREE!!  FYI the girls there do NOT get a paycheck.  They pay to work there and let me reiterate, they do not get a paycheck.  So if you aren't planning to spend $$$ don't go and stop complaining!!  Aside from management we had blast there and the place is great!", 
    "review_date": "2009-02-07"
  }, 
  "M8dNOqlI6rKsyV1WAF4K4A": {
    "user_rating": 5.0, 
    "user_location": "Frisco, TX", 
    "user_name": "alicia w.", 
    "review_text": "I just want to throw it out there that this place is a hidden gem. It's North Beach, a tourist spot, so the drinks aren't bottom of the barrel cheap, but they have tons of specials, just ask your bartender. Usually it's Kat or Erik. The manager, Mark, is also extremely friendly and helpful. The staff is top-notch! If you want the ideal experience, be nice to the girls, and for God's sake, tip them! Those girls work hard and as it's been said previously...they don't get hourly. If they look disinterested, it's most likey because people are acting like it's a free show. My favorites are Luna, Michelle, Marisa, Stella, Milana &amp; Ryan. Lux is full of dry humor and moxie. Head in if you want to be entertained, not offended. :)", 
    "review_date": "2012-01-20"
  }, 
  "0ajZG54RehstP0IEQC-9-A": {
    "user_rating": 5.0, 
    "user_location": "Rohnert Park, CA", 
    "user_name": "Jack P.", 
    "review_text": "It's a sports and topless bar. The ladies are friendly and hot. Going back to watch the UFC.", 
    "review_date": "2014-04-25"
  }, 
  "USUwr9Q-8HQhcRTr-UJqCA": {
    "user_rating": 4.0, 
    "user_location": "Silver Lake, Los Angeles, CA", 
    "user_name": "Sarah O.", 
    "review_text": "Like other reviewers, I too stumbled into this place not knowing it was a strip club. My friend and I were drinking in Chinatown, decided to wander over to North Beach for some food and this place looked really cute inside.   The manager was super friendly, sat us in the bar area and even bought us drinks. We had nachos, which were exactly what you'd expect at a strip club. Delicious nasty cheese sauce. The food did take a bit longer than usual but it's all good, we were enjoying the view anyhow. The girls are really cute, and really sweet. Not your usual tore up looking strippers, these girls are young and attractive.   The decor is really nice, clean bathrooms, and I love love love the main stage area. It's very old school and classy, more like a burlesque old fashioned type of stage.   My friend ended up losing her keys that night and went back to the Condor the next day to see if she left them there, negative, but she said they had a live band playing that night. Sweet!", 
    "review_date": "2010-01-11"
  }, 
  "2SJAmxoJzy8koAa9jxegrQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Suzette R.", 
    "review_text": "I went to the Condor one random night and got a few drinks with some girlfriends. It's a cool spot, live music and good strong drinks! The bartenders were not bad to look at either...However, I don't know why I'm a total douche bag magnet, this random guy came up to me and asked me for a kiss? What the hell! Right? So I told him that my boyfriend wouldn't appreciate it and that his breath was totally rank! So then apologized and walked away! True story...honesty is truly the best policy!", 
    "review_date": "2008-10-13"
  }, 
  "y2rRYrUEFo4WdE-oCTrLBg": {
    "user_rating": 5.0, 
    "user_location": "Richmond, CA", 
    "user_name": "Loliana J.", 
    "review_text": "My fave strip club on Broadway hands down! The girls are talented and the drinks are strong. Plus, it's a historical landmark. Most of the male staff is super cute too, which is a bonus. So. Go!", 
    "review_date": "2014-03-18"
  }, 
  "aSdhqGDbEvyP7vHf8GuiXQ": {
    "user_rating": 4.0, 
    "user_location": "Culver City, CA", 
    "user_name": "-kiko- S.", 
    "review_text": "The dancers here are so chill and fun to talk to. Really sweet ladies. The Condor is one of my favorites. Lots of different types of girls (and way cute alt girls too!). Girls of different races and sizes, so there's someone for almost everybody. I get bored at clubs where all the girls look the same, but Condor isn't like that. The only thing I don't dig is the music. I think the DJs have to play stuff that represents the club's \"image\". Other than that I like the atmosphere. Neat vintage-y decor.  Just so you know, strippers don't get paid a wage. They actually have to PAY the club to be allowed to work. So don't be a douchebag- if you're not going to get a dance, at least tip the ladies. And contrary to popular belief, strippers ARE people. It's not necessary to be rude or talk shit if you don't like a particular dancer. And don't waste their time. They're at work. People seem to think it's easy money, but it's not. Even the most gorgeous girls have to WORK for it. So if you go in with a good attitude and are nice to the ladies, they'll show you a good time. :)", 
    "review_date": "2009-08-23"
  }, 
  "sXLAy83l7EwdZjsYFbaq0A": {
    "user_rating": 3.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Kara B.", 
    "review_text": "Got to see a golden retriever bang on the drums... Or, was that a young man with a Bieber hair-doo, wearing a red Neckerchief? Anyway, I thought it was really cool that the band let him join in on their little jam session. He was pretty good.   Didn't see any bodacious tatas, or any tatas for that matter, as we visited in the middle of the day.  I've walked by this place on many, many occasions in the evening and I have to say that it wasn't as skeevy as I thought it would be. The side entrance looks just like a regular bar (somewhat burlesque-y/saloony in décor). And the bigger room off the main entrance looked like a dark burlesque-y restaurant (actually, it kind of reminds me of Spaghetti Factory's decor - fancy brothel), complete with booths, a stage, and flat screens encased in gilded frames... classy.   If you're in the area, you should check it out. Too shy? Check it out in the daytime. But, It's not touted as the first topless and bottomless entertainment venue for nothing. It's the original \"gentlemen's\" club... soft core since '64!", 
    "review_date": "2011-04-29"
  }, 
  "lLP4DsGr6qESHzcxgfhfUg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Lexi B.", 
    "review_text": "I sure as shit didn't plan on stumbling into the Condor Club. It just...happened.   I was at an another innocent evening at Nick's Crispy Tacos (I explored the $2.00 quesadilla aka fried tortilla sans cheese). I was hanging out with a friend from out of town, when her dad pops up from out of no where and whisks us away on an \"Urban Safari\". What is an urban safari one would ask? Me, in the back of a zebra print-painted truck wearing a safari hat while being forced to sing \"In the jungle the mighty jungle the lion sleeps tonight\" while my friend's dad cracked jokes about his ex-wife. Personal. Hell.   Anyway, after visiting the giant red balls at 101 California (insert cheesy joke about \"giant red balls\") and walking around Union Square in a pith hat praying to god I didn't see anyone I knew, we ended up at the Condor Club. Strange, yes. Sober, completely.  Her dad proceeds to tell us one of the urban legends from the 80s surrounding this place. I like the way the bouncer told it to us, though:  \"So the manager was fucking one of the dancers on top of the piano. And this piano wasn't any normal piano, it was this super tricked out one that lifted and lowered from the ceiling for special shows and shit. Well he's doin' her right on that thing, and rumor has it that he embezzlled a shit ton of money or something. They think one of the other guys whoops and hits the switch and the piano goes up in the ceiling, crushing him. And he was really fat, so the chick was totally fine. It was murder for sure.\"  After laughing at this wonderful display of storytelling (oral tradition didn't die with the mesopotamians), he lets us all in to actually see the piano.   I walk in and see a very flat-chested stripper doing a pole dance on the main stage. I immediately wonder if my less than gratuitous rack could earn a buck or two. Damn those student loans!  We go to the main bar and get hollered at and welcomed by the bartenders--which was reassuring! Then we make our way to the piano.  Sparkley and white, it still hangs from the ceiling. Who knew such deep history could be found in such a hedonistic place? I gotta say, for this reason, I like the Condor Club. I really do. It's trashy, it's dark, it's got a story. It's not just your run-of-the-mill strip club. Hedonists enjoy!", 
    "review_date": "2008-12-10"
  }, 
  "6QN6BdpcDKXNS9Xq_7pECQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "came in last friday night after HH. the place is laid back and chill. the girls were also chill too. big ups to the door man.", 
    "review_date": "2012-10-15"
  }, 
  "re3AdczLFP4D7xwI6DkBNA": {
    "user_rating": 3.0, 
    "user_location": "Santa Cruz, CA", 
    "user_name": "Vicky T.", 
    "review_text": "Stage stuff is meh... the one of one is hilarious   We got comp'd so getting in for free was nice...   This was stop #1 on the bachelor tour.... The girls were nice enough and the bachelor got a warm up for the rest of the evening", 
    "review_date": "2011-06-05"
  }, 
  "OIbOu-zpL10KKtGb1IylzA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John G.", 
    "review_text": "Holy skank, batman.  hell. no.", 
    "review_date": "2008-03-09"
  }, 
  "khFA0eLpu7H08JOWtiVF8w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa B.", 
    "review_text": "99% of the girls here had nothing that screamed \"sexy\" to me, and the layout of the space was very unfortunate. It seemed very slapped together - just like, well, let's add strippers to the mix, no thought about how to change the space.   One star goes to the half Japanese, half Irish girl who, as Fong said, had \"the best rack he'd seen all night\".", 
    "review_date": "2007-08-05"
  }, 
  "Og7crXafAfnJhGmuCncDfg": {
    "user_rating": 4.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "Bart F.", 
    "review_text": "Been here twice in the last year to celebrate two separate friends ritualistic rights of passage..[aka Bachelor Party].   The girls were extremely friendly and the entire establishment seemed well run and organized--meaning that they hoovered my savings account in its entirety. Alcohol mixed with a strip club transforms me into Adam \"Pac Man\" Jones without the 4.35 40 yard dash speed and the most important part: an NFL contract. Next time I am leaving my check card in the hotel room. Hey, but at least my money went towards stimulating the economy, right?  riiiiiiiiiiiiiiight.", 
    "review_date": "2009-03-31"
  }, 
  "EzyPw3uvjXj9w-uBm9p2GQ": {
    "user_rating": 4.0, 
    "user_location": "Carmichael, CA", 
    "user_name": "Anna M.", 
    "review_text": "I love the Condor. By day it's a nice bar with great music and great food. And at night the titties come out. What more could you want? I think they have some of the best pesto alioti. I highly recommend it.", 
    "review_date": "2013-03-18"
  }, 
  "3FhKeCWr8RvqLs3FmYqaCQ": {
    "user_rating": 5.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Ian G.", 
    "review_text": "Still the best club in SF.  Great surroundings, reasonable prices and a friendly management crew.  The girls vary depending on what you want, and what you like, but I've never met one who isn't friendly.  Pretty non-pushy, and great to chat to.   Ember is the one to get the dances from - classy, intelligent and sexy - what more do you need ?", 
    "review_date": "2014-09-28"
  }, 
  "Le0qh1Ell3xQACosmNVmsg": {
    "user_rating": 2.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Jimmy W.", 
    "review_text": "Overall the bartenders are terrible, not friendly and try to overcharge. Lots of the dancers are nice and friendly, most are decent looking, don't expect Playboy models.", 
    "review_date": "2012-11-02"
  }, 
  "mbHLycG2UXsEkcAUJ3TEkg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marc V.", 
    "review_text": "OK! Next Kitty Chow produced show is Jan 26th and me and my opossums are definitely going to attend. If you've half a brain (no more, no less) then you'll be there too. We look forward to a night of fun entertainments, great management staff, and spot-on service.  Go ahead: shelve your 20th century neo-Victorianism and come out and see a real show. There was, after all, a Rome!  Darned fun entertainment. Be sure to bring dollars to tip.", 
    "review_date": "2015-01-16"
  }, 
  "veLWPGA-1MMtcRNDYWm-BA": {
    "user_rating": 5.0, 
    "user_location": "Healdsburg, CA", 
    "user_name": "samanta v.", 
    "review_text": "Note the fifth star on this rating is cause the founder (Carole Doda) is my cousin.  - not that she's involved anymore, but her photos are on the walls, and without her, and her club - well I wouldn't be here (cause that's how my mom met my dad...)  but enough about personal history.  Took a group of guys visiting me from Mexico here in January - we had a great time.  At the time I thought it was still a sports bar ... but I (and they) were pleasantly surprised to find it not)    The girls were nice, they weren't pushy.  The music was kickin, the table was comfy and the drinks were strong.   I should deduct 1 star for the soundsystem sounding like it had blown speakers, but then several of the other clubs we hit that night sounded the say way - so I guess it's par for the course.  I wish they would make it more retro again, long ago it had an amazing vibe, and yes, it still has an amazing vibe - but it's different.  There is a lot of history (and ya I'm a little biased) in this joint, and they could certainly parlay that into big $.", 
    "review_date": "2008-07-18"
  }, 
  "--nzd5tLbZOJ-fIykURMrg": {
    "user_rating": 5.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Calvin S.", 
    "review_text": "recently had one of those hangover (the movie) kind of nights.   blacked out completely so i cant comment on my experience at this club but.. after waking up in a dark alleyway in sf the following morning i realized i could not find my iphone 4s. chalked it up as a loss and figured id never find it. a buddy of mines calls my cell phone (unaware that id lost it) and the manager answers. they actually have my phone right now and will hold it for me until i pick it up tomorrow, how spectacular is that!?  ill definitely bring business back to this place  next time im in sf, just hope i remember my experience next time! hahah", 
    "review_date": "2013-03-18"
  }, 
  "m_tYT7FLoGg5qlTfI86LdA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "KD M.", 
    "review_text": "Workers of this place like to read their negative yelp reviews and message the patrons about how great THEY were and how much YOU sucked. The customer is always...wrong? Don't even bother with this joint.", 
    "review_date": "2011-12-18"
  }, 
  "zxmIKyEX89aY0QLC1JJksA": {
    "user_rating": 5.0, 
    "user_location": "Manhattan Beach, CA", 
    "user_name": "One T.", 
    "review_text": "This is one of the best strip clubs I have been to. It is not all polished and slick like a Spearmint Rhino or something like that, but that's the allure. It is a no-nonsense place to come get buck wild. The girls are fun and cute and just want to have some good times. One side of the place is a full bar, and then the other side is the main stage. So it's a cool set-up as you can just go kick back at the bar if you feel like it. Do youself a favor and check this place out pronto.", 
    "review_date": "2013-10-01"
  }, 
  "tpoCYXjLnX9immGWZpYptA": {
    "user_rating": 4.0, 
    "user_location": "Belmont, CA", 
    "user_name": "Alana H.", 
    "review_text": "I don't know why I love the condeezy so much, but I do.  It's actually a decent spot to have a drink and i've been here plenty of time with just my girlfriends. They always have some kind of special and ladies are free to get in. Anyway, i'm not into strippers but they're not too bad in here either. The bartenders are friendly and the drinks aren't watered down. If you're in the area and want a drink I really suggest going here.", 
    "review_date": "2012-03-17"
  }, 
  "b5fM9Jz88y1YNTmM_57zzg": {
    "user_rating": 4.0, 
    "user_location": "Westmont, IL", 
    "user_name": "David S.", 
    "review_text": "This was my last stop of the night after going from strip club to strip club on columbus street. I came to the door and the guy at the door told me it was $10 to get in and I asked if there was an ATM machine inside he said yes but its an $8 ATM fee and he recommends to go use the one across the street where its only $3 fee, nice of him to give me the heads up, Went across the street and came back, sat down at the bar and had a beer and within 5 minutes a girl came up to me and started a conversation and asked if I wanted a dance, she told me the price list for everything and since I spent just about all my money at the other clubs I just opted for 2 dances for $60 (it starts $40 per dance) She was cute and friendly but had absolutely no tits which is disappoiting but whatever. Gave a good dance, went back and finished my beer and left because it was already at last call. Of all the places I went to that night on that street filled of clubs this is the only one I would return to. Simple, sort of reasonable prices, clean, good bar service, all good looking girls.", 
    "review_date": "2013-08-26"
  }, 
  "FHBJVspRL2o21FAEOE7ivg": {
    "user_rating": 2.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Cy C.", 
    "review_text": "I can here with a good friend of mine on a whim.  We just ate at the King of Thai (awesome place btw), and we were walking up and down Broadway looking for some *ahem* entertainment.  We saw Condor because they don't have a cover free before 7 pm so we were like oh cool and plus $5 draft beer for Bud Light.  It changes each day I believe.  We got in and I asked for that draft beer.  Hostess said no that's only for Sunday.  I was like what the heck!? You have a sign outside that says so and your valet/bouncer said the same thing.  But I didn't want to be too much trouble so I just said I'll get a rum and coke and so did my friend. The music sucks to be honest.  I want some nice upbeat, almost club like music to get the girls all hyped up to dance.  But we got old school rock that almost put me to sleep.  At the back of my mind, I was expecting to get rick-rolled or something by the MC. So now on to the dancers. There was only 3 dancers when we came by so we all watched them perform twice.   First dancer was ok, Kiki's her name I think, she did her thing and she got some tips from us.  She has excellent butt that looks like a peach and it was oh so good to look at. Third dancer, Michelle, was phenomenal!! All she did was took out her rag, doused it with rubbing alcohol and started wiping down the pole.  I was like, oh sweet, I like a hygienic stripper.  But she did it in a very sexy and seductive way and the tips started coming in before she even danced.  Then she started climbing that pole all the way up and came down all spinning and doing crazy pole gymnastics.  I was like daaaaaang, *throws dollahs* She was awesome and though she's a bit petite, I really like her. The second dancer . . . . ..well she's gonna be forever be unnamed by me.  I'll just forget her and just focus on the positives instead, ok?  Place is quite dated and stale for me.  The bar section is a lot better than the stage and all I only spent 3 minutes to compare the two.  I personally think Gold's Club is a lot better venue than this.", 
    "review_date": "2011-12-03"
  }, 
  "r3zHn3p68fChU4XNJz0_YQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lawrence F.", 
    "review_text": "I just went there yesterday and it is the best topless bar on Broadway. No Cover between 6 and 7 who could ask for more? Very cute showgirls. Check out Bailey, tall hot blonde very nice body and very flexible who works there. had a great time definitley will go there again.", 
    "review_date": "2008-04-03"
  }, 
  "UxJoHsSFqc3TcM6UkIPmeA": {
    "user_rating": 3.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Patrick G.", 
    "review_text": "Was here last night and had a blast. Jennifer was a great server and Milana was fun to hang out with and gave a great dance. Then I get home and see a totally unconcerning and incorrect comment to my previous review. I was never kicked out and I politely tipped dancers that were terrible last time.   Dear Alicia,   Even though you own a strip club, in a perfect location, you still have a lot to learn about cusomter service. Instead of making up a lie to try to \"slam\" me, you should probably try to address the situation and find out what went wrong with the customer experience. Just sayin'.", 
    "review_date": "2011-11-13"
  }, 
  "Vl5TrIG6LrWQzFksM-5D2A": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Tara Z.", 
    "review_text": "The condor is THE best vibes, entertainment, and sexiness in all of SF. I have started going here, verses clubs or bars in the city because honestly I'd rather spend my dollars on beautiful women while enjoying a cocktail, than stuck in a packed sweat box full of assholes.   The staff here is wonderful and the ladies....oh the ladies. They are all incredibly hot, have fucking style, and are so talented. I stay for hours just to see who's up next. Men and women are welcome equally. I have never had a bad time here.   If you do go ask for Ariana or Astrid!!! They are powerfully hot women who will rock your world. It's amazing.", 
    "review_date": "2014-11-22"
  }, 
  "6F0uGYwpJUGxhlMO6C3r_g": {
    "user_rating": 4.0, 
    "user_location": "Peoria, AZ", 
    "user_name": "Bad L.", 
    "review_text": "This is the most G rated strip club I have ever been too.  It's actually sort of cool.  It's more like a burlesque club.  Sure...there are girls flashing some boobs, but that's about it.  It's got a cool vibe to it with traditional overpriced drinks.  Yes - the girls are hitting you up for private lap dances, but because it is old, there's just a different vibe here.  It looks like it a hangout for locals, so that ought to tell you something.", 
    "review_date": "2015-01-18"
  }, 
  "5q5R-Z54wm45Ec8G8CxZeA": {
    "user_rating": 4.0, 
    "user_location": "Somerville, MA", 
    "user_name": "Anastasia R.", 
    "review_text": "Two of my favorite people live in SF, and neither had ever been to a strip club. Both are capable, composed adults with perfectly serviceable social skills. That is until you put them in front of a pole, a girl, and a pair of platform heels.   The Condor, with its tops-off-bottoms-on policy, was perfect for my queerly oriented, morally conflicted entourage. I spent the next 2 hours immensely enjoying the almost-naked acrobatics and listening to two of my favorite comedic minds wrestle with the desire to be above objectifying the female figure vs. OMG boobies.   Before the end of the night, I had arranged for a joint lap dance for my buddies. When it was over, their favorite girl led them back to their seats, leaned down to me and said, \"They weren't awkward at all.\"    Overall, it is a very comfortable bar and stage. The girls are fun, and the House Mom even came over to introduce herself and make sure we were having a good time. Great for the lady lovin ladies, and those who don't care to find out if the carpet matches the drapes.", 
    "review_date": "2013-06-30"
  }, 
  "G6tRy4Aszosx6RIunAIjuw": {
    "user_rating": 2.0, 
    "user_location": "CA, CA", 
    "user_name": "Brian A.", 
    "review_text": "This used to be a great place. Laid back, friendly women and good atmosphere. It recently got some new hire managing the place and you can feel the ice in the air.  Whatever they did, they should not have, take it back, get old management back. The girls wont talk but you can tell, people are missing, the place just aint the same, go elsewhere for fun.  First rule of business is to stick with what works, not be an ass, and change things around because you \"THINK\" your way is better... it isnt!", 
    "review_date": "2008-01-06"
  }, 
  "syeYjOT3nGDBvafefgFsZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian V.", 
    "review_text": "One of my brohams was leaving the country for a new job and Saturday was his send-off.  We started drinking around 2 pm then bussed it to Broadway so we could eat at Giordano.  Deciding to barhop, we somehow ended up at the Condor Club.  The Condor Club's decor is a throwback to the old days...velvet plush chairs...very oldschool, very sleezy...think Hugh Hefner's den in his prime.  Not really realizing this was a strip club, we hit up the bar.  Our bartender was a true scumbag...Rick...a savory but unsavory fellow if you catch my drift.  He drank a shot for every round we ordered and we started out with jaegar bombs at $7.50.  Eventually, the price went down to $5.00 and the adventure started from there.  Time flies and soon the lights dim and the curtains get closed.  Buxom babes start entering the venue and being to swasted...we still do not understand until the show has begun.  Strippers come out to the bar to lure us into the showroom.  Giggling like little children, reliving our high school days when we used fake IDs to get into titty bars, we ran to a booth and fixed our eyes upon the stage.  The first chick worked the pole pretty well however, the second chick made the night.  Coaxing us guys to the front while the girlfriends were chortling behind, she allowed a couple friends to motorboat, instantly making their nights...shout out to lil hootsies.    In this business, the girls pay the club so it's their job to swindle.  However, the majority of the girls were not that pushy and were pretty rad.  Realizing that we would not buy dances, they decided to accept drinks as payment for time.  While our girlfriends looked on in disbelief, round after round was tossed to the back of our tonsils, making me too scared to check my wellsfargo account.    The Condor is an old fashioned titty bar.  It's fun to come with your friends and get blasted with Rick the bartender or observe the clientele with lowered brimmed hats.  Be careful if you come with a significant other...motorboating even in jest can lead to a debocle of Hiroshima proportions...bhaahahahah", 
    "review_date": "2010-07-11"
  }, 
  "UGcMuTLuwd29d3gtsJer0w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allan H.", 
    "review_text": "Sorry, \"been there, done that\" with the whole North Beach/Broadway scene...  There are so many other interesting places out there that I would rather give my  money to....  Sadly, this isn't one of them.", 
    "review_date": "2008-12-06"
  }, 
  "gApcULlT46pzhwSO74dTEw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Salem S.", 
    "review_text": "The right mix of laid back but not scuzzy.  Wide variety of girls.  Lots of tattooed/punk/goth looking girls too, if you're into that.  Champagne rooms are the same amount of experience you'll get in other topless clubs, but way cheaper.  Club has a sort of old (but not gross) look to it.  Very vintage.", 
    "review_date": "2012-09-21"
  }, 
  "1QfT3-Rtj9J9c-GZOK-z6Q": {
    "user_rating": 2.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Mandy M.", 
    "review_text": "My boyfriend and I went there on a Sat. night. It was our first time going to a strip club. The place was empty, but we went around 9:30 p.m. The girls were nice, but no talent. There wasn't any hot chicks in the place, so no lap dances! THere was a nice guy at the dooor- \"Derick\" who took us next door to try another place for free. Cheers to him for being a nice guy, but the place needs some hot chicks.", 
    "review_date": "2009-01-08"
  }, 
  "qCA4T_fLCnwLhLHWvPUYYQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela S.", 
    "review_text": "Always walk by, never been in, finally did, blah, blah, blah.  I really dug The Condor. It's the oldest strip club in the city, so it's got a lot of history behind it, and that's pretty cool. It's got that classic old - fashioned strip club vibe, with the red velvet curtains, classic - looking bar, and artwork that you can tell has been there since back in the day, like the girl with the light - up nipples. It's also got a piano hanging from the ceiling by the bar. I'm not sure if it's the same one that crushed a manager and a dancer while there were having sex on it when the hydraulics kicked in and smashed them into the ceiling, but it's pretty cool.  But that's not why you go to The Condor! You go to get drunk! Just kidding. The drinks are alright, normal pricing for a strip club, which is not cheap, but they do have a lot of really good drink specials pretty much every day.  Well, none of this really matters if the girls aren't hot, right? Well....yeah, they have some pretty hot girls. As with many Broadway clubs, there is a very wide variety of talent. Some more...talented than others, but they've got tattooed girls, thicker girls, skinny girls, strippery - looking stripper girls with their fake tits and whatnot. Only saw a few pole tricks, but the funny thing about strip clubs (and probably the most important to remember) is that they are subject to change every night. The vibe, the energy, the dancers, the probability that the cops will show up....  Fucking Broadway. Gotta love it.", 
    "review_date": "2012-02-21"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "I never expected to visit this place although I had wanted to see what it's all about.    Well, the opportunity came about on a Sunday afternoon when we heard live music.  Turns out Blues Hammer was playing with no cover.  We went in and found ourselves a table in the back as the bar and all nearby tables were full.  Grabbed our drinks from the lady bartender - a vodka tonic for me ($4.50) and a draft Anchor Steam ($4 for 12 oz) for hubby.  There's only 2 drafts - Anchor Steam and Guinness.    The band was jamming but we only got to enjoy it for about an hour - the show was from 3-6pm only.  At the 2nd to last song, couple of the band members walked around playing and we had one of the guitar player played right in front of us, that was awesome.  Shortly before 6pm, all the curtains were pulled down and the place was getting ready for its core business.  Some men moved from the bar to the other side and grabbed a booth to settle.  A tall lanky blonde appeared in a swimsuit.  A brunette w/ 2 piece showed up 5 minutes after.  Shortly after 6pm, the show began.  The fog machine and color lights came on, the blonde went on stage and started pole dancing to \"I'm just a Giggolo\"...interesting.  The place is not what I had expected.  It's small.  Decor of the bygone era - red plush vinyl booths, red armchairs, red baroque wall paper and curtains, even the restroom is all red - bright red subway tiles, deeper red wallpaper with gold accents.  The old carol doda neon sign is now hung on the wall as you enter.  There is a b/w picture of the infamous wired piano lowering Carol Doda onto the stage hung at end corner booth next to dj.  There are VIP booths on the other side - these are the more initimate booths for 3-4 with long red baroque curtains that can be closed off for privacy - wink wink.", 
    "review_date": "2009-04-30"
  }, 
  "QnEkGepNrrNWSiI7I-D0Yg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cliff S.", 
    "review_text": "Condor Club, seedy characters welcome.  Step foot through an open window and transport yourself into the wild birdhouse. It has a faded Victorian decor, like you wormholed into a saloon from the 1800's. The aging, fraying of upholstery parallels the wear and drudgery on the faces of dancers. Maybe it was because i got the day time crowd, but as terrible as it is to say, the fish, for the most part, was not sushi grade.   Regardless it is a fun time. The creepers are too busy distracted by tits so for the lushes, you can easily have a free for all with the reasonable alcohol. They do their $5 5-7pm jagerbomb specials so if you dig redbull and jager, go nuts. One of the bartenders, Rick, is quite the merry fellow but has a silvery tongue capable of jedi mind tricking you into going several rounds deep.  Bottom line, Condor is an excellent choice for occasions that demand social gatherings at adult venues. As we all know many gatherings require such places right?", 
    "review_date": "2010-08-11"
  }, 
  "3kOaLeBVNNz4_HTsu169KA": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Karen D.", 
    "review_text": "The Condor's marketing appears to be trying to profit from its history as the original SF titty bar, it's not burlesque in here. Nice, small club, friendly girls but when I was in there they didn't seem to want to hustle- this is great for the cheapasses but I wanted to yell at them to get up and make money. And what's with guys sitting at the stage and not tipping? If you're at the stage you always tip!!!", 
    "review_date": "2008-09-27"
  }, 
  "KUnwTk8wYmyOWpWClUuLAg": {
    "user_rating": 3.0, 
    "user_location": "Union Square, San Francisco, CA", 
    "user_name": "L D.", 
    "review_text": "Always entertaining.  Great place to drink.  Check in and you get a free wells or beer.", 
    "review_date": "2012-07-01"
  }, 
  "T4E1PMvIF78PKVMXnYcuRw": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Greta R.", 
    "review_text": "Fun place.  When I found out my husband hadn't been to a strip club in almost 2 decades, I joked that we should go to North Beach for Valentine's Day thinking there was no way he'd want to.  Well it turns out that the Condor was having a Valentine's special - bottle of champagne and entry for a couple for only $20.  We figured why not.  Could be fun.  We ended up having a great time.  The girls were very sweet and it seems like a generally classy place.  Of course they push the lap dances, which he wasn't interested in.  That's the only not great part.  I know that's how they make their money, but after a while it gets old getting sold every 5 minutes.  We were dressed well so I guess they figured we would spend a lot of money.  The couple next to us go a dance and I guess she wasn't happy with the cost vs. the amount of time, but everyone else seemed to enjoy their dances.  It was fun and I felt comfortable as a women in the club.  The girls were coo'ing over some of my jewelry and being super sweet and friendly.", 
    "review_date": "2014-02-15"
  }, 
  "OHd0ijZEGwegfqtgCW_Clw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Lena Y.", 
    "review_text": "Amazing!  Mark the manager is super friendly and actually gets to know his guests. Which is unheard of! Atmosphere is fun and intimate with a bunch of beautiful ,talented women. These women also seem happy to be working there . I've been into other strip clubs in SF and the ladies are talking about how much they hate the managment, have all there money taken from them, ect.BESTstrip club in San Francisco by far. Don't even bother checking out other strip clubs in SF....this is it.", 
    "review_date": "2014-05-14"
  }, 
  "CY4uM8OsuZ_hHN0hR5LpRg": {
    "user_rating": 5.0, 
    "user_location": "Stockton, CA", 
    "user_name": "L B.", 
    "review_text": "I visited the condor early on a Friday night. The floor men and management were very friendly and welcoming. The club was very large compared to some of the other clubs I have been too. All of the dancers were very friendly and welcoming! Also very pretty I might add! Very classy place. There was a high energy with the dj and music being played! I liked that there was a small stage on the bar side of the club, to keep both sides of the club entertaining! Also being as that it was the first gentlemens club in the US, there was a lot of cool old pictures and paintings! Drinks weren't too expensive, bartenders were great! The place had a very comfortable casual feel. I will definitely be coming back and suggesting this place to my friends!!", 
    "review_date": "2014-04-25"
  }, 
  "KivTl6k7urUMhPqPj-MDaQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric S.", 
    "review_text": "The Condor Club is a \"dive bar\" of a tittie bar down in North Beach.  Cheap cover ($5), drink specials ($4 imports that night), and the most multicultural staff I've ever run across.  Indian strippers!  Seriously?!  Friendly staff and a vintage setting (this place was apparently opened as a strip club in the 60's)as well as a classy dining room make this a definite step back in time to where sexual harrassment was cool and where underground prostution florished in a Barbary Coast sort of way.", 
    "review_date": "2008-07-24"
  }, 
  "Dvq8ykY8UUZlCwcchWSgWQ": {
    "user_rating": 5.0, 
    "user_location": "Ypsilanti, MI", 
    "user_name": "Blare T.", 
    "review_text": "Best club in the city. Sexy woman, friendly staff. Sports bar, n great food. Watch the fights on the big screen, MMA n UFC. Amazing performances by the girls. Always have a blast when I come here.", 
    "review_date": "2014-07-17"
  }, 
  "cetOjQ25SGauSEkLMIta0Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Asli O.", 
    "review_text": "The world's first topless bar.   Carol Doda made this place famous. In the summer of '64, the Republicans held their national convention in San Francisco &amp; they went to see Carol Doda @ The Condor.   Phantoms of underground history have made their way into these doors. There's some deep history amidst this sex and sliding down silver poles.   Interesting read: <a href=\"/redir?url=http%3A%2F%2Fwww.nytimes.com%2F2010%2F08%2F15%2Fus%2F15bcintel.html%3F_r%3D0&amp;s=f7029445694795ff13543845f747c095d3416ecaf764b9999a14f1003c86677a\" rel=\"nofollow\" target=\"_blank\">nytimes.com/2010/08/15/u…</a>", 
    "review_date": "2013-02-09"
  }, 
  "mkxCw6GsMZDu-44_aCQTHw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Van W.", 
    "review_text": "I went here on the Saturday of Fleet Week this year.  Two of my friends and I went for a run along the Embarcadero and back and ended up running around and drinking heavily.    We drunkenly ended up here -- interestingly enough we had no idea where we were until a week or two after when we were back in North Beach and decided to try and retrace our steps.  Anyways, the 3 of went to the club -- and considering we were all in our running clothing they surprisingly polite.  We went in through the side entrance -- a little flirting goes a long way (ok, at least it gets you in with no cover).  We sat down, ordered our drinks and enjoyed some boobies.  I should mention that we were all pretty drunk at this point -- we met another group of people enjoying themselves and became friends with them quickly.  One of them was a Librarian -- a sexy librarian.  No, she wasn't a stripper.  She decided that she wanted to treat us to a private dance.  Hells yea!  The 4 of us crammed into one of the booths and we were introduced to the stunningly graceful and gorgeous Serenity.  She was really sweet and talked to us -- we had a round of shots and she um, entertained us.  At some point someone decided that it was my friend's birthday -- so, let's just say she got a little more attention...  I think one of the best ways to judge a (female) strip club as a female is in the bathrooms.  Snobby places the girls tend to ignore you or even make you feel uncomfortable or intimidate you.  This is certainly not one of those places.  You can have a fun conversation in the bathroom with friendly strippers.  Anyways -- the patrons were also really nice.  We got several free drinks/shots -- and we weren't there to pick up men or take advantage.  People just seemed super chill.  Had some nice conversations with some of the other patrons and the bartenders were all really nice.  One of my friends ended up getting really trashed.  The guys were mostly nice when I asked them to leave her alone -- they actually just seemed concerned.  They helped me get her water -- which she mostly spat back on the ground (Sorry Condor club).  Anyways, our second visit there we were a lot more sober, but the bouncers recognized us and got us and 3 other guys in for free.  Serenity was there being her awesome self and took the time to chat with us.  In general the girls there don't seem to pressure people for dances -- that's how I think strip clubs should be, you should want to give them money and not feel pressured or obligated.   This place is awesome as far as I'm concerned!", 
    "review_date": "2009-12-03"
  }, 
  "9jZAXnAaulEC40wtEZK6Fw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stanley K.", 
    "review_text": "What happened to the Sports Bar?   Well, it turns out the owner wanted strippers... that's what San Franciscans need, more titties for losers like myself or some ( Fong, Peter, Stormi, and company) called me GAY. Just because I have a little more class and a little more sass doesn't make Stanley GAY. I don't pay for strippers unless someone buys them for me. I feel dirty like a whore working the streets, I'm paying for someone to rub their genital on me for what? A hard one...please. It doesn't work that way. Of course I take care of myself elsewhere, not going to say, but it does involve lube.   So, about this place and a little about me, it's the original topless a go go in San Francisco. For the initial grand opening, they are NOT charging a cover charge which is AWESOME, because everyone knows, Yelpers don't pay cover. We go to Kinko's and make everyone free passes (thanks Stormi, you ROCK!) As we walk in, the place still looks the same, just put a stage, a dozen hot girls, a few losers guys like me and Kaboom, you have a topless bar. To end the story, as I saw some really cute girls, I saw someone I knew from school. No, it wasn't a guy, it was someone I knew pretty well from school. We studied together, by that, you know what that means, well, three years ago, we used to go out and it turns out she was a quote / unquote, to put in better words, a \"exotic dancer\".   When I mention to a few people about her, FONG! , mention while we were on VIP seating, that \"Stan, you remember that ass?\" in front of her, she was totally embarrass as was I. It was over. Complete humidity. Complete non hard on. End of story.  I give this place five stars for two girls - Cheyenne and the hot Irish / Japanese Texas breed girl, I can't remember her name, DAM IT, I should know this.   PS. Texas girl, if you are reading this, I'll find you again. It was love at first sight. Bom Chicka Wah Wah.", 
    "review_date": "2007-08-04"
  }, 
  "Q776bcGZLx26_I3PXrhZCA": {
    "user_rating": 1.0, 
    "user_location": "San Marcos, CA", 
    "user_name": "Armando G.", 
    "review_text": "This place sucks.  We ended up here after drinking.  We were starving and stoped by.  What a mistake.  We ordered food thinking that we would get it in time so we could catch the last train going to the east bay.  BIG FAT NEGITIVE.  45 min. past and still no food.  When we asked for our money back they stalled twic hoping the food would get here in time.  Nope. We went back for a third time preshering the manager for our money.    The girls were halfway decent looking.  I have seen better and been with better.", 
    "review_date": "2009-11-15"
  }, 
  "qSPFhtM-eO842BVQXtAMNg": {
    "user_rating": 4.0, 
    "user_location": "Huntington Beach, CA", 
    "user_name": "Dan H.", 
    "review_text": "Have you heard the one about the  tourist couple that stopped in to listen to a bar band and a strip club broke out? No? Well pull up a chair cuz uncle Danimal has a tale to tell.  After a couple of days in Napa we hit SF on a perfectly glorious Sunday afternoon. Stroll around China Town and North Beach and it's kinda dead. We stop by a random Columbus Street Italian resto for some wine and minestrone. Yawn, might be a good night to hit the hay a little early and rest up for a long Monday of seeing the sites. Ah, f' that! I suggest the old standby Saloon (thttp://www.yelp.com/biz/the-saloon-san-­francisco#hrid:tVaRtXo_NYpWZ12LqVPzzQ/src:self) that is always rowdy with a live band on Sunday afternoons/early eves. Dang, packed with no available seats and the band is on a break. Time to cash it in?  C'mon! It's North Beach! It does happen to be the Sunday night of Thanksgiving weekend, but if there is anyplace in California on this sleepy day of all sleepy days to rock this is the place.   Sure enough, we walk around the corner and there on the sidewalk are several dancing fools grooving to a psychedelic old school 60's \"Frisco\" kinda band. Heck yeah, lets grab a seat. We are warmly greeted and there is much commotion on the stage. It seems that a regular, \"Gabby\", has worn out her guest singer welcome and the bouncer is removing her sack-of-potato-style from the stage. Finally we have some life going on.   The band was drunkin and decent, the crowd friendly and also entertaining. Gabby was repeatedly extracted from the microphone, replete with expletives, but all in good humor from the lead singer. Faak I love this neighborhood. AND....I got my 1st free drink for doing a Yelp check-in. YAY.  And then,.....bouncer man starts drawing the heavy drapes shut. Hey I holler his way, whats gonna happen that we cant be seen? \"Uh, you've heard of the Condor Club, right?\" Yeah, but that's next door. Nope, next door happens to be an adjoining room with pole dancing nekkedness. OK, half nekkedness.   A good time was had, the staff were awesome, and the sleaze factor was at a minimum for the Broadway area. And the lady-friend has a great story to tell if she dares.", 
    "review_date": "2011-12-06"
  }, 
  "_drAXx2lgRw-dgiH0_Jnsg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Towanda S.", 
    "review_text": "Very friendly servers. I'd have to say this my be my new favorite strip club.   girls were very cute and quick to laugh and awesome dancers", 
    "review_date": "2008-03-07"
  }, 
  "_d29FX2PFox2SRMZcwS8cA": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "David B.", 
    "review_text": "Excellent service, beautiful women... Worth every penny I spent. Definitely will be back.", 
    "review_date": "2014-04-11"
  }, 
  "2uM3O9Qy4vxvITAfke7_4g": {
    "user_rating": 4.0, 
    "user_location": "Utrecht, The Netherlands", 
    "user_name": "Helen D.", 
    "review_text": "Went here to watch my friend's band perform (Kit Ruscoe's Trio, check them out, they are here every 3rd Friday of the month).  Bartender was very friendly, drinks are cheap (probably cause they want you to spend money on the ladies), and location is perfect. During the day (when it's a music venue and not an \"Adult entertainment venue\" the curtains are open and it's a nice spot to people watch (right on the corner of Columbus and Broadway). It's a very old-fashioned stripclub, with a nice feel to it.  At 6pm sharp the curtains closed and the ladies came down for their show. Pretty ladies, didn't stay for the show, but my friend did and he enjoyed it.", 
    "review_date": "2012-10-20"
  }, 
  "aqQ0MR0a9Ht9srz7PTRE3g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sophie D.", 
    "review_text": "I randomly ended up here...it was a very spontaneous decision and suddenly there I was, applauding and cheering for the strippers with a bunch of girlfriends and salivating dudes. I have to say...most of these girls were not hot at all. Some of them didn't really do any pole work or anything. I mean, I'm no strip club critic, but there definitely is a difference between a higher-end place and a crappy club. The Condor was kind of sad, really. The mirror behind the stage had hand prints all over it, the strippers didn't look too 'into it'--I don't know, it was just mediocre for me.", 
    "review_date": "2008-11-30"
  }, 
  "OAl3uF2ZDmzleI3J0RFYog": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Lyly D.", 
    "review_text": "Uh.. I don't know how I ended up here alone last week. Came with someone, lost them, couldn't find them, blah blah blah.. ended up at a strip club.   Not sure if it was the stoli haze, but the girls were gorgeous and could move like Michael Jackson.   Fun!", 
    "review_date": "2007-09-21"
  }, 
  "rA5hLv8xP8hQun3gSCdsVg": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Mary C.", 
    "review_text": "Wow. The Condor is a classic. Much like Mary's Club in Portland, the walls at Condor are decorated with framed photos of dancers from days gone by, newspaper articles and cartoons from the 1950's- and let's not forget the crazy white piano hanging from the ceiling, the same that allegedly killed a gangster in the 40's or something. You have to go back to the private dance area to see the piano, but they let my friend and I just look around. Maybe that's because we are fine ladies, I don't know. We went on a Monday and it was not crowded, but not totally dead either.   I don't care what other yelpers say- when I go to a strip club, I want more than just boobs. I want history, or a sense that something interesting and different is going on. Maybe I'm just jaded because I live in Portland, land of 100 strip clubs, but a bunch of super hot girls in a boring environment is not as fun for me.  Dancers here, at least on a Monday night, seem to be a bit older with curvy bods that Tyra Banks would call \"fiercely real.\" There was a range on the night we went: from a black-haired tattooed lady doing impressive pole work to Danzig, to a sexy Ecuadorian MILF with bedroom eyes who just sort of rolled around with a smirk. We liked her a LOT. Otherwise, the dancers did have an unfortunate tendency to look very bored, even unhappy. A little smiling could really lift the energy in the place.  I wondered what working there would be like, and asked the Danzig dancer for more info. She said you can make money, but the management charges different house fees for different girls \"depending on your standing with management.\" I wasn't sure what that meant- either you get a deal if you're super pretty, or you blow the boss to pay less. Regardless, these ladies are PAYING TO WORK HERE so make it rain when you sit at the rack!", 
    "review_date": "2012-12-03"
  }, 
  "tCgtfVga5FgtvvcD9wYnRA": {
    "user_rating": 5.0, 
    "user_location": "Roseville, CA", 
    "user_name": "ELLA B.", 
    "review_text": "We started here early on in the day. The live band was heard through the street and brought us in. The service was friendly n the beer was cold.. It was my boyfriends birthday and his sister ordered some food, it was impressive and better then I expected from a bar/topless bar. The owner was super friendly and gave birthday boy a giants pint glass he was dying to own, super cool...he loves that cup. We came back later that night and once again we had a great experience! The staff super friendly even the bouncer was polite.. The whole experience all around stellar!!", 
    "review_date": "2014-04-07"
  }, 
  "wvJuVA6cds8xQrSBoXhhog": {
    "user_rating": 4.0, 
    "user_location": "Gilroy, CA", 
    "user_name": "Anonymous W.", 
    "review_text": "Went there on a Friday night around 930pm with my girl. We are no strangers to strip clubs. Bought a pass to all four (Garden of Eden, Condor, Little Darlings and Roaring 20's which are all owned by same company) clubs for $50 which is a good deal.   Walked in and took a seat at the stage. The girls were a little above average, nothing awesome, but nothing terrible either. A few of them did some cool/fun pole tricks which got the crowd cheering and hooting. Some of the girls were very energetic and really made it fun, the others did their thing and walked off without much money....so be it.   Drinks were very reasonable. 6 top-shelf cocktails for $48 is not bad in a strip club! Waitress was nice, not pushy, and kept us filled up. Alot people in there, and a pretty cool vibe from the crowd.   We are not huge fans of just topless clubs, but they are a good way to get some cocktails, and then for us, we go back to the full nude spots...so the wrist band is perfect to be able to do both by just walking across the street.", 
    "review_date": "2010-06-05"
  }, 
  "b2L_0pG5zi0qmLHePaupaw": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Niels T.", 
    "review_text": "(For Dutch review, see below). What a nice place this is. I was visiting from Holland in April, and my friend and I were looking at a nice place for a drink (alcoholic)  and entertainment. The friendly welcome at the door was a big difference with the other places in the area. We had a nice table in front of the stage. I had a great time talking with Nicole, and she also gave an amazing dance. will definitely visit again, hope that Nicole is still there. Dutch: Een hele leuke tent. we waren op zoek naar een club om wat te drinken (alcohol) en entertainment. vriendelijk ontvangst bij deur, niet van dat geschreeuw zoals bij andere clubs in de buurt. we hadden een mooie plek voor het podium. heb heel leuk met een meisje gepraat, Nicole, die ook nog fantastisch gedanst heeft. echt een aanrader, kom hier zeker terug, hoop dat Nicole er nog is.", 
    "review_date": "2014-06-07"
  }, 
  "7vRjE1iHrB26sIyn7fq7hg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Mo C.", 
    "review_text": "Very nice classy place for my friends and I. I've been to a few other clubs and this was the cleanest one. The girls are pretty cute, and I think all the ones we saw were natural, no fake boobs that we saw. Some of the girls seemed really out of it and very into the mirror and not the audience, but other girls were very energetic and friendly. There was one cute girl in particular who was super talkative and perky so we ended up getting a dance from her! Another girl we liked her look and were spending money during her dance, but when she got off the stage sat next to some guys who didn't end up buying her a dance though we would have if she came to us, we were obviously interested! Drinks were a bit pricey, but they didn't pressure us to drink a lot so that was good. Overall great experience!", 
    "review_date": "2012-06-11"
  }, 
  "eA91tgqdKxJx0Rwekh7E1g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "beth b.", 
    "review_text": "Haven't been to many... or really any clubs to compare it to, but Condor Club, I am pleasantly surprised.  I walked in without expectations, but it delivered as if I did.  Comfortable atmosphere, delightful beverages, nice stage show, friendly ladies, some impressive moves on the pole... and I might be back.   Special nod to India, with the best showmanship in the house.  I wouldn't have pegged myself as the \"buy a private dance\" type-o-gal... apparently I am.", 
    "review_date": "2010-10-03"
  }, 
  "FEc9dyollAUDU4vODV5_bQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Christina A.", 
    "review_text": "Amazing club :) I came here the other day to meet a gf for a drink and really enjoyed the vibe of this club. Sexy ladies, strong drinks, and this place is a historical landmark. What's not to like ;) There were girls of all differently nationalities and looks, it was like the UN in there, but way sexier. The ladies are good at what they do and really enjoy themselves.  I really appreciated how on point the service was from the doorman to the floor manager. All around great time if you just want to relax after a long day of work or come in to party with some friends :)", 
    "review_date": "2014-04-21"
  }, 
  "JsNX8qi5Z6qUMo4Ey6Vrdg": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Xian Pao T.", 
    "review_text": "Picture #17, this bitch had no moves.  She'd be doing her thing to some fast beat 80's-early 90's song.  leaning up against the mirror on stage slowly touching herself, looking hella scared.  Sorry but it just wasn't sexy to me and my 10 buddies.  We laughed straight through her S#!7. NO STAR FOR YOU!    The indian stripper chick was... well i don't know... it's like one of those times when you're not sure how to react, so you just knod your head and smile politely while applauding lightly for her effort. But in your mind you're like WTF is going on here!?!  The bar behind the stage, was cool.  The bartender broads were cool, but was surprised that she didn't know how to make a henn-drop.  Suppose to be a shot of henny and red-bull.  Instead I got a mix drink of henny and redbull with ice. 1-star for you bartender.  Now I know that hella people is giving this place 4-5 stars because of it's historical past and all, but F#@K HISTORIC VALUE.  I CAME HERE TO DRANK AND SEE SOME TIT-TAYS! CLAKITY-CLAK! If I wanted to see history I'd go to a museum bitches!", 
    "review_date": "2008-07-26"
  }, 
  "BdV-cf3LScmb8kZ7iiBcMA": {
    "user_rating": 4.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "Alexander E.", 
    "review_text": "The Condor Club is a Gentlemen's club on the corner of Broadway and Columbus in the heart of North Beach.  The club has quite a bit of history as it was originally the first topless burlesque in our fine country.  The original Condor closed decades ago, but the club was recently re-opened by Deja Vu as restaurants and bars came and went.  As you enter the club, the stage is directly in front of you with seating surrounding it and about five or six booths for groups.  A few flat panel TVs hang on the wall to air the game or music videos.  Furthermore, the club has the best bar of all the gentlemen club's on the strip.  The bar is on the opposite side of the stage, but is quite spacious and typically is the center of the action with another mini-stage behind you where another dancer can practice her moves.  The bar itself can get a little busy, packed, and crowded, especially on a Friday or Saturday night.  There's drink specials every night and beers run about $5 with mixed drinks along the same price, premium liquor running a little higher. If you don't want to wait for the bartender, seat yourself in the other room and have the cocktail waitress get your drinks.  The club also have a menu with surprisingly good food including fries, burgers, chicken sandwiches, salads, enchiladas, quesadillas, and more.  The food is made at the Hustler Club and brought over since there's no kitchen at the Condor.  The food can take anywhere from fifteen to twenty minutes to be served, depending on the crowd.  The area behind the bar houses a very private and spacious VIP section, which I find to be much more nicer than other clubs in San Francisco.  VIP dances go from $40 and up, with specials throughout the night.  The strippers range as many come and go throughout the year.  Additionally, as some work at other clubs in the city, you might run into a familiar face from one of the other clubs.  Furthermore, the club has a broad range of girls including white, black, Hispanic, Asian, middle-eastern, etc.    You can count on having a good time at The Condor Club as long as you have money.  If you don't have money or refuse to tip or get a lap dance, don't bother coming.  You waste the time of the girls and look like a cheap-ass.  However, if you come for the bar, stay at the bar and the girls will not bother you.  Don't be afraid to buy them a drink! They will remember you and won't talk smack about you to the next girl.", 
    "review_date": "2010-08-12"
  }, 
  "S5VulfXE4EMxWsoEdETCsw": {
    "user_rating": 1.0, 
    "user_location": "Modesto, CA", 
    "user_name": "Lew A.", 
    "review_text": "Mostly nasty, unattractive women here..........no need to say more, just pass this place by without wasting your time and money!", 
    "review_date": "2013-06-03"
  }, 
  "f6iRA1UBcdPv1x3mDhvdyQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lawrence K.", 
    "review_text": "interesting.  wait. i can do a little bit better.  very interesting.  the interior is very warm, reddish, velvety. the bar wraps around a small space in the back but is enormous and friendly. i was curious &amp; now I know.  Drink prices were definitely way on the high side. but I found the girls highly engaged in my wallet. So they are definitely on target.  i would take a date here. probably save you money unless she drinks champagne.  seriously, $17 a glass. wtf - that glass needs to come with a complementary ... something.  Also the word is the food checks out. but i didn't verify.", 
    "review_date": "2008-04-05"
  }, 
  "fUuCohuKIkVKFfBwvhSXPQ": {
    "user_rating": 5.0, 
    "user_location": "Bayview/Hunters Point, San Francisco, CA", 
    "user_name": "Whitne B.", 
    "review_text": "Condor is AWESOME OHHHHHHHHHHH!!!!! What more can I say? You can never fully please everyone that comes thru those doors, but for the most part, everybody that I see and speak to are always having a great time:) :) leaving a trail of happy faces!", 
    "review_date": "2014-09-29"
  }, 
  "9gqzouTCfvg3JsAhqD0uJA": {
    "user_rating": 3.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Dan S.", 
    "review_text": "nice spot for a glass of wine", 
    "review_date": "2013-11-21"
  }
}