{
  "qmMcKj2lPhwxLX4n7A6ghg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Tom M.", 
    "review_text": "One of my go-to beer places when in SF.   Very good bottle selection, and good draught selection with 20 taps and which seems to rotate often.  Small space so it is intimate, but can also be crowded and loud.", 
    "review_date": "2014-12-16"
  }, 
  "RDUe5SfDyxt79EV98cIbeA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michele K.", 
    "review_text": "Great beers on tap and available to-go. Not much space inside, but if you can arrive before the techies at Twitter, you should be able to score a seat.", 
    "review_date": "2014-03-30"
  }, 
  "Sj7HxTlCJB0UF4vdTQdAUA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay G.", 
    "review_text": "Went here a few days ago for a birthday party and came away impressed. They've got ~30 beers and 5 wines on tap as well as another 50-75 bottled beers in stock. There's a small food menu as well. If you're hungry, the turkey sandwich is pretty good and reasonably priced.   Downside to the place is really just 1) Location (close to twitter / uber offices but not really near anything else) and 2) size. If there are more than 40 people in there it gets a little cramped. There's only one bathroom and only one TV if you're looking to watch a game there. Other than that, it's a pretty good spot to go to, especially if you're in the area.", 
    "review_date": "2015-01-12"
  }, 
  "V5Th21KjUiYLJQyV-vGtpg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ben H L.", 
    "review_text": "A small neighborhood beer place that unfortunately is right across the street from the Twitter building.  Unfortunate in the way that I probably not likely ever get a seat here if they hosted a SF Beer Week event or even a regular tap takeover.  The appeal of this place is the awesome decor of retro beer cans all over the room.  Adding to that, there is beer for sale here with many well known and not so well known selections and the LCD beer menu on the back of the bar wall is clear to read and very informative.  No more chalkboards!   I like to see names, ABV, beer type, and price all in one line.  It helps me make a decision faster versus delaying the bartender by asking these questions before ordering.    The day I came here was for the Green Flash vs 21 Amendment promotional day.  I got a Green Flash double IPA and although it was smooth, it was super bitter and quite a challenge to drink.  It mellows out a bit as the beer warms up, just like wine.  The staff and management seem challenged to serve and clean up here as it was literally difficult just to move around the small room.  But they seemed to take it all in stride.  FYI, there's no food here so next time, I'm coming here, I'm bringing a pizza.", 
    "review_date": "2014-02-16"
  }, 
  "uTb2XVsPvb2ha3NeUCdHoA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tia O.", 
    "review_text": "This place is  amazing!!! Lots of beers on tap and hundreds by the bottles. You can also buy beers to take home. They're now serving food every Friday. The decor is done beautifully .", 
    "review_date": "2014-06-13"
  }, 
  "4Y81J2Tdq5XAnkeYmCZ2ow": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nique F.", 
    "review_text": "Eureka! An almost-ideal spot to pre-game before a show at Bill Graham -- which is literally around the corner. The only element missing is food, but with a little advance planning you can BYO, and let them take care of the booze!  They offer tons of beers, both bottled and tap, and about 5 wines. The beer selection is something to admire, with an encyclopedic list to tickle whatever palate you've got. We tried a couple sour beers (bottled) and they were Amaze, capital-A. The space is like a more sleek, digitized version of Beer Rev (actually, it has nothing in common with Beer Rev except for all the beer). They seem to be catering more to the polished tech-industry crowd than the hobo-hipster beer geek crowd, but both could appreciate what they're doing. For example, the beer list is on a big TV screen (digitized) and there are black and white movies playing in the bathroom so you could really get comfy while you're on the pot. Brilliant!  This area of SF really needed a quasi-classy watering hole like Beer Hall. Even an unenthusiastic beer drinker like myself can give them major props -- for the space, selection, service and overall good times.", 
    "review_date": "2013-11-01"
  }, 
  "RNbUnH7mXOaYCzcClnVClQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Kyle G.", 
    "review_text": "Fantastic in a glass. Great place to hand with a buddy with unlimited amount of great beer from all over. What did catch my eye was the Deschutes Bend, Oregon was in full force here. Not to mention beers for all over the Bay Area and beyond. Five stars!", 
    "review_date": "2013-10-29"
  }, 
  "U744h5GSLU2J7aajcinLMg": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Jiselle L.", 
    "review_text": "They have a good selection of beers on tap and bottled. The staff was pretty helpful, and I like the ambience, though the place was a bit small for the crowd it draws. I wish they served snacks though. Worth a visit if you're in the area, but not a special trip.", 
    "review_date": "2013-10-01"
  }, 
  "bP2ZGAschyHhlavrrSRdNg": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Yiannis S.", 
    "review_text": "Nice atmosphere, great selection of beer, great prices, nice and helpful bartender. I'm very glad I discovered this place. I spent some time marveling at the beer bottles on their shelves, before eventually sharing three large 22oz bottles with four friends for less than $40 total.", 
    "review_date": "2014-11-28"
  }, 
  "UKSw9kfoBfdatSMUl-jGnA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eddie H.", 
    "review_text": "Out of 24 reviews, the only two reviews giving this place less than 3 stars base their reviews on not being open on Sunday and not serving west coast beers. Really?   This place serves about 20 beers on tap (plenty many more in bottles) and occasionally has free food available for patrons (i.e. Paxti's pizza). On top of that, this place features breweries (currently Deschutes) that will feature several beers on tap and have giveaways like free pint glasses with beer or quality key chains. The beers rotate quite frequently and based on the season so check back in often (or check their FB page or Twitter for latest beer menus, drinks specials, and giveaways etc.)  The owners are knowledge and will make solid recommendations to your liking in case you have any questions or would just like to try something new.", 
    "review_date": "2013-11-01"
  }, 
  "5feyovgHwlxAFNXhMBCqow": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bill K.", 
    "review_text": "That's the beer list.  Please give me something I might actually want to drink. There is still nothing better than a nice IPA, and not a single offering of a classic west coast beer.  Spare me and we give you two years max if your lucky until you close down. Give us something good, great beer, service, atmosphere, but not this!", 
    "review_date": "2013-08-14"
  }, 
  "g3ontSTtbzZLvgPRGYp_-w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike Z.", 
    "review_text": "If you like beer... You're home!  This place has over 200 beers and great service. We were greeted at the door and they suggested a couple new beers based on our taste.  Great place.", 
    "review_date": "2013-08-17"
  }, 
  "bSQN0JxP0d1hQ8ht87CI5A": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "R C.", 
    "review_text": "I don't Yelp very much, but when I do, I find myself in 5 star places. Today I find myself amongst friends here at the Beer Hall. Both of the employees kindly took time to explain the menu and were genuinely nice to talk to. We were looking for a cool bar before jumping on BART to the airport and this place was the perfect place.", 
    "review_date": "2014-01-20"
  }, 
  "ZhltiCpjbVNWb3WRIGi9dg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nathan L.", 
    "review_text": "This is probably one of those hole in the wall beer stops that you won't realize is there, but it's really just around the corner. At least for me I didn't even realize it was there until someone told me about this place.  Overall it's a pretty small place with little space, but man oh man is the atmosphere awesome.  You get the best of both worlds here if you are a beer fanatic. It's a cozy place that's very dim lit, but at the same time the atmosphere is perfect especially if you're on a date. The size of the place slowly goes away and transforms into a cozy area for you and whoever you want to bring here. But lets talk beer. The beer here is awesome! The selection always changes and carries a lot of different types of beers. Oh and the names for each one of the beers is actually really interesting as well so I recommend just taking a look at them for fun. Overall I love this place and would def. come again.", 
    "review_date": "2015-01-13"
  }, 
  "6NQbvQ78kkUPPlB5I_e60w": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Evan L.", 
    "review_text": "Cool spot. They had a pretty vast selection of beers on tap but unfortunately none of them appealed to me so I got one of my favorite beers they had in a bottle. Avery white rascal. Great beer and glad they had it.", 
    "review_date": "2014-08-17"
  }, 
  "hcYoeBtJmkIupV7EmZmu2A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sean M.", 
    "review_text": "Location location location!!!!  Based on proximity to me, NEMA, Fox Plaza, mid-Market etc. this place gets the WooHoo rating!  A nice selection of beer covering many bases and many brands and at a fair price in a nice setting.  Enjoyed a Firestone Walker Sucuba barley wine that was 25 proof and delicious!  My partner enjoyed a North Coast Imperial Stout and was happy indeed with her pour! Look forward to this place developing their small bites menu and trying many more beers!   CHEERS!!!", 
    "review_date": "2013-08-05"
  }, 
  "EEBcB3Sm8LDASwBeu8UKsA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dave H.", 
    "review_text": "Nice place, decent bottle selection (nothing crazy), good beer spread on tap.  A little tight and a little pricey.  Great bathroom.  Friendly staff.  Loud as shit when crowded.  They don't update their beer menu online, so you sorta have to cross your fingers and hope for the best when you show up.   Worth checking out, but not worth a special trip.", 
    "review_date": "2013-09-06"
  }, 
  "IcJfiXkrYuu30aVxnY1Z0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen R.", 
    "review_text": "So happy to have a place that rivals City Beer Store right in my neighborhood! I loved the beer selection, both on tap (the brandywine was the best I've ever had!), and in the bottle. They have a 5-6 page printout (with tiny print) of their copious bottle offerings, which means that my husband will be stopping here instead of the overpriced corner stores to bring something home from now on. :)   I liked the ambience, and the staff were great. The only things that could make the place better are happy hour prices if they don't already have them (even if happy hour is later, since it was already super packed at 6:30 but winding down by 8:30), and of course, noshing options. I'll definitely be here often!", 
    "review_date": "2013-09-18"
  }, 
  "QG7yAsR9DtxI6igHNST3-Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan E.", 
    "review_text": "Great neighborhood spot, 20 beers on tap, 100s of bottles available. Very knowledgable and friendly staff.", 
    "review_date": "2013-11-06"
  }, 
  "n5x32Ld11LPO4r6Nq40hsg": {
    "user_rating": 4.0, 
    "user_location": "Vacaville, CA", 
    "user_name": "C B.", 
    "review_text": "Stopped by here after the Giants Parade. The dual combination of coming on the day of the parade and Halloween made it quite busy and lively inside, but still my buddy and I managed to grab a table. Very good tap selection, and was pleased to see them offering a pumpkin beer (T.R.E.A.T.) for the holiday, but was blown away by the Boulder Choco Shake on nitro. They do offer table service, which was very nice and a rarity for a place so small. My only complaint, and lack of a fifth star, is they are a bit pricy. The bottle selection on the wall was especially apparent of this. Definitely worth the stop however. Recommended", 
    "review_date": "2014-11-03"
  }, 
  "JzDPb9rFVNHsMWqaCGWjHQ": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Danny P.", 
    "review_text": "Small, but it packs a powerful punch.  I first came through here when I read about a special tapping of an unfiltered Pilsner Urquell, and it amazed me I hadn't been by before.   It's a beer-nerd's heaven. Probably 8 - 12 beers on tap, with hundreds available in bottle. And the folks that work there are beer nerds themselves, so they're happy to talk with you about the different types of beers they have and let you taste to figure out what you like.  It's definitely small, and being a really good bar across from Twitter* the appx. 40 seats (a few tables, and about five/eight seats at the bar) means that more often than not it's going to be pretty crowded no matter when you go. But if you can get there fairly early you can stake out a spot and it didn't seem to get so crowded you felt completely boxed in.  They have some bar snacks (olives, spicy nuts which are really tasty) but no real food so make sure to eat before you go face first into your beer. There're some really strong ones here!  * - they also supply some of the beer on tap at Twitter.", 
    "review_date": "2014-08-25"
  }, 
  "LCsEO9U2T6M72cp6P6GO4g": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Christina A.", 
    "review_text": "This is my go-to spot to grab a beer after work. Awesome selection of beer, cozy place &amp; fun employees. It can get a little loud in there but overall it's a fun spot.  Ideal spot to pregame before a show at bill graham. Just make sure you grab a burger beforehand!", 
    "review_date": "2014-10-09"
  }, 
  "p6qMidPaJ96LgB_9z7xZVw": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Anna W.", 
    "review_text": "One of my favorite places to grab a drink after work. Or on the weekends. Or whenever I'm in San Francisco, really.  It's a hop, skip and a jump away from Civic Center BART (for those of you who don't want to DD), and they generally have a good selection of beers on tap -- about 15-16 that they rotate periodically. Don't see something you like available on tap? No worries. Beer Hall also has several pages (see: 4-6) of beers that they offer by the bottle as well, sorted either by distributor or by type depending on your fancy. There's also an additional discount if you decide to purchase bottles to take away for later.  The owners and staff are very friendly, always willing to have a chat or offer up a recommendation if you're not sure what you want -- even if you're not sure what you like. They do offer samples/tasters that you can try before you purchase a full glass to hopefully guarantee that you enjoy what it is that you're consuming.  Their bathroom is one of the coolest ones I've ever seen. There's a black and white movie that plays on loop on the wall of Market Street in San Francisco during the early 1900s. It's amazing. It even has a soft music track that goes along with it.  It's simply a cool little venue in an area that's really starting to pick up (what with Twitter being RIGHT THERE and the spiffy new condo/apartment hi-rise that's going up pretty much across the street). They definitely have a regular in me!", 
    "review_date": "2013-10-11"
  }, 
  "3-Fdl-0rn3eE-ofvfoQqeA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joelle K.", 
    "review_text": "I love this place! 20 walking steps from my work. Good beer selection. Friendly staffs. Nice and creative wall. Reasonable price.  If you are a stout fan, go for no. 17! I would have given a 5 stars rating if they had had some bar bites to offer. All beer no food makes me drunk (too quick)! LOL!", 
    "review_date": "2013-12-14"
  }, 
  "u-Ii6mpA0jmMGdYXuyjMvg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe W.", 
    "review_text": "The BEST new addition to the neighborhood.  Mr and Mrs. Hall have outdone themselves creating a space that is ideal for conversation (the background music never overwhelms) as well as for meetings.  Streamlined, sleek and easy on the eye, the environment alone had me sold on making this one of our regular haunts.  Gotta love a place that has an interesting video playing in the lav.  Now, for the beer ... Such a great selection and so well thought out.  I could bring any beer snob along with me and we would all have ample options.  One of the few places in town that does their best to always have a porter on tap.  Major kudos for that!  Very impressed with Drew Hall's attention to variety of beer styles.  No matter how you feel about ciders, he always makes sure to have a good one for those serious cider lovers.    We are sold on this place.  Caveat:  5:30pm becomes a madhouse when the local businessfolk descend upon Beer Hall.  Arrive much earlier OR much later.", 
    "review_date": "2013-11-18"
  }, 
  "C469FeAyiATdaNmgXjZYWQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christophe C.", 
    "review_text": "Updating my review. Wouldn't come here so often if I thought it was anything less than a five. We've come to know everyone here pretty well -- they're some of the most down to earth San Franciscans I've ever known. We've laughed and cried along with the beer we've come familiar with (the \"Punishment\" will certainly make you tear up).  It's quirky and small, with 25 items on tap and an enormous library of bottled beer. If you love beer you're sure to love beer hall.", 
    "review_date": "2014-07-16"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "It's hard not to appreciate truth in advertising. It's also nice to see that very rare Young's Double Chocolate Stout on tap.", 
    "review_date": "2014-09-07"
  }, 
  "bBRPy8zUvNc0NGbGmkjrZg": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Jan P.", 
    "review_text": "I love this place! Pretty small and comfortable atmosphere with hip-retro taste. It's a good place to sit down to unwind after a long day at work in SF. You'll see a lot of tech-savvy geeks or engineers loitering around here sipping up refreshing breweries.   The only thing this place lacks is that they serve no food, but you can bring outside food here, though. Their beer prices are a little high end than usual bars. Great place to pregame up before a show at Bill Graham, which is down the block.", 
    "review_date": "2014-10-03"
  }, 
  "UM7l0shhmjxE3m3wV-n34A": {
    "user_rating": 3.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Ryan H.", 
    "review_text": "Deceptive name.  The place is very small.  There beer selection was good and service was pretty fast considering how crowded it was.  I would come back.", 
    "review_date": "2013-08-12"
  }, 
  "FIDPP65G4FxtZfqt5HwWWg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine S.", 
    "review_text": "The Beer Hall offers a large selection of beer and wine at the bar or bottled to go (seriously, what a beautiful wall of beer). They have around 25 items on draft, so you'll for sure find something you like! Drinks are around $7-12.  This pub is smaller than I expected, but I like that it's cozy! The owners and staff are all super friendly - they went around chatting it up with everyone. I can see why there would be a lot of regulars. ;)   I went on a night where they were featuring the fourth beer in the Game of Thrones Ommegang collaboration. If you ordered the GoT beer, you got to keep the glass afterwards, woot! We also got to play a little trivia, and winners won a bottle of the beer to take home.   They have two TVs, so we were able to catch the Giants game. Located close to Twitter and the Civic Center BART station, I know I'd be back to grab beers!", 
    "review_date": "2014-10-02"
  }, 
  "ra3OzaxpILytSjHRRKoT8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurel B.", 
    "review_text": "I perhaps could do less with pumpkin beer and more with a bitter, but bitter would I be without the Beer Hall in my neighborhood, especially given that you can order in from Little Griddle (with a reuben that one should not overlook).", 
    "review_date": "2015-01-06"
  }, 
  "905F8mAGzTC7DP7ZYnOJ2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel S. C.", 
    "review_text": "I enjoy simple, cool and casual.  Beer choices are decent and it's all good for my taste.  Nothing nicer than beer in a brandy or cognac sniffer!", 
    "review_date": "2013-10-12"
  }, 
  "H_DAhIymP_8kpu1kw07Xtw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina L.", 
    "review_text": "glad to have finally tried this place! popped up on my yelp search a while back, and because it is a bit out of the way, havent stopped by. BUT for some reason we were in the neighborhood today! yay!   the place is smaller than i had expected, with fewer selections on tap than i had expected, but theyve got solid selections, and we were happy with the quiet neighborhood feel. there is only one bartender on a sunday evening, and she took care of everyone quite well.  we tried a belgian brew, a coffee stout, and a double IPA.  everything was delish, and the bar bites also look interesting - but i was gonna cook later and didnt want to ruin my appetite.   anyhooo, bottles are 20% off if you carry them out, and they have an entire wall of bottle selections! mmm! we met a few people at the bar, and they were super friendly.  overall, very solid!", 
    "review_date": "2014-12-07"
  }, 
  "lUQIROHhJ6pOBMrOeome5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "The S.", 
    "review_text": "I would definitely come back. Great selection and atmosphere. Good amounts of shared and private tables. Near perfect bar execution.", 
    "review_date": "2014-07-23"
  }, 
  "m1KeH5M9tA_9A_1U5_hxwA": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Josh S.", 
    "review_text": "So this review may be a bit unfair as I came here for a wedding in which the bride and groom closed down the bar and gave us cart blanche with their incredible beer list. Now I haven't been to a candy shop in a while, but damn if those memories didn't come rushing back.  While I may not have paid for any of the drinks, the prices were on full display, and I must admit, being someone who drinks a ton of beer, they were very reasonable. I also have to give a shout out to all of the servers. I probably interacted with each of them that night, and they were all extremely knowledgable, friendly, and helpful when it came to ordering. They know their shit, and it shows.   Now on to what I ordered. I started out with the Upright Brewing Seven, then tried Cascade's The Vine, followed by Upright Brewing Four, went dark for a bit with the Prairie Pirate Bomb before jumping to Hanssens Artisanaal Oude Kriek (none of that is a typo), followed by various drafts. I mean, that's one hell of a list.  If you are serious about beer, this place is a must. I can't wait to make it back.", 
    "review_date": "2014-11-11"
  }, 
  "W2gmz5vaLCl8aOUTPDN38Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jesse N.", 
    "review_text": "Awesome selection of a huge variety of beer. A much needed craft beer bar that is bound to become a staple of the neighborhood. Really just well done through and through, from the beer wall to the live updated tap list. This place gets excellent and hard to find kegs that range all over the beer palate. Fresh \"Drink By...\" IPA from Stone? You had me hello.", 
    "review_date": "2013-11-23"
  }, 
  "D2epirooWNjvwTI6MFhNGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susy C.", 
    "review_text": "Small, low-key space. Honestly, if you don't know this area well, you wouldn't notice this spot.  It's one big square. When you walk in, the bar is on the right. Tables fill up the rest of the place.   Liked the spread of beers on tap. They've got about 20 or so. They've got a bunch of bottled beers you can purchase to take home as well. Small selection of bar snacks, but didn't really bother to check them out since I went to eat elsewhere. Service was a bit slow and they got our drinks wrong but we figured it out.   Here's the catch.  A tad bit overpriced as beer aficionados have mentioned. I guess they're pandering to the Twitter and eNEMA folk. Meh.   Still, it's decent spot to drop in for a good brew after slaving away at the office.  P.S. To the techie (_|_)s who laughed at me for taking a photo of my beer with the cool bottlecap wall as my backdrop, go play in traffic.", 
    "review_date": "2014-07-10"
  }, 
  "GrktSJ7Bv9t37gwDLIlAwg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "The Beer Hall is my new watering hole. It's got a kickass location in reviving Mid-Market. The owners Drew and Jennifer Hall are friendly and nice. The place itself is not so much a hall. It's more like a small lounge. There is only one restroom, which can be problematic when there's a large crowd. Kudos to the looping 1906 Market Street footage though.  Now... onto the beer! They have a great selection on tap. There are easily at least 15 beers on tap in a variety of styles. There is one Beer Hall beer, which is not made in house. It's an ESB made in San Jose, so I guess it's a contract beer. It's still in the evolving stages, but they consistently serve it anyway. All other beers range mostly from $5-8. What's most impressive is their bottled selection. I don't usually ordered bottled beer when there is good stuff on tap, but place literally carries hundreds of beers and some as low as $2.50 per bottle. It'll take me months to get through the list, but you can't blame me for trying.", 
    "review_date": "2013-09-04"
  }, 
  "UK-nkxH4s9Vb08jdlJ8pKA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Namrata J.", 
    "review_text": "great variety! and i love the to-go deals ;) it's cool that it's so close to where I live, as they have good music and a nice ambiance. Exactly what you need in a go-to bar!", 
    "review_date": "2014-09-23"
  }, 
  "50W6VKW498OCuH2itdEbfw": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Kenny J.", 
    "review_text": "Excellent pub in the Civic Center!  It's a bit small inside and can get really crowded, so be prepared to wait or stand. Pretty easy parking in this area at night.", 
    "review_date": "2014-12-07"
  }, 
  "f_R0MRqk24gCcc4vDhE6Wg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Aneilia M.", 
    "review_text": "Came here for SF beer week and the place was so cute (and crowded). We were lucky to find a table for too. Their Beer Week event was set up like a blind taste test and they had raffles during the event as well. Never found out which beers we liked the best but that's ok. There was a little snafu with the bill but they corrected it immediately.  Definitely will want to come back!", 
    "review_date": "2014-02-16"
  }, 
  "OWQKrrv2aepcFLUafoZ9BA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian M.", 
    "review_text": "This is a great addition to my otherwise sketchy neighborhood. Friendly service and a great eclectic beer selection.", 
    "review_date": "2013-11-24"
  }, 
  "sG_jdDw7gY5c4zbRhaNBug": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shringar P.", 
    "review_text": "The range of beer is amazing. They really have a very large number of bottles of beer. But the beer on the tap is really good. Again, they have quite a selection on the tap.  The place is pretty small however and it can get really crowded in the evenings. Can also be extremely noisy and loud, but when you are having beers, the noise does not really matter I guess.", 
    "review_date": "2014-09-11"
  }, 
  "dnGIi-OjEui4OSsmLQ2lPw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sunny S.", 
    "review_text": "I want you to ask yourself the following questions: (1) Are you a beer nerd? (2) Are you committed to your beer nerdiness? (3) Are you gainfully employed at Twitter? (4) Are you totally pissed off about SQL OR Sequel? Or any computer program, in general? (5) Are you male?  Ding-ding-ding! If you answered yes to any of the above questions, then congratulations! You are going to love this spot.   As one of the only females up in this piece, let me answer some questions for you:  --Yes, the beer list is stellar. --Yes, I did start with the Wet Hop IPA from Berryessa Brewco (7.0% ABV). Yes, it was recommended by the bartender. Yes, it was delicious.  --Sure, I did move on to the Deschutes Jubelale (nitrogen). Of course--that's a dumb name for a beer, but it is delicious.  --The Lakers/Clippers game was, in fact, playing.  --Brogrammers from Twitter were, in fact, bitching.   Friends, this is good times. Only open until 11:00 p.m., so you can't get into too much trouble. Have I found a new hangout? Yes. Is the location bizarre? Yes. Am I deliriously exhausted from being sick with a random flu the past 5 days? Clearly. But that shouldn't dissuade you.   --AWESOME BEER LIST. --NICE BARTENDERS WHO ARE KNOWLEDGEABLE ABOUT BEER.  --WEIRD, RANDOM LOCATION.   It's a win-win, friends. You're welcome.", 
    "review_date": "2013-10-29"
  }, 
  "i72fdXYYPunDWN5YJJOJYg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah J.", 
    "review_text": "What a welcome addition to the Civic Center Happy Hour scene!  So welcome, in fact, that I may have been to this bar three times in the last week... no comment...  The staff is friendly and knowledgable (the owners' last name is Hall... get it?  get it?), the space is warm and inviting, and the rotating beer selection couldn't be better.  Everything you find on their giant beer wall is available chilled, and there are even a number of beers you can only find on tap here, like their Beer Hall ESB.  Personally, I am having a mild love affair with the St. Bernardus Abt 12 Quad.  Can't wait to see what they do with the food program and wine list as the business continues to grow!", 
    "review_date": "2013-08-26"
  }, 
  "jizp2g6oKz70aSGOitG2Iw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Charles C.", 
    "review_text": "Too many four stars...this place is a 6 star joint.  best staff, best beer, great food.", 
    "review_date": "2014-07-11"
  }, 
  "MZXdjB_SeHYoxAeeHyAQnQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "W W.", 
    "review_text": "My new favorite beer place in SF.  It's got the selection of city beer store, but actually nice and comfortable inside.  Plus there seem to be a few less beer nerds and even a big tv.  I wish I lived/worked closer so I could hit it more often!", 
    "review_date": "2013-10-04"
  }, 
  "DdsU7PkQqovVXoFnbHiG2g": {
    "user_rating": 5.0, 
    "user_location": "Wellington, New Zealand", 
    "user_name": "Wendy C.", 
    "review_text": "Great place, great range, great staff - cant say much else really!", 
    "review_date": "2014-04-10"
  }, 
  "CX71NDrxCkcuXICKMz3mww": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "David W.", 
    "review_text": "Great new beer place with an interesting selection of beers on tap, nice ambiance/decor, and a cool video of 1906 San Francisco playing projected on the wall in the bathoroom!  I'll be back here again for sure.", 
    "review_date": "2013-10-02"
  }, 
  "9d9kgq7womnxi_NGKsJMEA": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Frank J.", 
    "review_text": "Very solid new drinking spot for beer lovers. The location is great and the selection is as well. I will definitely have many more visits to this place.  What I Like: -20 beers on tap from California breweries. Mostly local small craft breweries and some low production offerings from some of the larger breweries. -Prices for beers on tap and for their bottle selection (200 plus) are very reasonable. -The owners and bartenders are friendly, helpful and offer tastes if you are not sure what you want. -Extremely mixed crowd so everyone should feel welcome. -A few wines available if you are coming with someone that prefers that  Downside: -Small location, which I actually liked, but it may get crowded once the place really takes off. -When I came there was no food whatsoever and I was really wanting something salty to snack on.", 
    "review_date": "2013-08-14"
  }, 
  "W_MuoJIhSJYCXJ3q6TkyWA": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Justin Y.", 
    "review_text": "Cool little beer spot located on mid-market. They have a ton of different beers on tap and in bottle. They have pretty much anything that you can think of. My favorite was their chocolate porter. Can't go wrong with a porter on tap. They have 21st on tap along with anchor steam and many more. I will definitely come back here.   It isn't the biggest bar on the block, but a great size to grab a drink with a friend. I wouldn't recommend coming here with a party of 20 however you can probably still squeeze in.", 
    "review_date": "2014-10-20"
  }, 
  "FJ0rC_wSYepkvze9w4Wo2Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jared C.", 
    "review_text": "Great, new spot with very friendly and knowledgeable staff. It's a small and cozy place that has over 200 beers available including about 24 on tap. Hopefully, they will get a kitchen soon as they have food trucks coming by once a week right now.", 
    "review_date": "2013-08-24"
  }, 
  "vXHLjlo-6RZSPdYZDYUwew": {
    "user_rating": 5.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Robert F.", 
    "review_text": "Great first drink and first impressions. I'll be back with friends next time. Love the location.", 
    "review_date": "2013-08-07"
  }, 
  "FWmsy4-CvM4vtSDpcEyHTA": {
    "user_rating": 3.0, 
    "user_location": "Rochester, NY", 
    "user_name": "Meg M.", 
    "review_text": "Came here to check out a World Cup game after Pride  Let's begin with the good: They have a great beer selection and the space is really modern and pretty.  People seemed to be festive and the place gave off that friendly vibe.  The bad: The beers were  over priced for my price range but I guess you pay for good selection. Also, I got charged for club soda which I know is fair but come on, have some love for the designated drivers.  Normally, I'm told, they don't have food and we came on a day they were testing out a new vendor.  The food was astoundingly gross.  BUT you're not likely to have to experience that if you check out Beer Hall in the future.  Service was slow and inattentive.  Never checked on how we were doing.  Granted the place was packed.  If I was in the neighborhood I'd be happy to give it another try.  Definitely a cool concept in the area with lots of potential", 
    "review_date": "2014-07-01"
  }, 
  "27bo7NjDzqzigrtz1ZsTDw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chan L.", 
    "review_text": "Great and large variety of craft beer and wine on tap, bottled, or available for you to bring home.  The customer service is excellent and a laid back group.  They only have one bathroom and it gets very loud and crowded during the time when the people who finish their 9-5 working day schedules.  When the crowd dies down, nice place to bring a date or have a have a nice conversation with friends.  The food is a bit pricey but very edible, and the beer is fair price and from local areas.", 
    "review_date": "2015-01-18"
  }, 
  "Z5EoiNHWR1i6TjszVMsbXw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve H.", 
    "review_text": "One star for be simple reason, you're closed on a fracking Sunday. When do you think people drink? Ever heard of football and beer? Will never be back.  #FAIL", 
    "review_date": "2013-10-06"
  }, 
  "D01KrKs9izEdoT0Eh4i4rQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dipesh G.", 
    "review_text": "Situation Saturday afternoon/evening drinks with friends   Pros - Great beer selection - Awesome service - Extremely clean   Cons - It could probably be a bit crowded for happy hour", 
    "review_date": "2014-07-19"
  }, 
  "S8MPO_P1QW0YjZsqyAIoLg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aalok P.", 
    "review_text": "This place has so much potential.  Already forming great events like today's release of Velvet Merkin.  Big fan of the digital menu too.  Unfortunately, that's where it ends.  Their bottled beers for purchase are ridiculously overpriced!  They were selling Seizoen Bretta for $16+, this farmhouse ale is usually $12 at City Beer Store and often $10-11 at other small spots.  Word of advice: Don't assume your location is sufficient rationalization for such a premium markup.  The beer geeks you want to attract can take their money to more affordable places in the city.", 
    "review_date": "2013-10-08"
  }, 
  "gJJBA3Cf4EaczFgD4Xhfqw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ned D.", 
    "review_text": "I love this place. It combines dive and class beautifully, which is even reflected in the price of their beers; they tend to be very cheap or very expensive, with not too much in the middle.  Friendly, attentive staff with a ton of great suggestions for every taste. Best of all, of course, is their fantastic variety and quality of beers from all over for every palate. While snobs will be satisfied, it's also very easy to find something for everyone, including the very casual crowd.  The only negatives I can think of for this place are 1) no food (I'm not sure why, probably it would mess up their simple execution style) and 2) So low-key that it's easy to miss even if you walk right by it outside. Seriously, I often have to wait outside to meet friends and guide them in because it's so nondescript and the sign is so small. Could use a marketer.  Overall, though, I love this place, and whenever I'm nearby I try and stop in.", 
    "review_date": "2014-07-11"
  }, 
  "MKrCIkMT8baMkATt4fmzag": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Alice C.", 
    "review_text": "New place in town, 20 beers on tap. 280 on the bottle list.  Quite, hasn't become a scene yet. Mostly local or Twitter folks drop in for a drink.  Friendly staffs, and you can bring outside food in as they only serve delicious beer that will wash down whatever you are eating smoothly.  Only downside, the place close at 11pm!", 
    "review_date": "2013-10-17"
  }, 
  "kWMgqjOSjQOVfEia8uDNpg": {
    "user_rating": 5.0, 
    "user_location": "Hoboken, NJ", 
    "user_name": "Dinkar K.", 
    "review_text": "If you're looking for a place to hangout for a couple of drinks after work, this is the place to be. You get to choose from a variety of beer options. If you find yourself confused at any time, speak to the staff and they'll always be ready to help you out. The prices are reasonable. The place is open from 4-11pm, but it is closed on Sunday, which can be a bit dissapointing for many beer lovers...:D", 
    "review_date": "2013-10-29"
  }, 
  "Zc8bcP2MtEigwrkLgWs6qQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth H.", 
    "review_text": "A small place, but with friendly service and great selection of beer.  The staff was helpful and made good suggestions.    The decor was fun and music was at an average volume so I could still carry on a conversation with friends.", 
    "review_date": "2014-03-14"
  }
}