{
  "hPCMsao_S3NU_ss53PTkgQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chloé M.", 
    "review_text": "The one time I went here was actually on their one-year anniversary - a friend of mine is a wine rep and they are one of their clients.  Immediately I fell in love with the place because it's so cute! And they have this great open/lofty feel. And ingenius seats that fold out of the wall if you need more seating.  I just had cider - and off-the-menu chicken nuggets/boneless wings that were pretty darn good. There was a live band, and the place just had a great vibe.   I will definitely be going back.", 
    "review_date": "2013-04-04"
  }, 
  "CH1SB2YaLHrW_recHdCWmA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew M.", 
    "review_text": "I've only ever come by for coffee and for a quiet place to read, but I dig this place a lot. Casual with a bit of fanciness, and very mellow. It would be a good place to meet someone for a drink, or maybe to meet up before a movie at the Kabuki or a concert at the Fillmore.  They also serve Four Barrel coffee, which is a plus in our neighborhood low on great coffee options.", 
    "review_date": "2013-04-11"
  }, 
  "p08F3g2_lSSdzyjnVcvt4w": {
    "user_rating": 2.0, 
    "user_location": "Los Gatos, CA", 
    "user_name": "Byron L.", 
    "review_text": "Expensive appetizers!  Drinks are watered down.  But the dark wood decor is nice and location is convenient with ample parking.", 
    "review_date": "2012-10-22"
  }, 
  "g2suJFocl9hulyB67UQCVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mel D.", 
    "review_text": "Good SanFrangria (Red Sangria) - I had a buzz going with the first one, I had two so I was doing really good after the second one. Happy Hour price was $5.  They also have food.  I loved the ambiance. It was small but very trendy and chill. The owner girl was super nice, the other bartender was not as friendly but he was efficient enough.   They are sort of a cross between a coffee shop and a lounge.  I think they have a beer and wine license because they alcoholic beverages seemed to be more wine, sake and beer related.    The lounge is off Geary across the street from the backside of the Japan Center. I didn't even realize it was there until I saw it on yelp. If you are looking for a cool little spot to grab a drink and you are in the J-town area, this place won't disappoint.", 
    "review_date": "2014-09-26"
  }, 
  "yKi3pg1xkQcgB2CMZkyIQQ": {
    "user_rating": 1.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Dan B.", 
    "review_text": "Unfortunately, nifty interiors don't equal good coffee. I could only get through 1/2 of the weak, watery mocha I ordered. My wife's cappuccino was equally uninspired. Too bad, we were hopeful for this place. Maybe when the cafe transforms into a bar at night it's better?", 
    "review_date": "2012-02-11"
  }, 
  "qPGhjScyxtuHrWXN4A8VXg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Loli L.", 
    "review_text": "This was an incredibly perfect spot for our bookclub gathering.   We sat at one of the wonderfully long solid wood tables with tall but comfy seats. I enjoyed a nice croissant with my morning black tea while my companions had coffee with their pastries.  My gaze drifted occasionally to the padded wall. Had I been more awake, I might have tested it properly.   Every once in a while I felt a tinge of nostalgia during one of the many songs playing in the background- not too soft, not too loud - and certainly not too distracting from our bookclub conversation.   Excellent spot to meet a date, meet some friends, study, or get some love letter writing done.", 
    "review_date": "2012-02-27"
  }, 
  "BSVThVjjFaF5orzkW7Of7Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Don L.", 
    "review_text": "I came to Social Study with some friends for a solid pint of Guinness on the beautiful afternoon of St. Paddy's Day 2013 (disclaimer: it was still early so I wasn't drunk yet at that point). The place has got a sweet atmosphere, and the staff were super friendly.  There were a bunch of (what appears to be) students working/studying there. The atmosphere certainly makes it a good place to do just that. They had comfy chairs, which fitted well with the tables, which fitted well with the stuff hanging on the walls, which fitted well with the hipster-ish looking upper \"deck\" in the back.   I would definitely go there again, and would recommend others to visit.", 
    "review_date": "2013-03-25"
  }, 
  "Yi5JKaD1VY4Edeww92PZWA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Regina L.", 
    "review_text": "The Social Study is  a pretty average place. I do really like their decor and their collection of board games, but there's something lacking in the place. The menu is pretty decent, although I would like a more in-depth description of the wines.   My main issue with the venue is their service. We were there on a Thursday night and there was only one bartender. She was, to be honest, pretty incompetent. She messed up our order, poured wine all down the stem of the wine glass and never wiped it off, and then the biggest offense came at the end of our stay when we closed out our tab and she gave us someone else's credit card! Apparently she had already closed out someone else's tab with my fiance's credit card, they left with it, and then we were given that person's card. Needless to say the person who was given our credit card bought themselves dinner at State Bird Provision and we had to deal with the credit card company and cancel our card the next day. We won't be going back.", 
    "review_date": "2015-01-02"
  }, 
  "pYnOLcg4-cgQjSLUiaSg4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ezequiel R.", 
    "review_text": "Seriously, I've found my new favorite bar.   I came here on a breezy Friday afternoon and was checking out The Fillmore District. I wanted to have a libation after my long walk from Noe Valley so I consulted Yelp and stumbled upon this beauty. Harmony, the owner, greeted me kindly and helped me decide what to try first.   First up - a light mixed \"beertail\" that has lemon and ginger in it! So Good!! And completely appropriate for after 12PM :P   While I sat at the bar, I had a lovely conversation with Harmony. What  I liked most about this place was if you wanted private time, there is plenty of space for it but the people of this place made you feel really welcomed. Striking up conversation with people was very easy here.   I stayed reading and chatting for about 3 hours. I definitely will be back again to check out the night crowd.", 
    "review_date": "2012-09-04"
  }, 
  "6-u4oSY5fhX747oeIWOAMg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angie O.", 
    "review_text": "Great place to work-- but don't come here --I don't need you taking up my \"office space\".", 
    "review_date": "2013-06-26"
  }, 
  "uERlyO-ASZag6XXouCrkhg": {
    "user_rating": 5.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Laurie V.", 
    "review_text": "Talk about how in love I am with this place.   When I first walked in, it just looked like a busy, cool, hipster bar with brick wall interior and thennnnn, I saw break dancing videos being played on that wall. How dope!!!!!!   A friend knew the owner and she hooked it up with drinks and it, oddly, reminded me of an updated/cooler CHEERS bar lol (remember that show from the 80's lol)   We stayed there for a few hours and enjoyed the hip hop music. Very different from the vibe and music of Vegas.  I love San Francisco!", 
    "review_date": "2014-09-25"
  }, 
  "7uv-lcOP3UdjDC8K4pwr_A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiarra E.", 
    "review_text": "Great ambiance and excellent music! One star off because the drink I had was terrible. But of course, it's alcohol, so I drank it....", 
    "review_date": "2013-10-14"
  }, 
  "YIxaYUtR6QNrDbxsx7IJyA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Serk T.", 
    "review_text": "oooh so good! Must try the Sangria....best I've eeeever had and it's made in-house by the handsome and super talented Ryan.", 
    "review_date": "2015-01-03"
  }, 
  "GNqG1lv4v0cJSFtxRJ-bxw": {
    "user_rating": 5.0, 
    "user_location": "San Diego, CA", 
    "user_name": "C. P.", 
    "review_text": "Nice beats with casual atmosphere. Great selection of boutique wines. Perfect place to drop in and chill.", 
    "review_date": "2012-09-09"
  }, 
  "I0uVl5R7De0lIpm_iKBVXw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nav N.", 
    "review_text": "Great place..amazing atmosphere..friendly service and brilliant music!.. Helps that I live a block away..a top neighborhood bar! Cheers", 
    "review_date": "2013-02-28"
  }, 
  "mpm9olv35gqQePUdQvK62g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah B.", 
    "review_text": "Was on a work offsite and brought our group of about 12 here between movie and dinner. Though it's a small setting, it was perfectly sized for our group and we took over most of the tables. The bartender was very generous at accommodating us and poured some really good drinks, and quickly for a group our size. I don't think they have a hard liquor license because cocktails are made with soju, but offerings are inventive and beer and wine list are good, and also inexpensive. I wish I worked near here because I would come back for happy hour all the time, to enjoy the cozy vibe and reasonably priced drinks.", 
    "review_date": "2014-12-29"
  }, 
  "4aWNZNBGRetGOcdgwRq2Kw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon C.", 
    "review_text": "A good bar is hard to find. It's true. In a city that's abundant and crowded with the white noise of adult beverage lounges, the one is hard to find. You may be into the loud bustling scene of Rickhouse, or the sophistication of Press Club, or the music bangin' Badlands; there are so many scenes and choices. But if you're looking for somewhere trendy, clean, friendly, with a touch of relaxation, Social Study in the Fillmore is for you!  Taking the disguise of a café, the place serves up some of the yummiest cocktails and wine-tails. The place is complete with an actual espresso machine and WiFi, so it actually is a café. And the bites they serve can compete with any restaurant appetizer (the pork sliders were yummy). On the brick wall, movies are playing, not so much for viewing pleasure, but a nice trendy touch. And the icing on the cake, is the music flowing in the air. In my one visit, I heard Janet Jackson, the Fugees, Montel Jordan and Koffee Brown. You'd think it was my personal playlist on there.  Need a glass of wine to have a casual encounter with a friend? Come here. Need to unwind? Come here. Heck...it's Wednesday? Come here.", 
    "review_date": "2013-01-10"
  }, 
  "aB8ixYhATXFRTELyFan3Hw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle W.", 
    "review_text": "Great spot for meeting friends to chat. I love the space, good music and you must try the sangria.", 
    "review_date": "2012-04-07"
  }, 
  "F91CoYW1BnRwZlOImLq3Og": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jack R.", 
    "review_text": "This is my favorite lounge and coffee place in the City!  The vibe here so so cool.  Funky smooth R&amp;B in the background.  Wonderful soy lattes.  And, unlike most coffee places, open late.  I really like the brick walls.  It reminds me of the imaginary loft I want to own, but can't because I haven't won the lottery, yet.  Plenty of 2-seater tables.  And, nice long benches for those large groups.", 
    "review_date": "2012-06-24"
  }, 
  "3hWhXTkU83jsm3jIA-rkIg": {
    "user_rating": 4.0, 
    "user_location": "Alhambra, CA", 
    "user_name": "Richard P.", 
    "review_text": "The social study is a great spot near my apartment. Its a great spot to chill, do some work, or hang out with friends. They music is great and they offer both drinks (beer, wine, sangria,etc) and coffee. It's a unique spot!", 
    "review_date": "2013-05-05"
  }, 
  "ti4lRf8rv9KICw6msOJT0w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ameer N.", 
    "review_text": "Great little bar off of my beaten path. I just hope I remember that it's here in order to stop by here when I'm nearby.  I liked the design of the side tables.", 
    "review_date": "2013-01-23"
  }, 
  "cvlR6Yd10ogdOuA1t4YZDA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lissette L.", 
    "review_text": "Super sweet spot.  A lot cooler than anticipated. It doubles as a bar/cafe but the ambiance and decor is so unique. It's an awesome find and chill spot to meet up with a friend to catch up or do work on an afternoon. I would recommend this place-- it has a LOT of character and is one of those great finds in the city!", 
    "review_date": "2013-09-18"
  }, 
  "NOUfyJW-BAo_-Cbfo8edww": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Lolia S.", 
    "review_text": "Laptop camper here. While I like the concept of a social hangout space, but something feels like it's missing. The Four Barrel lattes ($4) are excellent but the breakfast pastries (scones, muffins, croissants) are run of the mill. The pound cake ($2) was dense and dry. The morning bun was okay but after heating, was still cold inside.  I wouldn't mind getting a sandwich or bagel but they don't have anything besides pastries till evening time.   Of course I love the library inspired décor with old books, old albums, and the exposed brick wall. The chairs aren't comfortable. The free wi-fi is fast but there's only one outlet.   The DJ booth above is always empty during the day. They play music pretty loud even during the day (when there isn't a DJ), so it's hard to actually study or concentrate.   Shouldn't a study session be quieter?   You know you love me. X0 X0, laptop camper.", 
    "review_date": "2012-06-08"
  }, 
  "BrETNZLefIOtiqcNX2pdrw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan K.", 
    "review_text": "happy hour", 
    "review_date": "2013-08-13"
  }, 
  "7gUfWZKZiZ0Dm7oyj0YIsg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seamus B.", 
    "review_text": "Inexcusably poor service. I inquired as to whether the bartender/barista recommended a particular mixed drink. He, despite it being his first day on the job, responded that he did. The drink was DISGUSTING. I hand it back after two sips and order a beer. At the conclusion of my stay, the bartender/barista insists upon charging me for the recommended/terrible/unconsumed drink. I have been a service professional for over two decades, and it makes me sick to my stomach to think that this person can claim to be in the same industry. I used to be a regular at Social Study, but some affronts simply cannot be brooked.", 
    "review_date": "2013-05-13"
  }, 
  "_aSs5dSAabuwnXUGBPzASw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Genevieve Y.", 
    "review_text": "Date &amp; Time:  Thursday January 12, 2012 @ 3pm Scene:  Locals in Layered Tanks, Sweaters, Minis &amp; Tights Vibe:  Chill Music:  Prince Decor:  Classic SF:  Exposed Brick Wall,  Book Lined Shelves, LPs,  Communal Table, Blue Vinyl Booths Service:  Trendy, Attractive Staff Imbibe:  Four Barrel, Beer, Vino &amp; Sangria Available Devour:  Roasted Nuts, The Board Meeting(Charcuterie) &amp; Cinnamon Rolls Total:  $21", 
    "review_date": "2012-01-12"
  }, 
  "UrEoHL6orD1_hd_trKHfMQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Islam I.", 
    "review_text": "This place is incredibly amazing: people are nicely dressed, drinks are good. And the most important part, the staff is incredibly kind and helpful.", 
    "review_date": "2013-02-24"
  }, 
  "ZqEW0hByiV8PtMvHS00OIw": {
    "user_rating": 4.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Quentin J.", 
    "review_text": "A friend and I stumbled upon this new addition to the Western Addition/Fillmore District and ducked inside to investigate.   Really rad space! Exposed brick adjacent to rescue, blue couch cushions. Innovative ledges and tables jut from the cushioned walls to provide intimate two top seating.  Unfortunately it's comfier on the eyes than the ass, but the large tables and chair make up for the lack by providing ample room for studying.  Additionally few couches offer lounging for long chats with friends. Given it's attributes, \"The Social Study\" is an apt nomer.   The Social Study offers Four Barrel Coffee, but AVOID the drip coffee! It is not made by the cup as I assumed rather lives in a store bought plastic urn for who knows how long. My cup of joe tasted old/bitter, and I later found a bunch of sludge at the bottom and in my mouth upon final sip. For $2.50 you deserve better.   INSTEAD get an expresso drink.  My friend's latter was delicious. Good expresso and quality baristaship on the foam.   Despite the step-backs I optimistically rate 4 stars. The spot's only been open a few months and will inevitably iron out it's kinks because it has already got a good thing going.", 
    "review_date": "2012-04-04"
  }, 
  "YSzX2MUFDmB1PgH_F_LdmA": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Roop K.", 
    "review_text": "My favorite bar in SF. Awesome drinks, Neo soul + soul + alt rock for a soundtrack, the 'study snack' food menu, movies at night, four barrel coffee, and plenty of books to read. Need I go on?", 
    "review_date": "2013-08-17"
  }, 
  "RRKh4arZsGKc-6zoL_XV4w": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Molly S.", 
    "review_text": "I got a nojito and some pork sliders there recently, and oh boy, I experienced food poisoning for the first time in my life! Within one hour after I ate there, I started breaking into a cold sweat and feeling dizzy and nauseous. It was right before a live show and I had to rush out through the screaming crowd and vomit like a baby. It was the worst feeling I've ever had. I'm sure it was the food that I ate there that got me sick because I hardly had anything else to eat all day that day.", 
    "review_date": "2014-05-21"
  }, 
  "sxvINu_o4VKaDksvnwwSIw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jefferson T.", 
    "review_text": "Been to the social study about a half dozen times.  Each time was a great experience.  Such a unique place in SF.  Harmony and her team treat you warmly each and every time.  Guinness, Wine and Coffee always delicious and available but try the food - surprisingly good.  Such a unique find.  Cool hangout place.", 
    "review_date": "2014-05-22"
  }, 
  "8KDipZ9q5fo4WnlZIe9JKA": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Kelly M.", 
    "review_text": "Have wanted to check out The Social Study for some time.  I was pleasantly surprised. Loved the decor, music, menu options, overall scene.  Welcome to the neighborhood!!", 
    "review_date": "2012-03-24"
  }, 
  "hLjL4AL47mmRfnEFkr8HRg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jason S.", 
    "review_text": "Whoever created this place, knew _exactly_ the type of place they wanted to create.  Also... Spicy Coke!", 
    "review_date": "2014-02-23"
  }, 
  "oo_z27ghyPyT1-QS4P1kTw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jasmine D.", 
    "review_text": "BEST SPOT IN THE FILLMORE!!  Love the atmosphere (exposed brick with navy blue walls) and the staff is crazy attractive.    They only serve beer and wine, but the prices are very reasonable and the Sangria is delicious!  I will be back as often as possible to listen to the dj spinning my tunes and have good conversations with friends.  Finally a bar that you can feel comfortable just hanging out and reading a book in, yeah I know I am a dork.", 
    "review_date": "2012-01-29"
  }, 
  "bPOwZhbJ0goXsE_-EwJ4zQ": {
    "user_rating": 4.0, 
    "user_location": "Raleigh, NC", 
    "user_name": "Matthew C.", 
    "review_text": "The bar was great. The beers were awesome. They had a random documentary playing which was actually quite interesting. The dj rocked and the ambiance was really nice. Apparently they do coffee in the morning? Would repeat.", 
    "review_date": "2014-07-18"
  }, 
  "p5eKzfGUZ7duXbDM0AM5bA": {
    "user_rating": 4.0, 
    "user_location": "Indianapolis, IN", 
    "user_name": "J T.", 
    "review_text": "Usually when I'm out and about and computer enabled I'm having coffee. Here though, on Saturday afternoon, wine seemed like a better approach - and it was. After a couple of glasses, everything was ever so slightly better. The BLT was good too, especially the small side salad that accompanied.;", 
    "review_date": "2014-03-02"
  }, 
  "ehCameIBK2g7dw5rRXpvzQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Myla A.", 
    "review_text": "Update March 2012: I'm adding another star because Harmony and her crew deserve it. She knows how to treat her regulars right, or anyone else in off the street. They've also added a happy hour and the tacos and sliders are bomb dot com!  Now that I've tried several things off the menu, I feel safe in writing a review. I live just on the next block, and I definitely agree that I'm glad I don't have to leave my hood if I just want a beer or a coffee and a low-key, but comfortable hang out. Believe me, that wasn't true when I first moved to the hood in '04.  Harmony makes a great latte (not a huge Four Barrel fan, but she does right by it), and I could drink a tennis bracelet's worth of Yellow Diamonds - a sparkling winetail. If it's got bubbles, I'll drink it. I like to stop by after farmer's market on Saturdays which is perfect if I can't decide on coffee or alcohol or both. I like the oldies R&amp;B on the turntable perfect for chillaxin' and dreaming up what I'm going to cook with my farmers' market veggies. They've usually got some nice pastries, too.  I dropped by after 4p the other day to check out their cheese n charcuterie boards. For some reason, I assumed it was a sandwich, but close enough. I chose Fiscalini Cheddar (try Fiscalini Gold - great local cheese) for my Branch and Board plate. One of the meats (which I've forgotten already) would be great for a picnic if you're a bacon fan - smoky with paprika. I liked the vibe at this time.  I do like the ambiance - exposed brick, dark wood bar, timeworn books atop the shelves, and a rich looking upholstered blue wall with jumpseats at two-tops.  Hmm ... and I was just wishing for a place where I could read a book and have a beer or maybe play a card game with a friend where my choices aren't limited to coffee and tea.  I'll be looking forward to a few more menu items and a happy hour. I've got to try the sangria, and it's good to know I won't have to get behind the wheel to get home.", 
    "review_date": "2012-02-04"
  }, 
  "HMTTFH9gEJ0gLCVQXqv2fg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lina L.", 
    "review_text": "Decided to come here to get some work done and get some coffee. The honey latte was great, and the atmosphere, though louder and a bit darker than I expected, was great to finish up some work related things. I didn't try out the bar, but it's definitely on my agenda now. As past reviewers have commented, I'm surprised it wasn't busier, because this place is great!", 
    "review_date": "2014-07-11"
  }, 
  "bXc7_hewD5ledvVkaS4erg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Taffany H.", 
    "review_text": "Cutesy lounge with a very intimate vibe right around the corner from State Bird, I stopped here for a quick drink and catch-up and liked the fact I could still talk in my normal voice and actually have a conversation over a few glasses of wine here. Very cool.", 
    "review_date": "2013-01-05"
  }, 
  "1a2VkaFdUOignbqk5JhKVA": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Alan P.", 
    "review_text": "I don't know about for others, but trying to study over loud R&amp;B and gangsta rap tends not to be very effective.", 
    "review_date": "2013-08-27"
  }, 
  "Ax_1fviUCN0KvIvOkS_CGQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JustinE Y.", 
    "review_text": "4 stars for interior decor and ambience.  3 stars for service and quality of barista   Randomly stop by and see this artsy cafe/wine shop, I told myself conning in and try.  First impression, wow... artsy and nice decorated. Love the theme of film, literature, music.... Nice selection of wine, beers, beertails, winetails, coffee and some bites.   Ordered a cup of mocha, waited...  Barista forgot it. It's okay. I'm not in a hurry at all. I feel disappointed by the quality of the taste not service.  Just an ordinary mocha. No presentation, taste ordinary...  Maybe a better barista to make a cup of better coffee? Everything will be perfect then:p  Forget about my coffee, I like the place at the first sight. I will definitely come back for wine/ beer.  As a wine/ beer bar, they open late around midnight. Live music featuring by different DJ, Jazz music included... Cannot miss it", 
    "review_date": "2014-03-23"
  }, 
  "fMMKEb47PW3EPUtAjsvnNQ": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Estelle C.", 
    "review_text": "Just stopped by for a quick cappuccino. The decor/atmosphere of the cafe was really cute and hipster. If I'm ever in the area again I'd come back and actually study or read here.", 
    "review_date": "2014-06-18"
  }, 
  "77oOiMNqUXz-sk-f6RCdoA": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Jessica Z.", 
    "review_text": "After eating at SPQR, my friends and I wanted to get some drinks.  Checked my list of bookmarks and decided to check it out.   Once you walk in, there's music and a movie projecting to the  left side which is all brick. I believe last night's movie was half baked with Dave Chappelle. It's an intimate bar, I loved the right side where there's a small table and foldable chairs attached to the wall, looks like you're floating.   Anyways, some of their drinks were creative. Didn't get a chance to try their food but I know there's cheese and bread, the standard pairing with wine.   Will probably come back.", 
    "review_date": "2014-09-26"
  }, 
  "3b5y7pkuXV9z2Q1oqNo32Q": {
    "user_rating": 4.0, 
    "user_location": "Tulsa, OK", 
    "user_name": "Michael B.", 
    "review_text": "I was looking for a nice coffeehouse to do some work and found The Social Study via a ScoutMob article on laptop-friendly coffeehouses (<a href=\"/redir?url=http%3A%2F%2Fscoutmob.com%2Fsan-francisco%2Fscoutfinds%2F4385&amp;s=f27d9b7b047b51d85ec9ddf31cbe30f09ec7967810e8dd0d2b43ebfe2963f75d\" rel=\"nofollow\" target=\"_blank\">scoutmob.com/san-francis…</a>). Very attractive space, friendly owner, great coffee. I was there between 11 am and 1 pm. Several parking spaces were available nearby. This is on the south side of Geary just east of Fillmore.  The big wooden tables will seat six, but at first I had a table to myself to spread out my paperwork. The owner offered and brought me a glass of water without my asking, which was very nice. The wifi is free (the owner will give you the key), and it worked well.  The downsides are minor: Outlets are scarce because of the brick walls. Some conduit along the floor could take care of that. There were outlets at the bar, at the table nearest the bar, and at tables near the window.  As pretty as the inside is, the view outside is of a a wall of the Geary underpass.  I would have spent more money if they served lunch, but the kitchen doesn't open until 4. I'd have liked to try one of their beers, but didn't feel at ease doing that in the middle of the day without something substantial to eat with it, so I contented myself with a very good brownie and a very good cup of coffee.  A cold sandwich, a salad, or a slice of quiche would have been a nice simple lunch option.   I'm glad I visited The Social Study and would visit again when I'm back in the area.", 
    "review_date": "2012-11-17"
  }, 
  "ubQyvWpbQsNdezhVSrIYog": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny L.", 
    "review_text": "Stopped by here for a couple of drinks with some friends. Like this place a lot. The ambience and setup of this place is super cool. The music they played here was great - a bunch of really good old school classics that adds to the vibe of this place. Will definitely be back!", 
    "review_date": "2014-04-13"
  }, 
  "Vloi1tpDf7vNjpjzy1bSiw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tu T.", 
    "review_text": "Nice place but there was only one waiter for the entire place before a Fillmore show. Waiter was very nice, though, and handled the situation as best as he could. Also they only have beer, wine, and soju. Soju cocktails were tasty.", 
    "review_date": "2014-12-04"
  }, 
  "_2DdZ0Hytt9XjuKymsl9Aw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shirley H.", 
    "review_text": "Love this place, good music, relaxing chill spot.  Great local bar.  Very artsy and really laid back.  beer wine and sake only.  more mature crowd.", 
    "review_date": "2014-08-09"
  }, 
  "SpwyrRyFusOCBTgb7dVTKw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "joNathan O.", 
    "review_text": "Love the vibe of this new place.  Stumbled across it this weekend.  Great coffee, great pastries.  Can't want to check it out at night!", 
    "review_date": "2012-09-30"
  }, 
  "eNmJ3qPx-jtjiwa-t1Pg9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susie O.", 
    "review_text": "We stumbled upon this place after watching a movie at the Kabuki Theater on a Sat Night. The bar at the kabuki was closed and we wanted to grab a drink before heading home. It just so happened that someone we were with pointed out the bar as we were walking around looking for a bar. I really don't know how she spotted it as it 's not on Fillmore st and not so visible from the corner. We walked over to \"check it out \" and low &amp; behold we were completely drawn in by the decor and feel of the place. They even had a DJ that was playing R&amp;B hip hop, which added to the chill vibe we liked. It wasn't crowded but I can see this place becoming a new happening spot in the Fillmore/Japan Town. Only thing is that the place closes at 12am, however they let us finish our drinks without rushing us out while they cleaned up the bar (for that they get an extra star!). It's true they only serve beer &amp; wine but they do a creative job with their mixed drinks. Try the nojito &amp; the yellow diamond, you'll be very impressed. BUT stay away from the michelada - it's nothing like the real thing. It tasted like a bad bloody Mary with beer. A real Mexican michelada has lots of lime/lemon  with tomato juice &amp; this didn't compare. Sorry.   Anyhow, if you're looking for a hip wine bar (not your avg wine bar) with a cool hip vibe where you can have great conversation over good music, this is the place. It fits perfectly in the Fillmore &amp; I'll definitely go back before or after a movie!", 
    "review_date": "2012-06-24"
  }, 
  "L36pi2Z583SmRl-BNgxkQw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kristan l.", 
    "review_text": "I love The Social Study!  It's my favorite place in The City to grab a glass of wine with friends.  Whether we're starting our evening or swinging by for a nightcap, there's always a fun, relaxed crowd.  Harmony - the beautiful owner/bartender - creates an awesome atmosphere by playing an unusual selection of movies on the brick wall.  Who doesn't want a nice chardonnay to go with Karate Kid or maybe a merlot with Scarface?  And if you're looking for a little snack, Earl's Nuts are delicious!  ;-)  The Social Study is a unique and special place!  Check it out!", 
    "review_date": "2012-05-24"
  }, 
  "pZZw7NqDFUxIg0YT0vls8g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine A.", 
    "review_text": "I've somehow made my way over to The Social Study a few times in the past few months. Tucked away on Geary, TSS is always pretty busy. Drinks are good, they consistently have great music playing and a cool moving running on one of their walls. It's not a rager type of bar, but the perfect place to grab a drink while waiting for dinner reservations at State Bird Provisions around the corner.", 
    "review_date": "2013-08-10"
  }, 
  "HqkykY5MytOzKdc61N9ldg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Laryssa S.", 
    "review_text": "The perfect hang-out!  Cool factor and cozy at the same time.  Fun drinks, yummy apps for sharing. I love this place because it has a great set up for meeting a bunch of friends and adding more as the night goes on. Plus the live DJs!  The interior is cool with seats that fold out of the wall and common tables for mixing crowds and making more friends.  Can't wait to go back again :)", 
    "review_date": "2012-05-23"
  }, 
  "tgrs5VQ6thhouiEtMU-N_w": {
    "user_rating": 4.0, 
    "user_location": "Vancouver, Canada", 
    "user_name": "Edward L.", 
    "review_text": "Nothing like feeling like a learned and well-read hipster here.  Parking is available on the streets.  The place is a bit on the small size, and it is hard to fit more than groups of 4 here.  The place is rather dim, so you may not want to do too much reading here.  But you can sure feel sophistimacated.  Get out those thick rimmed black plastic glasses.  In case you do read some books here, just a heads up, the bookshelves are offset from the wall.  If you put any books too far back on the top of the shelf, they'll fall between the shelf and the back wall, never to be seen again.  Don't ask me how I know this.  I had a ginger shandy ($6 on special on Saturday).  Great taste, with just the right amount of kick. Recommended.  The DJ had the retro tunes here from the 1990s.  Blast from the past. He's located in a booth on the 2F, overlooking the place.  Very cool setup.  My friends and I left here feeling good.", 
    "review_date": "2013-09-15"
  }, 
  "eNGkNMI42_MqsXRtXSUeNw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erwin V.", 
    "review_text": "I am in LOVE with this place!  Oh man, I almost gave it Five Stars on the atmosphere alone.  It's really hip looking inside, with books and cushions and exposed brick.  It's really cozy and tucked away.  The soundtrack is almost exactly what I'd be listening to on Pandora: 90's music, with the occasional 2000's and 80's music snuck in there.    Then I saw on the menu that they had micheladas and carnitas tacos.  It happened to be a Tuesday, so I thought, why not?  The michelada was great, even though I'm more used to the clamato and tecate variety as opposed to the red stripe and v8 they used.  It was still good.  And the carnitas were great.  The pork was soft and moist and yummy.  Just like back home in San Diego.  Great neighborhood bar that you can actually just chill and study at.  I spent a few hours working here and it was great.  The staff seems awesome; people just stopped in to chat and say hi, and the people behind the bar came out to give hugs to the people they knew well.  Definitely a great sign.", 
    "review_date": "2013-10-08"
  }, 
  "pI15RINDqpXIk5492xx7PA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel R.", 
    "review_text": "Wah, waaaah....over-hyped.  While it seems like a nice option in the neighborhood, the execution fell a bit short. The sangria everyone raves about is not all that and runs you about $9 a glass. I held off on writing this review because I wasn't sure if it was my personal taste; met with my friend tonight and she felt the exact same way about the bar and the sangria!  I guess it's good to give this place a go but not my cup of tea.", 
    "review_date": "2012-02-15"
  }, 
  "Ml_Nd2HGugDf14uh6UTrGQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Travis C.", 
    "review_text": "So glad I found this place. Great coffee. Love the vibe. It's becoming a second office for me. Definitely worth the five stars!", 
    "review_date": "2012-11-27"
  }, 
  "JKIkdVqAJLEXTq92gF98bA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike L.", 
    "review_text": "**Review is for the BAR only**  Do you know any pranksters?  Cuz I do.  Two types, in fact - both a prankster and a PranQster.  The former thinks he's funny.  The latter tastes awesome.  Though, I guess I should be thanking the prankster for introducing me to The PranQster.    A coffee shop by day and a bar by night, The Social Study is similar to Sugar Cafe down by Union Square (minus the hard alcohol).  However, I like the vibe here a lot better.  While Sugar Cafe is a little more spacious and trendy, The Social Study is smaller with a much more intimate and mellow vibe.  Which, essentially, makes them my kind of spot.  Of course, it didn't hurt that the DJ was playing a bunch of 90's hip-hop either.  Since we were only stopping in for drinks after having dinner at State Bird, I can't speak to the bar bites listed on the menu (or the cafe offerings, for that matter).  However, I did like the selection of beers and wines that were available.  Especially the PranQster.  The giant ass bottle it came in was a little unexpected (\"Dude, it's that small bottle, not the big one.\"), but it certainly was delicious!  With its relaxed ambiance welcoming nature, and relatively cheap prices, I'd definitely come back to The Social Study, whether it be for some coffee, enjoying a drink or two with friends, or to cap off a hot date with a girl.  After all, things only get livelier when there's a little PranQster in you!", 
    "review_date": "2014-07-11"
  }, 
  "LikzZL2O64FzmMniu34LMQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K G.", 
    "review_text": "Cute little place with reasonable drink prices and interesting decor. The reason I'm only giving three stars is that my friend's \"sangria\" was absolutely rancid!", 
    "review_date": "2014-08-12"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Back to school.  You could do it like Rodney Dangerfield: <a href=\"/redir?url=http%3A%2F%2Fyoutu.be%2FiRpUAdI_F_o&amp;s=98200a0fcd13f658d8866b05bf3de9f9a22ffb7ceaf5f7969c317c2199bfbfaf\" rel=\"nofollow\" target=\"_blank\">youtu.be/iRpUAdI_F_o</a>  Or you could just attend a Social Study session.  Easily one of the most stylish classroom you'll ever be in thanks to the exposed brick wall and vintage books and albums assorted throughout. Adds personality and class.  Stay awake with Four Barrel coffee and research that paper on Wikipedia courtesy of the free WiFi.  Evenings brings bites like a veggie sandwich with house cranberry sauce and cream cheese. Availability of adult drinks are a pleasant reminder this is not high school.  On some nights you'll even find DJs and movies projected on the wall.  While the coffee wasn't too memorable and the sandwich was overpriced ($9) I'm still very much a fan. Just love the design. And the staff has a great energy and passion for what they are trying to build.  Homework is to come back for drinks. It's an assignment I look forward to completing.", 
    "review_date": "2012-09-12"
  }, 
  "urqtKpxG3VM6C2vxhb1ilA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James Z.", 
    "review_text": "What a great spot! Now, I will disclose I've only been for drinks in the evening. I've not been here for their coffee or in the afternoon. I recently went in with some friends from out of town. We tried to look for a spot open late on a weeknight. My friend wanted coffee, and my other friend and me were just communing for the booze. Thankfully, all three of us got what we wanted (err, almost... my friend who wanted coffee succumbed to peer pressure and got a libation as well).   Anyway, The Social Study is a fun place -- namely because the bartenders were friendly, the cocktails were amazing, the music was a mixture of R&amp;B (!!)/pop/old school, and they were playing the \"Golden Girls\" on the projector facing a brick wall. This is definitely a locals' spot; most folks looked like regulars or neighborhood residents. There was a mix in terms of age range... some were in their early 20s, some in their mid-40s. There are three doubles in the back near the bar - the tables have foldable cushiony chairs (hard to explain... you'll have to see it for yourself). There are long communal tables that seat plenty of folks. The night we went in, there was a semi-private birthday party happening so it was extra boisterous... May I remind you this was like... a Tuesday.   I'd definitely return. Some places make a great first impression, and The Social Study did just that.", 
    "review_date": "2014-02-25"
  }, 
  "ufCC0-UPxMM-57XYX5wvbw": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Suzanna T.", 
    "review_text": "Really great wines, meats and cheeses. Snacks and beer. Clearly, they care about what they are putting out. You walk in and immediately feel comfortable. Plus this place looks great and has the right ambiance. I love a place like this in the this neighborhood. I would usually hang out a little further down Fillmore but now this place is perfect. So close to where I need to be.", 
    "review_date": "2012-01-13"
  }, 
  "chLVa1fMvH0ip5AKT1T-rg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason R.", 
    "review_text": "First time in and I am already scheduling a return visit. When I'm working at a coffee shop, it must have the right atmosphere and this crew gets high marks across the board. Communal and two-seat tables, old school music that enhances and doesn't distract, and great coffee earn the first three stars. Service with a smile gets the fourth. And the fifth star goes to the sumptuous blue leather upholstered wall.", 
    "review_date": "2012-04-20"
  }, 
  "p0ZVT8wjQdVJ0ao_KB-pLQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steve F.", 
    "review_text": "A good beer and wine selection (not lots and lots of choices, but what they have is excellent), with a creative and tempting cocktail menu. Free wifi, cozy leather wall treatments with book and warm brick decor, and group \"study\" tables make it a great spot to visit!", 
    "review_date": "2013-04-07"
  }, 
  "4eR6hYFJcBHoAqhuOS07ww": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diana Y.", 
    "review_text": "Really laidback setting for a winebar. Good spot to come meet friends in the afternoon/evening and whatnot. However, being a non-drinker, I came here (with a Bloomspot deal) and the goal to eat a lot of their bar food. The bar food is decent but MAN, the wait is so freakin' long. Granted, you come to these places with the idea to relax and hangout for a bit. But since I came to eat, I was pretty impatient when it took almost 40 min to bring out the four little dishes we ordered (I think there's only one person working) and then it took another 25 min before we decided to just take home the last dish because I didn't want to wait anymore.  That being said, here's what I'd order if I came here: -The tacos (spicy but good!) -The bread pudding was a surprise winner! Really good  These were really small to share even just between 2 people so if you come with more ppl and want to order food, order multiple dishes.", 
    "review_date": "2013-04-16"
  }, 
  "IprYNdYn2at2EM1s_a4DVg": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "myrrh l.", 
    "review_text": "Adorable, cozy atmosphere, FANTASTIC service.  Bonus feature: enough acoustic treatment on the ceiling and walls that the absolutely kickin' sound system is never deafening or obnoxious.  It's a beer-and-wine bar, but that doesn't stop them from offering \"beertails\" and \"winetails\" - we had the \"spicy coke,\" which pairs port wine and Four Barrel espresso, and the [excellent] sangria.  I'm not sure I'd make it a destination, but if I'm ever back in this neighborhood, this is definitely the spot to chill at.", 
    "review_date": "2014-04-08"
  }, 
  "-NExt5sbMKdwvMrqiJa9zA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Daniel S.", 
    "review_text": "Excellent vibe. Great owner. Great server.", 
    "review_date": "2013-08-22"
  }, 
  "l20MTXXZq6ydgig4cPBK3A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jocelyn B.", 
    "review_text": "Tea and marinated olives with miss Ally D. is never anticipated more than when it takes place at The Social Study.  This friendly bar sits on Geary, conveniently located on my way home. Many large tables for playing games, as well as a few little nooks for intimate conversations...Erykah Badu, Common, and Tupac grace my eardrums as I enjoy a game of UNO... a beautifully simple menu... all make TSS my spot for post-work-hangn'.", 
    "review_date": "2012-12-13"
  }, 
  "lvYhnt7OhM5CgjOr4rU2Ww": {
    "user_rating": 4.0, 
    "user_location": "Clovis, CA", 
    "user_name": "Eric B.", 
    "review_text": "Cool coffee/wine bar. Perfect for that pre-dinner warmup with some friends. Loved the vibe in here and the little booths. Would definitely recommend it to anyone.", 
    "review_date": "2014-02-18"
  }, 
  "af6ayEH9BzsOPQRoxKNE0Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Courtney A.", 
    "review_text": "I absolutely loved this place. I'm always in the market for places to go that have great ambiance to have a good conversation with a friend, feel classy and aren't too expensive. And I finally found one! This place is like a library lounge, with books, leather, wood, some soft lighting, and great music. They have my favorite wine, Sexual Chocolate, by the glass, and really good food. My friend and I split the cheese plate, the salad and the veggie sandwich. All were excellent and moderately priced. This is a great place to just catch up with a friend in a classy and fun environment - I will definitely be back again and again.", 
    "review_date": "2012-05-30"
  }, 
  "q16FcvZyP5SURJEX8iGcTg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angelica C.", 
    "review_text": "great selection of drinks and bar foods.  extremely crowded on the night i was here, and there was only one bartender that also acted as a waiter who brought out the food.  totally understaffed that night.  great music too.", 
    "review_date": "2014-12-04"
  }, 
  "ekUx1Y39k7lpWkR37LBiNQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "V V.", 
    "review_text": "Very small and cute place. Atmosphere was a bit like a library, I felt like everyone could hear your conversation because of the size of the place. The place had a decent amount of folks mostly sitting around reading and on their laptops on a Sunday afternoon. Happy hour sliders from 4-7p. No decaf anything here. Nice baristas. Good music.", 
    "review_date": "2013-08-04"
  }, 
  "OmigScCoWkDucVPPSuh0QA": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Rachel C.", 
    "review_text": "Great little pre-game spot.  Wine: Nice selection but pricey.  Food: Limited menu but items looked good. I couldn't afford the prices after choosing a $$ wine but with a group - would be great.  Dinner after: State Bird Provisions! It's right around the corner :) Rated #1 new restaurant this year!", 
    "review_date": "2012-09-28"
  }, 
  "Afq57_KYVBBJlSj1X5-4xQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel S.", 
    "review_text": "A merging of Brooklyn-esque vibe (exposed brick walls, cool asymmetry in a loft space), California little foodie touches (a+ for the olives, perfectly brined) and a nice wine list n' wine n' beer cocktails to keep one entertained. Great to have a new comer in the neighborhood.. Service is fantastic, familiar and just the right amount of sassy. I could see coming alone for the wifi over a glass or with friends for a meet up pre-show at the fillmore. Great vibe.", 
    "review_date": "2012-02-03"
  }, 
  "2cBAmNisi31-TQ4W3G0WEA": {
    "user_rating": 5.0, 
    "user_location": "Studio City, CA", 
    "user_name": "Bonobo M.", 
    "review_text": "Very cool spot. Distinct vibe with a nice beer and wine selection. Worth a stop if you're in the neighborhood.", 
    "review_date": "2014-09-13"
  }, 
  "4jQv7HkpFu61VyeW6j4ncA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Allen S.", 
    "review_text": "Awesome cafe bar hybrid where you can sit down with a friend, get wifi,  study with coffee or relax with a nice mixed drink or beer.   Stays open late consistently, awesome place", 
    "review_date": "2014-07-30"
  }, 
  "8WMvERcw5hZvq7KsUpYXPw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "dina d.", 
    "review_text": ":)", 
    "review_date": "2012-09-06"
  }, 
  "JG2-Z87cVoVQRiCaTtc7jw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison S.", 
    "review_text": "Really, really, really wish they had a full bar, because I dig the vibe here so much. I'd describe it as upscale dive... interesting interior, funny little wine/beer \"cocktails,\" tall bar tables, and games to help you pass the time away.  Haven't tried their coffee or food, but would definitely be open to it.   Only downside: the little tables that are attached to the wall. I'm short, but even tall patrons couldn't get their feet to reach the floor. Without a bar to rest them on, I felt like a child--and felt extremely uncomfortable.", 
    "review_date": "2012-11-16"
  }, 
  "ypSFIqHZNeCt_4-kKfdA4g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren C.", 
    "review_text": "I hope they update Yelp! with their menu.  I wasn't sure until I went, but they do serve more than just some random appetizers.  They've got a bit of a food-food menu, something beyond a snack plate.  Cute atmosphere, decent coffee.  I haven't been here for drinks in the evening, yet, but it looks like a fun place to try.", 
    "review_date": "2013-12-21"
  }, 
  "2xb2kHnC-mFhtGggWBhZFQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krista L.", 
    "review_text": "This place is intimate without bumping elbows with your neighbors, offers hearty snacks (til 9:30) and drinks, and close to a lot of other things-- making it a great before/after stop (or, if I lived in the neighborhood, an evening on its own).   While I'm bummed they don't have a full bar, they do get remarkably creative with what they have: beyond the beer and wine lists, they offer beertails, winetails, and \"karatetails\" (soju mixed drinks). I tried the Yellow Diamond (lillet blanc, prosecco, and mandarin peel) which was refreshing without being overly sweet. A little pricey at $9, considering it isn't as strong as either a glass of wine or a regular cocktail, but fine for a one-time try.  I also wish the kitchen stayed open even an hour later. I stopped by after a Kabuki movie where I'd skipped dinner, and missed the kitchen closing at 9:30. Some of the menu items didn't even need any preparing, so even if they had a reduced late-night menu that'd be a great next step.", 
    "review_date": "2015-01-07"
  }, 
  "RO5PhrYxyg-xe-LoGNeR8A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura E.", 
    "review_text": "Great Ambiance!  Friendly staff!  We'll be back for live music and snacks.  This is a great spot for before/after a movie at Sundance or before a show at the Fillmore.", 
    "review_date": "2012-01-25"
  }, 
  "1dQiuUvvK8427TBmqj_4Vg": {
    "user_rating": 5.0, 
    "user_location": "Concord, CA", 
    "user_name": "Amy P.", 
    "review_text": "This awesome bar ended up being our final stop as a group of my girl-friends bar-hopped in celebration of a bachelorette party. A perfect end to our night on the town. We were on foot and looking for The Social Study, based on a recommendation from a bouncer at Milo up the street. When we were having trouble locating it, one of the girls totally asked a stranger, who ended up walking us the rest of the short distance there. We found seating up front by the window toward the street and all 7 of us fit nicely in the cubby.   Drink service at the bar was great and the atmosphere around us was really peaceful. It was the perfect end to a perfect day. Our walk back to Hotel Kabuki after the bar was short and pleasant.  The following morning, a couple of girls walked back over here for juice and said it was just as nice and tranquil in the morning as it had been the night before. The bottle of Bailey's in my purse didn't go well with juice, so I stayed in the room making coffee.  :)", 
    "review_date": "2013-07-18"
  }, 
  "CKSHtPZ2QJwHt6nipRmukg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kato D.", 
    "review_text": "Hip-Hop, loungy, gourmet coffee, and beer on tap. What more can I say, but you have to check this place out. The bathroom was decorated by prince and the interior bar looks so comfy I want to stay here all day. I ordered the BLT, proper. Great staff as well. Support this place!", 
    "review_date": "2014-03-08"
  }, 
  "UpTRm7NhTLk_lOnT8g516Q": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Vincent H.", 
    "review_text": "Good place to to get a drink or coffee with a friend or date.   Very rustic/vintage and easy place to study at with free wifi and plenty of tables. Only complaint was the lack of outlets.", 
    "review_date": "2013-01-27"
  }, 
  "Xbyf2Dj8B32eO4f2u8yOyg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Annie F.", 
    "review_text": "The newest addition to my hood, and a much-needed one.  The ambience here is great...very low key, great music, good selection of wine, beer &amp; wine cocktails. The Sanfrangria is really tasty!  The hidden wall cushions, while a cute idea, are a bit painful for anything longer than about 1/2 hour. Perhaps if there were a little footstool for those of us on the shorter side, or a back that came up, it would be better. I don't think I would sit on the wall again without some changes.  And, while it is written on the menus, it is important to note that you must order at the bar. We did have a bartender come around and get us a refill, but that was a nice to have and I don't think the usual. (this is not a knock on the place at all, it just took us a minute to notice this on the menu so I thought I would give others a heads up)  Can't wait to go back.", 
    "review_date": "2012-02-03"
  }, 
  "DRVLcDZzvmmAMjbYNMYzmg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick A.", 
    "review_text": "My mind was blown a few seconds after I stepped into this place.  I initially thought it was a bar, because the exterior implied it and I saw a physical bar area at the far end of the room.  Then, I found lounge spaces and bookshelves. Then, I found people eating sandwiches and sipping wine on stools. Then, I found people reading on desk spaces with candles. Freaking candles. Then, I found people working on their laptops ON THE BAR. Then, I found a DJ booth throned atop the narrow space.  What is going on here? What hybrid abomination is this?  The feel and design of this joint is spot on. Shabby rustic wooden furniture are combined with a crisp modern interior. Wow.   They have happy hours, pastries during the day, snack menu at night, good coffee (Four Barrel), Taco Tuesday, and more.  I'd totally hang out here 24/7 if it weren't so far away from my place.   ---  Distinguishing factor: A bar, cafe, lounge, and club combined to make a true staple of a 21st century hang out space.", 
    "review_date": "2013-08-13"
  }, 
  "JGUKdywFgrPuREbK50O9pw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie F.", 
    "review_text": "This cute little small is a great bar tucked away just off Fillmore Street.  They don't serve hard alcohol (whch is why this only gets 4 stars) but they have creative soju cocktails which are certainly worth trying. Friendly staff, eclectic atmosphere.", 
    "review_date": "2013-03-07"
  }, 
  "UkLi6UV-y7VzaA5mpgYUdQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Isidro M.", 
    "review_text": "I've walked past The Social Study numerous time over the course of a year and finally made it inside! My expectations were a lounge with a full bar, however, I was surprised that they didn't have liquor-- this did not bother me. The Social Study makes up for this with delicious beer and wine cocktails. On the Friday night that I visited there was a great DJ spinning 90's - current music in the balcony and the place was packed, however, I was able to find seating for me and 4 friends. I will definitely come back but with less people, i'd like to be able to drink and hold a conversation which proved to be a struggle when speaking over the great tunes the DJ was playing.", 
    "review_date": "2015-01-18"
  }, 
  "-89IDABrt2vnhvoCiUlVCw": {
    "user_rating": 5.0, 
    "user_location": "Dana Point, CA", 
    "user_name": "T M.", 
    "review_text": "I woke up from my late afternoon nap wanting coffee beer, and remembered seeing coffee and beer on a sign downstairs, so I ventured out to see what they had to offer.   We walked in, and there was ample seating, so we sat along the wall. We ordered our drinks, a honey latte (delicious) and I got the chocolate expresso beer (I can't remember the name of the drink, but it was divine. It went splendidly with my honey latte.) It was exactly what I woke up craving! A nice Guinness stout with expresso syrup, and shaved chocolate on top.. mmmm.  The BF got their Fillmore Shandy and a cappuccino, the shandy was delicious as well. I also ordered their veggie sandwich, which was very tasty and light.  Overall, definitely going to be visiting more often. Their food was great, the bartender was friendly, and the decor was very welcoming. The food selection is pretty minimal but filling. I want to see what their wax poetic after dark events entail, it seems like a lot of fun.", 
    "review_date": "2013-04-22"
  }, 
  "UCc0pia4omzIsTA_lF6n2g": {
    "user_rating": 4.0, 
    "user_location": "Brunswick, GA", 
    "user_name": "Liana R.", 
    "review_text": "We live in Pacifica, but often spend A LONG day in the City.  Last weekend, I was looking for a place to have some down time between shopping and restaurants and sailing - to just sit and relax maybe read, and consult the internet for mail n stuff. Starbucks for this purpose has just become old.  I googled and yelped around and found this place:  coffee, wine, snacks, and wi fi.    Like most of the reviewers, I love it and wish it were closer to home.  I love to happen upon cool places like this.  The bartender / barista was very welcoming and kept a cool stream of music going - I kept asking, \"Hey, what is that?\"  I \"discovered\" some great new music.  LOVE.  I liked the fact that I could decide if it is coffee time or wine time ;)  (Pah Starbucks!)  The swirly cinnamon bread was warm and tasty; scones, bellissimo.  There was an eclectic smattering of people studying, reading, wandering in, meeting - purple-haired girls, old black dudes who talked scat like they just put down their smoking guitars, buttoned-down suits sitting at these crazy desks-for-one attached to the wall on their computers.  Regulars and first-timers.  Anyhoo, it's in a weird place we don't usually pass through - but we'll change our route ;)  It's a great place to meet friends before or after a night (or day) on the town.", 
    "review_date": "2013-08-15"
  }, 
  "nFzXZBpz6GcEaRODqNSmgw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nikita M.", 
    "review_text": "First off, love the name... Despite the absence of spirits, the drink menu is highly palatable. The mix of clever drink names and invigorating ingredients using only wine and/ or beer as a base is a refreshing change from the typical runaround. As for ambiance, this place feels very comfortable, almost as if I'm just hanging at a freinds loft... Good music, great design and laid back grounded staff (Michael is amazing! And harmony, who owns it is a necessary flower in the decor). Once again, a refreshing change from most wine bars, which feel like wine cliques... If you don't drink, still 5 stars or the food... Quick savory bites, with an impressive variety considering the size of the kitchen!  I'm definitely going back:)", 
    "review_date": "2012-01-20"
  }, 
  "8ozxJndeMSqObxZc4xDsbg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anoo L.", 
    "review_text": "The seats are too small, and it's beer and wine only.  A great spot to hang prior to a movie or a State Bird reservation.", 
    "review_date": "2014-12-18"
  }, 
  "zTuPu1ogE8392SHhvGWn-g": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Ess M.", 
    "review_text": "Great music, delicious snacks and pastries, four barrel coffee and espresso, very nice wines, and the people that work there are pretty amazing too!  Love everything about this place, you should check them out!", 
    "review_date": "2013-10-11"
  }, 
  "oXzmbPmWimj0mvWm4YIgNA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hallie W.", 
    "review_text": "So cute, wish I had come here sooner!!", 
    "review_date": "2013-06-14"
  }, 
  "c5Hvt9nnJE716vqKJCK7hg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenna E.", 
    "review_text": "The taps were not working very well the night I stopped in but the bartender was on point with her suggestions for bottled beer! That being said, I'm certain the taps were quickly fixed and all is well on that front.    The atmosphere is certainly unique! It is a small place with an upstairs DJ booth that's used sometimes in the evenings.  Apparently this place has coffee during the day but it is definitely a bar at night.  They have games too if you bring people who want to do something other than just sit and talk.  The seating is pretty awesome too, with these little seats and tables that are attached to the wall.   Beer was cheap compared to some of the other places I've seen around. I'll definitely be back to try this place out again.  Oh, and free wifi, just as for the password.", 
    "review_date": "2014-07-16"
  }, 
  "cAsqLtUTckyweDcdA95GIQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine G.", 
    "review_text": "I really like the ambiance here... very cool and comfortable. Some of the standouts of the place:  -warm, sincere greeting by the lovely lady behind the bar -exposed brick wall -interesting blue padded wall with \"murphy\" seats -every song that played, my ears perked up... Adore by Prince, Escapade by Janet Jackson, Let's stay Together by Al Green, to name a few... played at the perfect volume for an afternoon of coffee and conversation  I was here from about 1-3 in the afternoon, and the only food they had were pastries and fruit. My chocolate croissant was good, but I was craving something savory at the time. They offer a wider selection at around 4 or 5. I'll be back then. :)", 
    "review_date": "2012-03-05"
  }, 
  "FSDj4JOrZxd5Z-ax15Klgg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Reyz A.", 
    "review_text": "Leaning into the padded walls in this place helped me nurse my Seis de Mayo headache.  I started to smellucinate what they could possibly be serving  in this effortless cool urban bohemian looking hipster of a place in Lower Pac Heights-- Since I'm neither from Bohemia nor am I a hipster, I did want some more stiff drinks to ease out of my headache.  The Social Study, is a library-like part café, part lounge, part bar or part 747 cockpit sans the seat belts hangout. I didn't know whether I should have card cataloged my order first with the bartendress or  put my tray table up with my seats in an upright and locked position then find the stewardess button.  Since I was sobering up, I couldn't help but stare at the communal table and the long wooden bar, or the pale-blue, studded-leather wall fold-down seats, all  while trying studiously to absorb what's written in this library like bar menu. I liked what I saw because it was diverse in category but focused on the good selections. I thought a pitcher of house made sangria might be good; but no, I wanted to drink my dessert and try the cocktail (Chocolate Factory) that had some Guinness, some shots of espresso and a smidgen of chocolate syrup; but wait, I also wanted to try some red wine like  'sexual  chocolate syrah/zin 2010' or  'cucao carmenere'; but, no, I was tempted by some whites like 'augustus viognier' or 'count karoly gruner'; but, hold on, they also had a list of winetails like 'sanfrangria', 'nojito', fillmo'sa' (proscecco and tangerine); oh, but there's a nice selection of bottled beers, from Jamaican  Red Stripe, to some local  Arrogant Bastard Ale, to Belgium's Chimay Peres Trappistes; ---at last, I decided.  I opted for some Fillmore Shandy of Schrmshaw Pilsner, house ginger and citrus. I thought that might go well with Earl's Nuts (that's roasted nuts some sage, cayenne, chili and brown sugar, not my hoe friend's favorite play thing).", 
    "review_date": "2012-05-12"
  }, 
  "FleR20oggFcnR_aTeBd2AA": {
    "user_rating": 4.0, 
    "user_location": "Novato, CA", 
    "user_name": "Natasha L.", 
    "review_text": "Very nice atmosphere, friendly bartender. The drinks were pretty good and they had a deal for two pulled pork sliders and an IPA for $7. I had the pork tacos which were AMAZING and a Chocolate Factory (Guinness, espresso syrup, and chocolate shavings). Bartender was even nice enough to give me another small glass of Guinness on the house. We went on a Sunday evening so it was kind of dead but the bartender kept the conversation going the whole time. Definitely coming back the next time I'm in SF :)", 
    "review_date": "2013-06-10"
  }, 
  "efIJCmF7G2BoSEosqQiP8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mahta P.", 
    "review_text": "Wine, books, a DJ that plays hip hop and R&amp;B circa 1991. What else could a girl want or need. I love this place.", 
    "review_date": "2012-03-13"
  }, 
  "lsqKEkOPmgzZpoP9AdH1LQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarin P.", 
    "review_text": "5-stars to this awesome wine bar located near the cozy intersection of the Fillmore. Seating is limited, so try to secure a spot before ordering drinks. The bar area is small, but the bartender was very attentive to the guests. Behind him/her they offer a number of red, whites, and brews on tap. This lounge has an intimate setting, and would be a great place for smaller parties.", 
    "review_date": "2015-01-21"
  }, 
  "wyob7airQM-DG7V8aPBZ1w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsey B.", 
    "review_text": "I can't believe I just found out about this place! It's in the Fillmore which I don't go to very often, so that's probably why I've never noticed it. I was meeting a few friends at Fat Angel for a drink, but there were no seats and the bar area is tiny. Instead of shoving our way in, we decided to go down the street to Social Study.  They have a pretty nice list of wines by the glass and they also do wine cocktails. That's what I went for and I was pleasantly surprised! I ordered a Nojito which was white wine, soda, lime and mint. So basically a mojito but with wine instead of rum. It was really delicious! For the second round I got a Agavarita which was like a mango margarita but with agave wine instead of tequila. Again, really good. My friend had a few glasses of red and enjoyed them. They also have a beer list but we didn't get to that.  The space itself is cute. They have some nice longer tables so you can fit a group of 4 or even 5. They have a collection of board games and although we didn't play we saw several other groups that were doing so. And finally, I was totally into the playlist.   If I'm ever in this neighborhood looking for a drink I'll definitely come back!", 
    "review_date": "2014-08-03"
  }, 
  "kCdbwir_9V9RECkc1k0sjg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bob M.", 
    "review_text": "I've been twice - for coffee only.  This review is limited to the coffee. The coffee is not hot.  I, and most, like hot coffee.  The coffee was good otherwise. However, like a lot of new coffee bars, the place is trying  to be condiment hip.  Stevia is NOT a good sugar substitute - not sweet and leaves a metallic aftertaste.  Why not blue or pink packets?  Where is whole milk, or even 1/2 &amp; 1/2?  Soy milk and lo-fat milk only.  Let me decide for myself what I like in my coffee. And the coffee is expensive:  $2.50 for a small.  It is not THAT good.  The entire package for a coffee drinker is not appealing.   The atmosphere/environment is nice.  Especially if one is not drinking coffee  ha ha.  Better for the wine/beer crowd later. Windows were dirty (noticeable since the entire front is window - which is nice) and many cob webs above.   I'll go back one more time in a few weeks.  I think this place might make it with the wine/beer.  But it is not a coffee destination, and to attract morning coffee drinkers, it needs to be a destination since it is out of the way. I hope they make it.", 
    "review_date": "2012-05-01"
  }, 
  "RtJnTneQVNgOCPlx-j4pQQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily K.", 
    "review_text": "LOVE this place. It's in my hood, never too crowded, excellent drinks, coffee, hours and bartenders. Did you watch Fashion Star? Well one of the 3 finalists sometimes tends bar here and shows you his incredible sketches. Michael is the other bartender I always have, and he's SO nice.   And the Nojito is a cute version of everyone's favorite, the Yellow Diamond and Shandy are tasty. Good cheese and charcuterie plates too. Come in the AM for Four Barrel coffee and to do some work, in the PM for a drink or two. Walk home.   Geary and Fillmore, next door to Nan Noodle Bowl on Geary.", 
    "review_date": "2012-05-25"
  }, 
  "mQ3GHTvVxAfA6XcMCgQ0EA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Moses L.", 
    "review_text": "Great place to hang out with friends and actually carry a conversation while enjoying some quality drinks or coffee (Four Barrel!). Come here if you want to avoid belligerent drunks and hot, sweaty air.  They had a DJ there spinning up some smooth background music to add just that light touch of classiness to an awesome visual ambiance.", 
    "review_date": "2012-01-28"
  }, 
  "cjwC9z0ZIj67WkGrxVP4_Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Arkady I.", 
    "review_text": "A very cozy, intimate bar with a very local, low key vibe, and a friendly non-pretentious staff and clientele. I think it's one of the better places for a (first date). I hope this place makes enough profit to remain open and establish itself as one of the cool, off the beaten path spots in San Francisco.", 
    "review_date": "2012-08-29"
  }, 
  "IFQcFtvtScMI4I1KyRW-sg": {
    "user_rating": 4.0, 
    "user_location": "Carmel, CA", 
    "user_name": "Bob G.", 
    "review_text": "First time visit yesterday early eve, nice atmosphere, music not too loud and enjoyable, good soy latte, pleasant staff, some vegan options for snacks, close to Sundance Kabuki Cinema, SF Film Society Cinema, and 38 Geary Bus.", 
    "review_date": "2012-01-27"
  }, 
  "CGf_r52NJmnFylb-NfeEZw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leanna R.", 
    "review_text": "Please hire someone to handle tables on Saturday night - it is to crowded to make your bartender bus tables.  You could be making so more money.  Why are you wasting time?!", 
    "review_date": "2013-11-09"
  }, 
  "IBrL-6twlZmQBGLdV2DQiw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melanie C.", 
    "review_text": "Adorable funky cool design and great music.  Super nice owner and staff.", 
    "review_date": "2012-04-29"
  }, 
  "qstOF_b3pvyVPyq4Qsyw-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "edward k.", 
    "review_text": "Came here on a whim with a friend one Friday. The place is pretty neat. The decorations are nice and the fold out seats. The service.. is kinda crazy. The place is small so you don't need a lot of people working but the bartender is playing everything but coat check. He takes all the orders for both drink and food serving both people at the bar and not at the bar. Perhaps I was here on an off night, but it seems like there needs to be a waiter/waitress helping with the orders. Other than that, I really enjoyed the bar and the atmosphere. I will be back and recommend to other people.", 
    "review_date": "2013-02-28"
  }, 
  "8k3aO-mPeyhbR5HUucA5aA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Victor G.", 
    "review_text": "social study looks like a subset in the corner of a library. only  sign at door suggests they sold four barrel coffee here. inside no signs seen suggesting they sold sangria, etc.  pour: four barrel coffee(3) -very smooth, no harshness at all  -drip version also available eats: :day old croissant(1) -tasty  coffee drips:  -on the metere so didn't explore this place -very friendly service -definitely would come here over starbux.", 
    "review_date": "2012-02-07"
  }, 
  "cbehkbJXi_sauQbjco9iaw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek S.", 
    "review_text": "This is such a cool little spot! Love the beertails and fun games the have. The atmosphere here is totally my jam in my old age...ie can't stand not hearing the person talking to me a foot away or being constantly groped. Totally a laid back spot to come with some friends and hang.", 
    "review_date": "2014-12-30"
  }, 
  "kFdKkVOUV8zPfLCvBObBeQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael S.", 
    "review_text": "Very cool place to hang out at if you're just looking to hang out with friends in a halfway quiet setting. It's also a great place for a first date as they have two-person tables along the wall that keep it intimate.  It's a beer and wine only bar. Drink prices are what you would expect from a San Francisco bar but the atmosphere makes up for it. They always have a movie playing on the wall via projector and the DJ plays legit music.  You don't see many fights in this place because it's away from Doucheville (Marina) and the clientele that come in are mostly there to have a good time.", 
    "review_date": "2013-01-12"
  }, 
  "F262q88zc7zsdEeNCzcA0A": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Siobhan F.", 
    "review_text": "Was really impressed by this charming little spot right next to the Fillmore.   I can imagine it's a great place to get work done in the afternoon or meet up with friends for a coffee or beer.   I loved how cozy it felt and the staff was polite enough. There was ample seating all around, small tables for 1-2 and a handful of larger tables for bigger groups.   Will definitely swing on by before a show at the Fillmore, or on our way out for a night cap!", 
    "review_date": "2014-03-14"
  }, 
  "gji92ao5NAIrb3akKyqTZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth T.", 
    "review_text": "This place is great!!! Order beer, wine and snacks at the counter. Pretty good selection of drinks. No pressure to leave. Games, the paper and more to entertain.. Relaxed environment.", 
    "review_date": "2013-03-22"
  }, 
  "qiHItri5qNyG7Zz1ycEQpw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Dia Z.", 
    "review_text": "What a fantastic little nook to go for a good glass of wine or delciious cup of coffee. I happened upon this place post-dinner and waiting for a concert at the Fillmore. You would never know it was there. It's low lighting is very inviting, and the padded walls with stackes of books make you feel like you're in a deep, dark library. It's cozy and trendy, the exposed brick wall behind the bar looks rich with age. I loved the live DJ playing great jams that I could move my shoulders to, yet also have a great conversation with friends. Loved it.", 
    "review_date": "2014-10-12"
  }, 
  "kVZSKFfmwT7eCMFxpVBmpA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Claire F.", 
    "review_text": "Tried this place on a whim and it turned out to be a gem! Great spot for casual drinks with a friend or significant other, or even for a bit of solo reading/coffee time. Very relaxed vibe, the bartender was super friendly, the drinks were tasty, and even the dessert was good. Definitely going to go back here.", 
    "review_date": "2014-07-09"
  }, 
  "rtTpEZSTIDSurdw12xZK1Q": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Stephanie C.", 
    "review_text": "LOVED this little gem in Japantown!  Very cute bar", 
    "review_date": "2014-09-16"
  }, 
  "p5k2sgXGdaXTXQM2LMmDNA": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Christina L.", 
    "review_text": "Craft cocktails are delicious. This is a couple blocks away from where I work and is a nice cozy place to hang out with friends. It was a weekday and there wasn't much happening. I'd come back here to get the night started.", 
    "review_date": "2014-12-04"
  }, 
  "7rUmkTjpJRq80IsOwiU95Q": {
    "user_rating": 5.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "michael s.", 
    "review_text": "Went to the Social Study last night based on a friends recommendation and we absolutely loved the ambiance, the wine and cheese plater. Great place to unwind and relax. My girlfriend and I love the place and will differently be back.", 
    "review_date": "2012-03-08"
  }, 
  "44QJFy-EUL18Z5xcwPP6pQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilly M.", 
    "review_text": "Cool new spot....nice place to chill and have a glass of wine or beer. They had a dj who was mixing some cool chill music.  Do yourself a favor and check it out.", 
    "review_date": "2012-01-29"
  }, 
  "jgpK46-FBs7-f0Mrd18a0w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krish R.", 
    "review_text": "Ambience is one of the best I have seen in the City. But I still cannot understand the loud and jarring music playing from the speakers during day time.  I can understand the desire to be musically expressive and loud during evenings.  But why during the day time?     What is wrong with all these indie coffee shops?  They are like \"Let me find the most annoying, arbit and haphazard musical arrangement to portray my uniqueness, and then pipe it up to a million decibel level.  This way my customers have absolutely no way to enjoy the sip of what I am really known for or carrying some work during the peace of the day\".    Maybe I am the only one feeling like this but I surely won't come solely to enjoy coffee, do any work or study.  I am going to go back to Royal ground coffee shop, a few blocks up Fillmore.  Doesn't have the same ambience and the coffee might be just a notch lower, but the overall atmosphere is very serene and simplistic.  Finally, the bartender seems to be friendly or willing to look or sound friendly only to locals, not noobs like me.  If they pipe down the day music, I will update this review.", 
    "review_date": "2012-07-18"
  }, 
  "uU7GIgzs4-5Dtp9Vuymb3A": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nhung T.", 
    "review_text": "A very cozy and small bar, great place just for a conversation and a few drinks. It gets crowded around 9 till 11 and then it dies out, on a Friday . Nice vibe. Although , I will have to rate their drink as ok, 2.5 stars. I had the white sangria and it was horrible , very bitter.  Other than that a glass of red wine was nice.", 
    "review_date": "2014-08-03"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "It's a cool, laid back bar/wine bar. Not pretentious and you can have a conversation. Seating is a little awkward the way it's laid out. But, all in all a good addition to the neighborhood.", 
    "review_date": "2015-01-14"
  }, 
  "rS4OEY7fWDZG_JuJjR9HWg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Michelle L.", 
    "review_text": "If I could give the Social Study 10 stars, I would. This place is doing everything right... they serve Four Barrel coffee and baked goodies during the day so it's a great place to work. At night they turn into a cozy neighborhood bar with a small food menu and a great atmosphere. The servers are always friendly and on the ball, and the music they play is great. I've never been there when they've had DJ's or movies projected on the wall, but I'm sure it's awesome.   My only gripe is that their kitchen doesn't open until 4pm, so if you're having a long work day your only food options are pastries and baked goodies. I usually have to go somewhere else to get lunch. But I think the owner has recognized a need to add some daytime food options for us telecommuters.", 
    "review_date": "2013-05-31"
  }, 
  "HR1wozuAE_3KAHFP1XvIjw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Lorie N.", 
    "review_text": "We dropped in here before going to the Boom Boom room to see a show and what a cute little spot this is!  I was wondering why this place was called \"The Social Study\" and once I walked in, I instantly understood why.  They had books lined up around the perimeter, and it looked like a leather study with square seats that popped out of the walls.  I'm not the best at describing things but it looked like a fancy library in an old mansion, only updated with tea light candles and a projector that was showing \"Coming to America\" on the brick wall above the bar.    Since I don't drink alcohol, I ordered a Ginger Limeade and it was so good that I sipped that up like a kid dying of thirst on a hot day.", 
    "review_date": "2013-02-21"
  }, 
  "LKcFo8BfF0EyrhP6wb5Uow": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Demanding T.", 
    "review_text": "Awesome cappuccino!", 
    "review_date": "2014-02-13"
  }, 
  "BbBzub67X5sAHHTEtk2GAA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily C.", 
    "review_text": "*REVIEW FOR BAR ONLY*  This place is freakin awesome. Literally in the heart of J-Town. We decided to stop in here since we were super early for Origin and decided to sit and pre-game nearby. This place is literally around the corner.  I LOVE THE INTERIOR OF THIS PLACE. It looks like a study of a rich person's home. Lol. On Saturday night, there was a DJ playing some good 90's jams. The FEELS!  We came in as the drinks were pretty damn inexpensive considering the location and how nice the place looked. I think beers started around $5-6 and cocktails about $8-10? No hard alchy. Keeps the place NOT RATCHET. Kinda nice actually.  Came in around 9 and most of the big tables were taken.. I could see this place getting crowded later on in the night but overall I think it's a nice spot to kick it. Only gripe is that there's only 1 unisex bathroom for the place!  I imagine this place would be SUPER CUTE in the daytime or evening for a date!", 
    "review_date": "2014-07-08"
  }, 
  "d1sLYlfSzHo6WCpfe-j7zg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kim D.", 
    "review_text": "My friend and I were walking around aimlessly and semi argued where this place was since it wasn't easily spotted.  But going to enough bars (yes, I sound like an alcoholic) I know there's a lot that are \"hidden\" but are amazing fines.  I was determined to find it and luckily we got there.   Cute place with books around.  There were mini booths on one side and longer tables on the other...I'd recommend the longer tables.  The booths, however nice, are actually not very comfortable and feels awkward to sit in.  I ordered some wine while my friend tried a wine cocktail.  Both were good and it's a great place to chill, hangout, bring a date, etc.  There was a dj upstairs playing music which may seem odd but he was playing pretty good chill music.  It wasn't like it was a club up in here.  It just felt like a really really nice library/bar in someone's expensive house.  LOL", 
    "review_date": "2012-08-21"
  }, 
  "g_487fF8RYingxFGJisL6g": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Tammie C.", 
    "review_text": "Came on a Sunday night around 8pm (while waiting for our Statebird Provisions reservations at 9:30) and there was a good mix of ppl.  Half empty but not awkwardly quiet.  It's a cute fun place with a good mix of music. Decent little wine list (even though it's more of a beer and cocktail place). Dim lighting, bar seats, table bar seating for 2 and a couple areas for bigger groups.", 
    "review_date": "2014-10-21"
  }, 
  "uKSBEEzAfqZgYP-4sKNWkA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison R.", 
    "review_text": "I really like this place.  It's small, really cute, great wine selection, the food is delish, and there's a decent beer selection as well.  It has everything you can ask for in a little neighborhood bar.  There are seats that fold out of the wall that remind me of being in school.  They play old movies on the wall.  The staff is super friendly and attentive regardless of how busy they are.  And there's a fish that is cute that lives on the bar.", 
    "review_date": "2013-02-25"
  }, 
  "tLWZ5DTPSpzu9xi_I3fJxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew N.", 
    "review_text": "This has to be one of the best bars in the neighborhood.  The atmosphere is inviting and energizing without being too much. It is a great place to work during the day and stay for a drink at night. I'm sold", 
    "review_date": "2012-11-14"
  }, 
  "SD35oARo4MJoYO4_AVRXCg": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Lisa N.", 
    "review_text": "what an awesome bar to hang out at or pregame. love the music and the decor!", 
    "review_date": "2013-07-10"
  }, 
  "FD0Fx0NHq9vxzA_Ajeh8_w": {
    "user_rating": 4.0, 
    "user_location": "Washington, DC", 
    "user_name": "Bill V.", 
    "review_text": "I went here on a Friday night for a friend's birthday party.  We got to sit in the window area, which probably enhanced the evening.  They have a good selection of beers, and the ambiance was perfect for a Friday night.    They need another bathroom.  They only have one single occupancy bathroom, and the line got long.  Curiously, the bathroom is extremely large and could probably be split into two separate rooms.  Behind me in line were 4 young women who ended up pounding on the doors screaming \"Whatever happened to chivalry?\"  Geeze, was I supposed to let FOUR women go ahead of me in the bathroom line?  That is absurd.  They expect me to be chivalrous, yet they were completely unladylike.  And let's be serious, if I had let them go ahead of me, they would have been thinking, \"OMG, this creepy guy just wants to hit on us in the bathroom line!\"  Right?  I didn't just fall off of the turnip truck yesterday.  This wasn't my first trip to the bathroom.  I've been to the bathroom a few times in my life.     I have to remove one star for the limited bathroom situation and the douchebags in the bathroom line.  P.S. If any of those impatient young ladies are reading this, send me a private message and I'll show you how much of a gentleman I can be.", 
    "review_date": "2014-02-08"
  }, 
  "iIq1zHUZPAPeF00cLWCt4Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly L.", 
    "review_text": "Loved it! Great music, drinks and over all vibe for early Friday night! I had a yellow diamond, he had a Guinness espresso creation. Super delish and not overpriced. Whoo!", 
    "review_date": "2014-06-27"
  }, 
  "xFbvPljRiYopjLF6G37Xfw": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Allison L.", 
    "review_text": "I loved this place! Sophisticated and chill atmosphere, good service, comfortable setting. I could see coming here and doing a little bit of work thanks to the free wifi as well.", 
    "review_date": "2013-05-26"
  }, 
  "NAO5h4cgobnE-BigE2Gl5Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexandra M.", 
    "review_text": "Social Study is my favorite place in the Fillmore for a latte Monday through Friday- the coffee is delicious and Harmony the owner and her staff are the best. I found out this weekend that it is also the best spot in the Fillmore for a party- the drinks are fantastic, the food is really really tasty, and the atmosphere is ideal for hanging out with a group of friends. Social Study is stylish, intimate and comfortable all at once and your guests won't want to leave! The best!", 
    "review_date": "2012-07-01"
  }, 
  "1WpYGy2ByT25RlXMhe29XQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jamie B.", 
    "review_text": "I've only been here twice but have never had an issue with the ambiance or finding seating. The Social Study is a really chill place to hang out and listen to good music, and the Sweep The Leg saketail is uh-mazing. Would definitely come back and I hope to try their food next time!", 
    "review_date": "2014-11-05"
  }, 
  "Ct456aEICzDfn03MHZCzsw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "miriam b.", 
    "review_text": "Good vibes for easy drinking and catching up with friends! Close to the FILLMORE West and the every busy Statebird PROVISIONS restaurant line up just around the corner.", 
    "review_date": "2014-03-17"
  }, 
  "Qv84DxksfsNxZID5G08q9Q": {
    "user_rating": 4.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Victoria O.", 
    "review_text": "Nice neighborhood bar with above average coffees, wine/beer cocktails and food. Small space with a cozy atmosphere. If you are lucky enough to score a seat, sit down and enjoy the menu. I love the cocktail called the Spicy Coke which is grilled port, four barrel espresso, lemon, coke all at the reasonable price of $8.00. The honey latte is out of this world. The staff is efficient yet courteous. A great spot if you are in the neighborhood.", 
    "review_date": "2014-07-21"
  }, 
  "AUOb8U2Wa31Z2DThPpvAgg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Audrey C.", 
    "review_text": "Cutest and probably the hippest cafe I've been to in a long time. My friend and I wanted to kill some time and grab a snack before our concert at the Fillmore so we popped in. Lattes taste great and the ambiance of the cafe is amazing.  Seats pop out the side of the walls and the theme of the cafe has a sort of New York artist loft feel to it.  I see this cafe as a cute date night location and will be back!", 
    "review_date": "2013-03-20"
  }, 
  "Ii2yQ3qHWu9mbF1pzCpGoQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kim K.", 
    "review_text": "Affordable drinks and tasty looking snacks.  Cool atmosphere, laid-back bartender.  However the wall booths were quite uncomfortable, and I wish that they mixed up the music a bit.", 
    "review_date": "2012-10-16"
  }, 
  "dTCEopG6rrF9n3kieG_L2A": {
    "user_rating": 3.0, 
    "user_location": "Saint Louis, MO", 
    "user_name": "Megan L.", 
    "review_text": "I hate to give a new establishment a so-so review, but my first visit to the Social Study was a bit less than stellar.   A girl friend and I came in at around 8:45pm on a Saturday night. We were the only two patrons in the establishment as we came in just as a couple others were leaving. No one greeted us, so we decided to seat ourselves. A quick look around and we saw some wall-seats (two-tops with small tables jutting out of the right-hand wall; seats without backs), and some bigger tables for groups on the left side of the room. Since no one else was there we opted to sit at a bigger table. We sat for a few minutes but no one came around despite seeing the bartender at the bar, so we grabbed some menus from another table. After perusing the menu and making our choices over the next several minutes and still nobody came around, I got up and placed our orders at the bar. Strange that despite being the only two in the whole place, and especially for a new establishment, the bartender and other staff made no effort to greet us or offer us any tips/pointers about the menu.  We each had a glass of SANFRANGRIA ($7) and we shared the BRANCH &amp; BOARD CHEESE PLATE ($9). The sangria was solid - I liked that they included fruit in our glasses and that the apples and pears were not so wine-soaked that they were inedible. It was nice to munch on a few cubes of fruit along with our cheese plate.  The cheese plate was fine - it included a blue cheese w/ honey, a gruyere, and a cheddar, with a small cluster of grapes and a couple of small slices of bread. The blue cheese paired very well with the honey. Unfortunately, the bread was fairly stale, and there were not nearly enough slices of bread for the amount of cheese on the plate - there were only 6 pieces of 1.5\" rounds of bread. Eventually I was smearing blue cheese onto the slices of gruyere and cheddar as we ran out of bread. The cheese plate would be much improved if they included either more bread, or opted to offer some crackers instead.   Note about the ambience: The room was quaintly decorated and was sufficiently dim for a low-key feel. The music could use some help - it was way too loud and I couldn't discern any theme to their mix. At one point they were playing oldies, which then turned into pop and even some EDM. Hmm...  Over the course of the hour and a half we spent there, the bartender only came by to bring us our sangria and cheese but she never came by again to ask how we were doing. A man, who appeared perhaps to be the owner, came by once to ask us how we were enjoying our drinks and cheese. At one point, a large group of people came in and congregated near the bar area. They appeared to be the bartender's/owner's friends, and the staff dedicated all their attention to this group of people while ignoring the two of us. Eventually when we wanted to pay and leave, we took out our cash and had it laying on the table for quite some time. Clearly no one was paying attention to us, so I got up and handed cash to the bartender, who took the money without asking if we wanted any change. We had included enough in the amount of cash to account for tip, but it was a bit rude of her to not even look at the amount and ask if we needed change.   Overall, the prices were fair and the ambience was fine save for the music being too loud. They've got a great concept going on and a solid menu and drink list as far as I can tell. If The Social Study could fix the bread-to-cheese ratio and seriously improve their customer service, I could see myself coming back.", 
    "review_date": "2012-01-17"
  }, 
  "r9gVYSelt1Eib_hvpFwG9w": {
    "user_rating": 5.0, 
    "user_location": "Tracy, CA", 
    "user_name": "A M.", 
    "review_text": "One of my favorite places in san francisco to grab a drink. Good wine selection and they even serve warm cookies.", 
    "review_date": "2014-10-22"
  }, 
  "TU827hIj8_qLPU-713qWyQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Parikshit T.", 
    "review_text": "great place, chill out ambiance!", 
    "review_date": "2013-09-12"
  }, 
  "XTIaIL_r8Go30M3GOmZYYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jude N.", 
    "review_text": "Great ambiance. Has a vintage feel to it. Love the music playlist here. Ordered latte and one of the better lattes I had in SF. Will come back here when in the area.", 
    "review_date": "2014-08-20"
  }, 
  "joctkHttJRwX1y7A3nZYCA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "tw s.", 
    "review_text": "Small, loud party bar for Klub Kids - uncomfortable seating, blaring techno &amp; hip hop (even in the afternoon). If that's your scene...", 
    "review_date": "2015-01-25"
  }, 
  "yoT5mQ0EeB40AAMi4ZIyTw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leanne S.", 
    "review_text": "Great little neighborhood joint! It's a pretty casual atmosphere - gotta order your drinks at the bar even if have a table and can sometimes have slower service but I love the feel of this place. There's always some random movie playing and tunes from each every era which always has my fiends and I guessing the artist, year and song. The ambiance is hippy chic with reclaimed wood, leather and metal interior finishes. It's got that comfy, I'll have another round feel!", 
    "review_date": "2012-10-25"
  }, 
  "8sLNQ3dAV35VBCnPaMh1Lw": {
    "user_rating": 4.0, 
    "user_location": "Covina, CA", 
    "user_name": "Kathy Y.", 
    "review_text": "This place is super cute. I love how the name of the place ties in to its theme. You can sit here and study on the chairs that mesh into the walls if you're not using them. The brick walls also add a nice touch. The books are also real. My curious boyfriend always likes to touch things so of course, he picked up a book.  I actually came here for a private hosted party at night-- so there was only beer and wine being served. I'd come back for some coffee though. Too cute to not hit back up.", 
    "review_date": "2012-02-03"
  }, 
  "09T1oyi6c-9lvyt7gQCD2w": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Peter L.", 
    "review_text": "I suggest coming here if pre- or post-gaming for any nearby spot.  Their cocktails list is inventive and you should try their sangria if want it on the stronger side.  The vibe is as chill as at any drinking lounge but without the large crowd and noise that goes with it. This is not to say it's quiet as it is always full on my visits, meaning all the seats were taken. Still, it wasn't long before a table opened up. Also, there is always background music or a live DJ spinning (R&amp;B, house, upbeat music, the classics). They also project a movie onto one of the exposed brick wall.  This is located in the middle of the block parallel to Geary Ave, near Fillmore. Parking is usually hit or miss depending on time of day/night but should find some spaces within a couple blocks at most.", 
    "review_date": "2014-11-24"
  }, 
  "q2HpmWgpE9A_A4QNYyKrzw": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Kari V.", 
    "review_text": "This place is chill and intimate. Came here for pre dinner drinks. I love the ambiance, they have candles through the place. I order the amigo tacos and they were delicious. The bartender was very friendly and talkative. He told us they have a DJ 3 days out the week and that he mixes great music. I would recommend this place, specially for a 1st date so you can talk and relax. I hope to be back really soon.", 
    "review_date": "2014-02-24"
  }, 
  "qNhrkahVrUTpNp4yU7u_ig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pria P.", 
    "review_text": "I love Social Study- it's a perfect spot to catch up with friends in a casual, lively atmosphere with decent seating. There's a live DJ on weekends that plays great mixes (90s R&amp;B, what?). Beer/Wine/Soju only - they have beer cocktails!  Only negative is that they need someone on hand to bus tables- last time I was here, we waited forever for drinks while the poor bartender made several trips to collect empty cups from tables.", 
    "review_date": "2013-11-12"
  }, 
  "clsUcSMUxmlpdcvnVPLeoQ": {
    "user_rating": 1.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Kongie V.", 
    "review_text": "Having given it a second thought and try, me and my partner decided to drop by to grab a drink before we went to dinner.  Entering in, the place was somewhat busy (roughly about 15 people) but a good quiet crowd, we walked up to the bar.   At the bar..  Waiting... Waiting... Waiting...  (5 Minutes Later) Looking around for a menu, I asked the bartender, the same chick again from my previous experience months prior (see previous entry) puts a finger in the air to say I'll be right with you in a minute.  (Um, ok, did she really just raise her finger to say one minute.) So once again, I looked around to see if I can grab a menu, then I asked her, \"may I get a menu,\" to no avail she ignored me and went on catering to the people around me.  I don't know what this chick's problem is.  Observing her work as we WAITED to place our order for drinks, I can see that she's the only one working, well missy, it's time to hire someone else to help you.  What makes you think you can do it all?  15 minutes later, still waiting for a menu, I've decided to just go with whatever they had that was a house white wine. I politlely said, can I get a glass of..  IMMEDIATELY SHE CUTS ME OFF AND SAYS.. One more minute, then she goes to open up a bottle of wine. After that she hands over the Ipad to the other patrons, sitting next to me, looks at me then focuses on another person who walks by and TOOK the order of wine for their table.  WHAT THE F*CK!  At this moment, I'm like hold up, this B!TCH sure didn't give me the time of day and she's going to order from him?   This place has so much potential! I know she's the owner and all but damn, you are a F*cking Rude C-yoU-Next-Tuesday.  RUDE RUDE RUDE RUDE RUDE  DEFINITELY will never go back.   Yes she wrote to me awhile saying she apologized but I guess things haven't changed much.", 
    "review_date": "2012-10-22"
  }, 
  "8Aq_UdlsrjhBwGWb_U-xRA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wilhelm Y.", 
    "review_text": "In my more youthful days this place might have had a lot more appeal to me as a place to hang out with friends, enjoy a few drinks and catch up in loud conversation, but some of us change as we grow older and this place was simply a convenient place for our group to step into and unwind for a bit.  My friends and I had just completed a long volunteer shift doing kitchen prep work then serving as waitstaff for a fundraiser benefiting the nearby Creative Arts Charter School.  There were just a handful of us so we ended up working our collective butts off first preparing and assembling appetizer and dessert plates then walking around the venue serving dozens upon dozens of rounds of appetizers to paying guests.  The event staff kept us well hydrated, and the awesome chefs from Charles Phan's Slanted Door kept us well fed and even packed up some huge plates of leftover delicacies for all of us to take home.  All that work left us drained though and we really needed a place to just sit down, chill and reboot for the evening.  Social Study was just around the corner.  We looked inside and saw there was an empty communal table that could fit all of us so we decided to give them some business for the night.  The place is darkly lit mostly from dim overhead lighting very high above on their acoustically enhanced ceiling and by bowls of flickering candlelight on the table tops.  The Social Study theme is well represented with books (many were law reference books of the kind that nobody actually reads) stacked and lined across one wall atop comfortable looking individual booths.  Their menu is quite varied featuring small bites, many wines, draft and bottled beers and hot coffee drinks served in round bowl-like mugs.  You order at the bar, get your drinks and return to your table.  The bar staff was working in slow motion though and as more people walked in the line just grew longer and longer.  I guess having a varied drink menu doesn't always work in their favor.  We heard one of the ladies behind the bar apologize a few times for the long wait.  It all worked out and we all got our drinks eventually.  The tall wooden chairs weren't super comfortable but it was a seat and all of us really just wanted to sit down.  We toasted the night knowing that all of us worked really well together and we had just rocked a successful fundraiser for an awesome school.  My bottled beer was ice cold, and we were getting the rest we wanted so badly.  As the place became more crowded we found ourselves having to speak louder and louder just to hear each other.  They had loud hip-hop (Jay-Z, Beastie Boys, etc...) music blaring in the front of the house and they were projecting the movie \"Sin City\" high above the brick wall.  I enjoyed the random scenes of ultra violence on the big screen, but the combination of loud music, loud conversation and other people crowded behind our chairs grew tiring very quickly.  We finished our drinks and collectively agreed to get out of there.  For just a moment this was a great place to chill.  Thanks Social Study for presenting to us that moment!", 
    "review_date": "2014-04-20"
  }, 
  "iK5oMORPCmoWUmannptD-Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul W.", 
    "review_text": "Chill place to grab some drinks with friends.  Not really sure I would go there to study...", 
    "review_date": "2013-12-30"
  }, 
  "0pb7fWD194iTqPMFAG5Oxg": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Paul C.", 
    "review_text": "There's a tiny part of me that wants to take a star off because Social Study doesn't have liquor, but that's nothing compared to how great this place is.  On weeknights, it's a great place to just hang out with your friends, get some drinks and chill out. The video on the wall is great, as are the tunes and sometimes you can zone out in between conversations.  On the weekends it varies from pretty chill to busy--but I have yet to see it slammed. And there are so many different places to hang out, from booths to tables to the bar, that you can pretty much make it any experience you'd like.  Did I mention they have coffee? Good coffee.", 
    "review_date": "2013-01-06"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "If Social Study existed when I was in college, I would be...  1) Broke. 2) An alcoholic. 3) FAT.  Oh wait, I'm all of those things already...a fat brokaholic. *sigh*  Part café and part bar, Social Study is a cute and cozy neighborhood lounge serving Four Barrel Coffee, Beer, Wine, Bar Bites, Charcuterie Plates, Sandwiches, and Pastries. It's like the Sugar Café of the Fillmore (my review: <a href=\"http://www.yelp.com/biz/sugar-cafe-san-francisco#hrid:VjXjgP-DcKCygEyQExIexQ\">yelp.com/biz/sugar-cafe-…</a>) but with a low-key, vintage hipster vibe with an electronic blue padded wall with fold down seats, exposed red brick walls, a communal table and a rustic wooden bar. On nights the DJ isn't spinning from the balcony above, 90s Hip-Hop is played in the background along with movies from that era.   Social Study is perfect for a chill happy hour, pre/post dinner drinks, and/or post-movie drinks because it's just one block away from Sundance Kubuki. Is it a good place to study at? Ummm, after several glasses of wine, the only thing you'll be \"studying\" is the cutie you're eye-goggling from across the room. HOLLA! *Wink Wink*  Thank goodness, Social Study never existed when I was in college.", 
    "review_date": "2012-08-20"
  }, 
  "kHTpRKU5ulUdDy1Lg-RNHg": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Bonnie Z.", 
    "review_text": "The Social Study is definitely a great place to be social! I brought my group of friends here in the middle of the Ramen Festival this past weekend. We couldn't get any ramen and what better way to drown our sorrows than with some beer, wine, and soju cocktails?   I got THE CRANE and thought it was super refreshing, especially after fighting my way through hordes of people in the Peace Plaza. I couldn't taste the soju but definitely felt it soon (although that might be due to lack of eating -- curse you long lines at Ramen Festival!). I loved the light citrusy taste paired with the subtle heat of the ginger syrup. My friends enjoyed the sangria and hard apple cider. For a quick bite, I recommend the POTATO BRUSCHETTA -- the potato paste and spicy tomatoes over toasted bread was delicious.   Upon walking through the door of The Social Study I immediately fell in love with the decor. Books lined the shelves along the wall and multiple board games were sitting in shelves around the room. I can definitely see how they incorporated the \"study lounge\" feel into this bar.  Unfortunately the place was a bit more cozy than I expected and my party of 8 had a hard time squeezing in. I think coming back with a group of 6 people or less would be ideal. We managed to snag a table to hang out for an hour or so before our dinner reservations later.   I would definitely come here again for a nice hangout spot in Japantown. Hopefully we can play some games next time.", 
    "review_date": "2014-07-20"
  }, 
  "aqWXHhcR_CdmKmxggFOlEA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy L.", 
    "review_text": "My new favorite not-in-my-neighborhood-neighborhood spot.   A great, chill place to grab a drink (or coffee or snack) - I've never had a problem getting a seat at 6 pm or 9 pm. I'm surprised this place isn't more crowded.   Pros: - Solid beer and wine menu - Games! - Good mix of noise/music and chill vibe so it's good for low-key work or catching up with friends - Free wifi - Big windows that let in a lot of light  Cons: - There's sometimes only one person behind the bar so it can take a bit of time to get your drink - Later in the evening, it gets a little more \"ntz ntz\"", 
    "review_date": "2014-05-22"
  }, 
  "CvFgz9oYDBX_8_UBAIryeQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina V.", 
    "review_text": "The little tables and seats attached to the wall that fold out are wonderful for creating space in here, and surprisingly comfortable as well. Easygoing atmosphere, very study friendly during the day and there's simple transition to evening into a hip bar. Serving Four Barrel coffee is a plus.", 
    "review_date": "2013-06-10"
  }, 
  "vZSm2ZFO0ryY1kh4EvNQig": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Maya-Luisa G.", 
    "review_text": "Whoever decorated this place I seriously want to hire to do my house. Love it!   The coffee is in between a super strong Turkish coffee and a regular cup of jo which makes for an incredibly unique flavor.  Y I think that stands for pretty much anything else on their menu...may sound standard but has a unique flavor profile. Ex -- their chicken salad which packs a bit of an unexpected spicy punch :)  Come here to play a board game with a friend or catch up on your reading whatever it is you'll enjoy yourself!  I haven't come here at night but after reading the rest of the reviews ill have to check it out.", 
    "review_date": "2013-11-14"
  }, 
  "ccfVsl7SZeK-2Ixc2-anuQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brianna S.", 
    "review_text": "Fun spot! Popped in for a nightcap and definitely enjoyed my time there. Good selection of drinks and snacks, a dj spinning up top, and cartoons projecting on brick wall!   Located in a bit of a random spot, but I'd totally seek this place out again.", 
    "review_date": "2014-12-21"
  }, 
  "V5633h2RXjFcStScoMZmGQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jessica d.", 
    "review_text": "Went on Friday For the first time because Fat Angel was too crowded. Ordered the 2010 Zinfandel at the bar. Saw the server fill most of my glass from the bottle, and then when he thought I wasn't looking, pour in wine from a glass that someone had already drunk from. Gross. And besides that, the food was way lackluster, and the sangria was watered down and too sweet. Should have just waited at Fat Angel.", 
    "review_date": "2012-05-20"
  }, 
  "wNsSz6R73I3tcskuTv6yQw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Philip W.", 
    "review_text": "This place is too cool! Coffee shop, bar, and study lounge all rolled into one. I've been searching for some time for somewhere that I can do work and really get into the zone. The Starbucks on Fillmore just hasn't been cutting it recently. Loud, closes early, and awfully exposed to outside distractions. Walk a little bit south on FIllmore though and take a left at Geary, and you're in a completely different world!   First off, I'm a huge fan of dim-lights when I do work and when I do drank. And sometimes even when I do eats. So I knew when I set foot in The Social Study that I would enjoy my time there. The very very first thing I noted beyond the dim lighting was the general atmosphere about the place. Macbooks scattered about with their lights glowing bright in the low light, coffee cups and wine glasses at everybody's side, and the occasional group of friends/couples engaged in conversation. There was a DJ booth one floor above, although it was empty when I was there (9 pm on a Sunday night) and a movie being projected onto a wall with hip hop playing in the background. FANTASTIC. I don't fancy myself a hipster, but I do enjoy it when a cafe gives off a hipster vibe and this place fit the bill. Even had a book shelf with books on the side.   I'm not a huge coffee drinker (especially at 9 pm) and it was a bit late for grub so I just ordered up myself some tea and got to work by joining the ranks of customers with their Macbooks out. Got some productive work done and left after last call. I'm definitely coming back here for my studying/productive needs, and most likely coming here for my eating and drinking needs too.", 
    "review_date": "2013-10-29"
  }, 
  "82dCHyU-ANOgdhxUgZsUeg": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Marlon T.", 
    "review_text": "This is one of two bars I went to while waiting for a table at State Bird Provisions. The other bar was Boom Boom Room. The Social Study was more classy with a unique theme. It was like a mix between a classy dimly lit wine/sangria-selling bar and a space for studying/working. They had nice furniture/light fixtures and power outlets for laptop users. This place is on the smaller side so it might not be ideal for a party of more than 6. The sangria was probably the best I've ever had because of the sweetness and hints of cinnamon. I liked this placed more than Boom Boom Room, but I guess they have two different purposes. This is for sure a spot that makes SF what it is.", 
    "review_date": "2013-11-25"
  }, 
  "L8Om2473wuZK4LTxLL6RUg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina R.", 
    "review_text": "Café by day, wine bar by night, this cozy space is a welcome addition to the Fillmore, a 'hood I admittedly don't get out much to these days.   They have some really good, reasonably priced wines on the menu and do a damn good michelada. (Swoon!)  Plus, on certain nights, they project corny movies onto the brick wall. Suggested pairing: cheese plate with three-plus micheladas.", 
    "review_date": "2012-02-13"
  }, 
  "6e7siZNcHSpocv3v_LHTRA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric W.", 
    "review_text": "This place absolutely rocks. Harmony and her husband make SS one of the most inviting cafes I've been to any where. She is very much a people person and it shows in how genuinely she interacts with all of her patrons. But besides the people, decor tasty menu, the music can't be beat. All day and night they play old skool soul and hip-hop. My nickname for SS is \"Cafe Shazaam\" because that's the app I'm always pulling out to ID the old skool joints that I here when I'm there. Could it have a few more outlets, sure. But I just bring a splitter and extension cord and I'm fine. It's a very unique place and definitely worth at least checking out the next time you're in the Fillmore.", 
    "review_date": "2013-03-16"
  }, 
  "ZjikGmYnwUBcbMvFQ702xg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Merritt W.", 
    "review_text": "While I agree with previous reviews that the place is aesthetically pleasing... It definitely doesn't work as a coffee bar/internet cafe.. .perhaps a relaxed bar?  Laptop unfriendly (i found 1 outlet in the whole place next to the window with 1 available plug) and uber expensivo for joe (3$ for a normal size mug and $3 refills-- are you kidding?).  A better place for four barrell coffee is just a healthy walk up Fillmore at  Jane Cafe ($2 a cup with FREE refills and a fair amount of plugs for people who like to study on their laptops).  Jane also has decent food at anytime of day- for some strange reason Social Study doesn't serve real food before 4pm, just day old scones, bananas, and chocolate muffins.  Their tapas menu did sound appetizing however.  Has potential but i'm not satisfied that the owners have really defined what they're trying to be yet.", 
    "review_date": "2012-02-10"
  }, 
  "x6_8-SBS55EU4xNIjS2rrA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "blair k.", 
    "review_text": "Nice lil gem.. Great service, nice wine selection, lil bites to eat... My bf and his friend are studying while I read", 
    "review_date": "2012-09-16"
  }, 
  "UVs_7nPjqK_W_ap96IClpA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam F.", 
    "review_text": "This is a great place to go for a drink and some game time! I checked it out with my boyfriend and we played Uno for almost an hour. I ordered the sangria which was pretty good but a bit strong for my taste. I liked the variety of board games they had, and they were playing some great music. I'll be hanging out here more often hopefully!", 
    "review_date": "2014-06-08"
  }, 
  "8STCVV53bPrUVqrRI-7Y2A": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Anthony C.", 
    "review_text": "Best sangria in SF hands down. I'm so glad I found this Fillmore gem.", 
    "review_date": "2012-01-15"
  }, 
  "WppPIBVK9jEh3B3L1uZEag": {
    "user_rating": 5.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Rishi G.", 
    "review_text": "Social Study Recipe (Yield 1)  - Take one serving \"Sugar Cafe\" on Sutter. Reserve the comfortable seating and dark modern decor. Trim excess head-fat/douchebaggery due to Cellar and the Marina wannabes from next door to Sugar Cafe.  - Add one tbsp of Bourbon and Branch. The drinks at Sugar Cafe are not interesting nor have they changed in years. Social Study has a much more unique drink menu - lots of chocolate based ones, which as the rare straight male chocoholic is appreciated.  - When marinating, move away rest of Fillmore which is turning into a baby Marina. I think teacup Chihuahuas outnumber people at this point.  - Serve hot. They don't have air conditioning, and just my luck I came here the hottest Saturday in the last decade.", 
    "review_date": "2014-10-26"
  }, 
  "xrECRCkEKJkKm-dCaTviGg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Kurtis C.", 
    "review_text": "Nice little pub I stopped in at after dinner around the area they have a cozy feel with books on the walls and brick with soft chairs along both walls. The music was mellow and relaxing with a good crowd of people. The crowd on a Saturday night was mostly white and around older 20s to 30s. Bartenders were nice but a little bit slow the drink selection is limited not a full bar they don't have whiskey and stick to their list of prepared drinks. the drinks were good but nothing amazing", 
    "review_date": "2014-11-30"
  }, 
  "yobL2rRTkkYznuoZBnMByw": {
    "user_rating": 4.0, 
    "user_location": "Inner Richmond, San Francisco, CA", 
    "user_name": "Jena C.", 
    "review_text": "The Three Amigos Tacos and Beef Sliders are ridiculously good.", 
    "review_date": "2013-03-22"
  }, 
  "CWxhjeeUjV5x6VvxF_dJbA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alison C.", 
    "review_text": "Social study is such a great neighborhood cafe and bar! I'm so glad it came to the neighborhood. For the morning, they serve four barrel coffee - so yummy! And they have delicious, fresh pastries. For the afternoon and evening, they have an extensive and eclectic wine and beer list. Plus, the owner has come up with fancy wine and beer-tails that are refreshing and unique! Oh, and there are great nibbles and snacks available, like their new charcuterie sandwich with fatted calf salami!!! AMAZE-balls!   While the food and drinks are great, the ambiance is the best feature. The 90's R&amp;B and old school jazz music set the mood (live dj friday and saturday nights!), and a cool, exposed brick wall anchors the atmosphere as professional and hip all at the same time.   Lastly, the owner and staff are amazingly nice, helpful, fast, and fun to talk to. They know their regulars and take care of them. I cannot be more happy with this place. A true neighborhood gem that fits in to (and dare I say, defines) Fillmore street's evolving character.", 
    "review_date": "2012-10-25"
  }, 
  "-XF9C3V1cCxn19j-Rlbglw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sidney L.", 
    "review_text": "I love the idea, just not the execution. The Social Study is a bar/cafe/lunch/dinner/study place, meant to be a hip place that people can both work and socialize at. But truly, it's impossible to get any work done here, due to the blaring pop music that prevents you from thinking. And the food and drinks are simply unremarkable.", 
    "review_date": "2013-11-24"
  }, 
  "ndnEX7tQ4Dr34ZhFSrB6OA": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Mika O.", 
    "review_text": "I'm a big fan of Social Study, if it was closer I'd make it a regular stop. Nice vibe, great coffee. Best music I've experienced so far in SF - mostly old school R&amp;B and hip-hop. Personally I can't ask for more. Bartender is lovely (I apologize for not knowing her name); she's super friendly and does a nice job engaging with customers.   Free wi-fi but can be on the slow side at times.", 
    "review_date": "2013-05-16"
  }, 
  "cetOjQ25SGauSEkLMIta0Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Asli O.", 
    "review_text": "This place is radiating some good ass juju.   I met up with Nish N. here, and randomly met a one Jenny Morgan, photographer extraordinare, who took my picture for her side project of getting out of her comfort zone &amp; chatting up strangers. See her work @ <a href=\"/redir?url=http%3A%2F%2Fwww.ohhappydawnphotography.com&amp;s=d19a4a64cf1e3b3bee98cd30aab411006a37d8b7078e22c4a3e52a3bf97c53aa\" rel=\"nofollow\" target=\"_blank\">ohhappydawnphotography.c…</a>. Something is going on in this place that makes you want to get inspired, make a new friend, or just read a really really good book, hear some really really great music and/or get engrossed in a fulfilling conversation or nosh on some snacks and tea.   There's good soul music on vinyl spinning in the background, endless cups of coffee, chattering friends, friendly nods, and board games, antique books, and seats suspended from a tufted wall, sturdy wooden tables of various sizes according to your studying, working, or communal needs.   And then there's draft beer, wifi, snacks, art work and exposed brick walls, plus Slider Sundays, offering two BBQ pork sliders and a choice of hoppy beverage, $7. Taco Tuesdays serves up three soft tacos and your beer (except Guinness), also for $7. Lucky number 7, anyone?   Thursdays DJ KBJ spins from 8p to 11p. Fridays DJ Doc Fu from 8p to midnight. Saturdays include a rotating list of guest DJs.   It's like Cheers for the Fillmore. It's the kind of social study dreams are made of. But now, it's come to life. Get social and study.   ps. The bathroom is like stepping into 1981. Disco ball and all.   True story.", 
    "review_date": "2014-01-03"
  }, 
  "c582Zt5sUfQZxyaHyDeR8Q": {
    "user_rating": 4.0, 
    "user_location": "Northridge, CA", 
    "user_name": "Roberto G.", 
    "review_text": "I work next door to this business and been hearing a lot of good things. Had a break last night and thought I'd see for myself what all the fuss was about. From the moment I walked in I was overcome by a sense of \"hominess\", if that makes sense. The place is decorated like a study hall, hence the name.      The crowd is typically mid-30s or so which is chill and calm, but it seemed like most people in there were either whispering or trying to whisper. I felt like I should whisper cuz someone might be studying for a final or something.      Besides that and the fact that the are too dim to read the menu, this place gets my stamp of approval. Out of the dozens of bars I've been to in the city, this is probably the best place to take a load off and relax with a nice brew or glass of wine after a long day at work or school. I'll definitely be coming back.   Oh and the bartender is super attentive and easy going, I think his name is Roger or something. I know it starts with an R...I think. Haha  If you go soon after this review, try the winter solstice and tell them Rob from KOU sent you. Deuces.", 
    "review_date": "2013-12-29"
  }, 
  "N4GJkCdGWgxX0XJyNyWuQA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth M.", 
    "review_text": "Ryan's smile changed my outlook on the day. He was so helpful and my cheese plate was absolute perfection. I felt like I was surfing on his beautiful blonde waves!", 
    "review_date": "2014-10-05"
  }, 
  "bSl6ejEd8TnZfUH9rpyBLg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jonas H.", 
    "review_text": "Best Michelada I've had in San Francisco! I like the ambiance and hasn't been too crowded when I've been.", 
    "review_date": "2013-06-09"
  }, 
  "dC5kYsLGGoLLVlMjeMqfLw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dru M.", 
    "review_text": "The boyfriend and I were out on a Friday night...looking for a new neighborhood place to grab a cocktail. After a quick Yelp search...we found ourselves at The Social Study.   The space is kind of hidden (which I loved)...right off of Fillmore. It had a hipster vibe to it, yet they were playing old school R&amp;B and The Big Lebowski was being projected on one of their concrete walls. Interesting mix, but I was digging it.   They offer a large selection of wines and wine cocktails, as well as a small menu (imagine cheese and charcuterie plates). I do wish they offered liquor, but without a license, they make up for it with the rest of their drink menu.   Note - not too big of a place...so you might have an issue with a large group, unless you're willing to just stand around. But if you can snag a table or bar stool...you'll stay all night.   Overall...I'm happy we stumbled upon this gem in the neighborhood. You should check them out soon.", 
    "review_date": "2012-05-25"
  }, 
  "CnLNC8VMErPASEq_uimDaQ": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Meg T.", 
    "review_text": "Came in on a friday night when my sister was in town with her boyfriend and a bunch of their SF friends in tow.  The music was excellent (the DJ played an excellent mix) and the place wasn't super crowded yet.  We loved the brick walls, the booths in the side and the random board games around.  My only issue was that the bathroom situation definitely needed some help.   However, if you're looking for some chill place to hang out with your friends, then you should definitely check it out.", 
    "review_date": "2014-02-15"
  }, 
  "y89NiiJC39QOwLLhTugLQQ": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Mitch G.", 
    "review_text": "Really cool spot- 5 stars on decor and atmosphere. 1 star on the quiet scale. They play really loud music which makes it feel like you're in a club. Not what I was looking for when trying to read a book on a Saturday afternoon!", 
    "review_date": "2014-08-30"
  }, 
  "iLjMdZi0Tm7DQxX1C1_2dg": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Ruggy J.", 
    "review_text": "It seems like every time I turn my head, the neighborhood in which I call home gets cooler and cooler. With recent additions to the project-lined streets like Maven (well, more Lower Haight... but still within a doable walking distance), State Bird Provisions, and now The Social Study (to go along with pre-existing hot spots like Fat Angel, 1300 on Fillmore, Yoshi's, etc...), the Western Addition sure is making a run at being one of the niftiest destinations in town.  The Social Study is right up my alley -- they carry a wide array of different wines from all over the globe, feature piquant small bites like artisan cheese and charcuterie boards, and the space has a hip, minimalist vibe that'll make you feel right at home the moment you boot, scoot, and boogie through their front doors along Geary. It's still in its infancy being open only a handful of days at this stage in the game, but as they find their sea legs and carve a niche into a part of town lacking similar haunts, I can see this being the type of place I dip into before any show at the Fillmore or an evening romp at the Kabuki.   Beer and wine only, but word has it their sangria is second to none. Will have to give that a go next time!", 
    "review_date": "2012-01-17"
  }, 
  "nyXNNLKjSWtDQka5PrFoew": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vivian D.", 
    "review_text": "Always walked by this place but never paid much attention until I ended up in this area right around happy hour. Stopped in for a drink and ended up ordering their tacos and bbq sliders as well as some of their cocktails. Everything was delicious! Very cute decor, great place to catch up with some friends or a date! Music was a little loud for \"studying\" in the afternoon. Great spot if you're in the area for HH, but not sure if I would go out of my way to come to this bar for nightlife as it is tiiny.", 
    "review_date": "2013-08-09"
  }, 
  "gZV7Ps9eVunuUY1E9qjj4w": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Kristi I.", 
    "review_text": "By far the best wine bar on Fillmore! The library decor is super cozy, the bartenders know their wine and can make mean cocktails. They also have good small bites and plates to share. This is by far my new favorite spot on Fillmore to meet friends for Happy Hour. I always go to meet for one drink which ultimately turns into 3 or 4 plus food cause this place just has the best vibe!", 
    "review_date": "2012-10-09"
  }, 
  "4RlzFohEgBdFXUGoqvpZqQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melissa N.", 
    "review_text": "We (my husband and I) came here a couple weeks ago on our quest to try 52 new places in 52 weeks.   How have we never BEEN HERE!? If I lived along the Fillmore corridor this would be a once-a-week spot for me. We were there about 5:00pm on a Saturday so it was dead, but I'm guessing that on a Friday night or Saturday after 9:00pm this place is hopping. Or at least I sure hope so. Get the Sanfragria. It's their house made Sangria with tons of fresh fruit in it and only $7 a glass.", 
    "review_date": "2012-03-11"
  }, 
  "q42mXysK6cirJ8ZLTCyqYQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Edward A.", 
    "review_text": "Friendly staff, great music and sangria.", 
    "review_date": "2012-04-29"
  }, 
  "3m_oA6_F9V2AEz0q3AOw8Q": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Diana G.", 
    "review_text": "I checked out the Social Study last night for the first time with a large group of friends. We all had a freaking blast. Intimate ambiance with a modern loft feel: exposed brick, steal beams, high ceilings, with DJ mixing from the loft area. This sexy lounge is located in the Fillmore, so it's surrounded by lots of energy and great restaurants. The DJ was mixing up all kinds of nostalgic beats - 90's hip hop, 80's mash, he was definitely serving up a hot plate of the meow mix special.   The snacks were delicious - we ordered the Board Meating with two kinds of salamis, prosciutto, crackers, sour dough sliced rolls with some chili dipping sauce; The Marinated Olives - were solid and a generous serving; The Cheese Plate with an array of complimentary cheeses that paired nicely with the wines.   The Sangria is on point. I was dangerously downing these tasty beverages and nibbling on the pieces of fresh fruit... yes I said FRESH. My gf got the Nojito - an exotic approach to a classic drink. My other friends ordered sangria's, Malbec's, and of course we had our beer drinkers.   Service was friendly and prompt considering how packed the place was and how large our group was (15 heads)   If you dig the Lounge vibe then you will love the Social Study.", 
    "review_date": "2012-01-21"
  }, 
  "RQT9QoVcQd9gnKhayD5cUw": {
    "user_rating": 3.0, 
    "user_location": "Orange County, CA", 
    "user_name": "Akiko I.", 
    "review_text": "- Locale Destination - It's on Geary Blvd and Webster St in San Francisco.  It's right across street from the Japanese town or little Tokyo?!?! (I don't know what it's called ;p) I'm a tourist, so I don't know about the area, OK? Bear with me ;p  Decor is simple, hip, chilled and almost like a bar. Coffee, scones, wine and beer etc..  Open early for booz, which is plus :)  - Gluttony Expedition - Boont amber ale: smooth, light with a hint of bitterness. Nice! Big daddy : very light, watery with a bit of bitterness. Meh for me.  ** Both beer.  - Conqueror's Deduction - 3.5 stars. Price is decent. Nice chilled atmosphere. You can drink alcohol early ;p Not bad.", 
    "review_date": "2012-02-28"
  }, 
  "QI6Hh7M68LQfMw68vLlhmw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Neha H.", 
    "review_text": "Not too loud, dim lit, not too crowded. Great food and great sake cocktails. Friendly bartender. I think its perfect for a date night.", 
    "review_date": "2014-11-03"
  }, 
  "UzG5IHFUu6H1UyCRbqHHZw": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Ting A.", 
    "review_text": "why is family guy so inappropriately funny? why does facebook double as a landing site for airing dirty laundry? why is rainbow sherbet so delicious?  it's true that there are liberties taken when you work from home, but they can also be quite a hindrance when you're trying to get some serious work done.  thank the lawd for places like the social study.  there are no long, comfy couches where you can cuddle and look longingly into your significant other's eyes.  there's no extensive liquor menu for you and your bros to take advantage of.  this is not the place for daydreamers or severe, drunken tomfoolery.    as sterile as i've painted it, the social study is also an attractive, contemporary space w/a chill vibe.  a few medium-sized benches, stools, and one lone, cushioned seat are scattered within this lofted space.  the juxtaposition of the blue, padded wall and the brick wall is a nice touch.  i only wish that the solo tables had more surface area.  you can barely fit a laptop on it.  the highlights are: - free wifi - AWESOME selection of music  (i mean, who plays shai anymore??  a few of us couldn't help but sing along!) - four barrel coffee*    *sure, jane is a stone's throw away from here w/free refills, but their coffee tastes watered down compared to the social study's.  if you're an avid four barreler, you'll definitely taste the difference.  plus, the pretty gal behind the counter (whose name i haven't caught yet) gave us a free refill AND topped us off in one visit.  she's always been very friendly every time i've had to escape the distractions of my home.", 
    "review_date": "2012-05-09"
  }, 
  "vr-iqWWCnWcrtSNwjP_4zA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luisa A.", 
    "review_text": "this spot reminds me of a hipster version of your typical old school coffee house sans couches and with better coffee.  communal tables, beer and wine along with internet access means this place will not stay empty for long.  it was when i went this afternoon, but the service was friendly and the music was perfect for a rainy day.    i can see how the mood of the space might change from morning to night, but all in all a great place to hunker down and get some work or studying done while sipping on a $9 glass of sparkling wine.", 
    "review_date": "2012-01-20"
  }, 
  "XovcrzGHvrd7k4jcEZ3KAA": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Suzi G.", 
    "review_text": "LOVE!!!", 
    "review_date": "2013-08-04"
  }, 
  "PMV_KKQ8HmiCLD-1SYJ6RA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jimmy M.", 
    "review_text": "Hard keeping up the Potatoes Skins N Bacon with BOH appliances:( Although, your day needs great vibes, tunes &amp; crowd- the Social Studys genuine brunette beauty is putting SanFran foundations first, while hosting a mix table above the bar to play board games below while enjoying a cold IPA", 
    "review_date": "2014-01-18"
  }, 
  "_f50ggVhvgkqtbR3tCJhlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt L.", 
    "review_text": "Holy Crap, this place is amazing.   Seriously, I am not kidding, I cannot give this place a high enough rating. The ambiance is great (mid-century school library meets wine bar), the wine selection is great and the food is incredible! Everyone who works there is awesome, the music is awesome, the free WiFi is amazing.  This is my new favorite corner in SF.", 
    "review_date": "2012-06-20"
  }, 
  "jW24T6R4_lSFUXQZEe2Jzg": {
    "user_rating": 5.0, 
    "user_location": "Russian Hill, San Francisco, CA", 
    "user_name": "Nick R.", 
    "review_text": "Probably my second favorite bar in San Francisco after Upcider. This is just my kind of place. The vibe is excellent and incredibly chill. Its almost scary to write a review about it because it feels like such an unknown secret but really people should know about this place cause they deserve all the business.   Located just a couple blocks from the shopping and restaurants of upper Fillmore and far enough from the sketchy parts of the Fillmore its is the perfect location for grabbing drinks on a date or after work. There are never a ton of people here which is really great. If don't want it to feel like work to go to a bar then this is your place. It is a very small location with minimal seating at the bar or otherwise. You are welcome to stand make your own seating. There are games as well for those wanting some board game action. There are also books everywhere. I forget the story but they are incredibly random and fun to thumb through. There is an attic above the bar area where a DJ plays tunes on random nights and during the weekend.   Sometimes there are random movies and old tv shows being displayed on the wall. I never know what its going to be so I can't tell you what to expect. I saw scooby doo once but then I love lucy another time so yea who knows.  The music deserves its own five stars. Whether its a dj or a set playlist in the background you will hear some of your favorite 90's R&amp;b or even classic blues and soul like Otis Redding or Sam Cooke. The best playlist in the city hands down.   Its very dark in the place which adds to its chill vibe plus wifi makes it a great place to get work done or drink with someone special. The bartenders are excellent and their drink menu is incredibly fun. There are mixed drinks that are very rare and exclusive to the social study. You owe it to yourself to try them.   Its usually really quiet and intimate here which makes it perfect for meeting people or dates. Candles flickering dark atmosphere and being surrounded by couples feels good.   Whether you are looking to kill sometime before heading into Fat Angel or seeing a band at the Fillmore this place is the best reason to come into this area. Fillmore has always been a favorite place of mine and the social study defines what makes going out in San Francisco special. Will forever be a loyal customer to this establishment.", 
    "review_date": "2014-09-19"
  }, 
  "kw36fM-UtAQR7rT4TuLCMg": {
    "user_rating": 5.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Greg R.", 
    "review_text": "Such a cool place.  Still a WIP but when they are done it will be even more awesome than it is already.  And for a bar the food rocks; appetizers only but enough variety to fill you up.  Yum!", 
    "review_date": "2012-02-29"
  }, 
  "TxcG6Te8a3oJ5XJNZvQ5cw": {
    "user_rating": 4.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Tiffany T.", 
    "review_text": "The Social Study is a nice little bar located in Fillmore. It was pretty easy to find and was jam packed at 11pm on a Saturday night. The vibe to the place was really nice, yet busy. I loved the décor, very hipster. The place is a wine and beer place only, which I happened to really like. I ordered a delicious Amber Ale for only $5, which is a great price for a drink in SF. Tables are difficult to snag, you have to be pretty lucky. I am also glad there was a restroom here, which is located in the back. I would definitely come back to this place!", 
    "review_date": "2014-09-29"
  }, 
  "AUYGt1x5TuxPskCcyHq3Iw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Methinee B.", 
    "review_text": "The husband and I stumbled upon this place after a movie at the Kabuki. We were in search of a fun, new place to get some wine &amp; cheese and we found it! The Social Study is a small place with beautiful exposed brick, great school/study decor, excellent R&amp;B Jams circa 90's and early 2000's, sweet bartender and great wine. I would definitely go back again for more great ambiance and chilling.  Only bad thing is even w/the WIFI, our phones did not work so well on Shazam (we were trying to tag all the old school jams). Even w/1 phone ATT &amp; the other Verizon w/4G, didn't matter. Oh well, that just told us, \"Get off your phone and ENJOY!\"  Please stop by if you're in the area. You won't be disappointed. :)", 
    "review_date": "2012-07-01"
  }, 
  "7HXSL_YdprSSMfpJyBh8Rg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Coco L.", 
    "review_text": "Drinks are okay, but I like the ambiance and decor. The bartenders are really friendly.", 
    "review_date": "2012-02-25"
  }, 
  "H2FahZmg6BKHOFaLnUXgsQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David Z.", 
    "review_text": "What a great find! A friend brought me here after dinner, and I was sad to know I'd been unaware of such an awesome place.   Our cocktails were fantastic (they have a very creative cocktail list, with mixed drinks of beer, wine, soju and more). The bartender was friendly, and the atmosphere and music were just right.   Wasn't there on a DJ night, but the DJ loft looked really cool--and I definitely plan to return.", 
    "review_date": "2014-11-24"
  }, 
  "UJkhP7wNRUW9KzYektCtuA": {
    "user_rating": 5.0, 
    "user_location": "Marina/Cow Hollow, San Francisco, CA", 
    "user_name": "Hailey H.", 
    "review_text": "Hit up the Social Study after an epic fail of a concert at The Fillmore (too many teenagers in weird PLUR \"outfits\" aka costumes), and was immediately HOOKED.  This place is perfect for a ladayz night out or date night.  Great drink menu, awesome music (every song was like, \"Oh I love this song!\"), people are cute, bartenders are nice, etc., etc., etc.  Go here.", 
    "review_date": "2013-11-20"
  }, 
  "KEJuQUwE509pdwYUH6XfEQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hael S.", 
    "review_text": "The Social Study just did it right. Harmony (the owner) had a very clear vision which was executed perfectly. The Social Study reminds you of all the great little spaces in the East Village that make downtown Manhattan so unique. Whether you are going to catch up with a friend, meeting for a first date or just looking to get out on your own- The Social Study caters to anyone looking for a relaxed and enjoyable afternoon or evening. Fabulous service, delicious food, good live music and there's always a classic movie playing on the brick wall. I highly recommend this The Social Study to all personalities and all ages- it's just great :)", 
    "review_date": "2012-08-26"
  }, 
  "fKR1pnGOWiXzHgQ-s-oCxQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Divya G.", 
    "review_text": "This place is so hip it almost hurts. Just kidding, it's A1, highly recommend. Not to do homework of course, which is what my friends and I attempted to do. The music was a little too loud (and inconsistently random??) for quiet homework purposes, but the aura of this place was like no other.  It was captivating: bricks lining one wall, books lining the other; a cool menu that included slightly overpriced ginger ale; old-school rap and Michael Jackson mixed with jazz; really cool semi-young people hanging out and tapping away on their laptops.  It really is an experience that is not to be missed. Try it once and see for yourself.", 
    "review_date": "2014-02-05"
  }, 
  "s6-kSU44dU3wSikEpwSf9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sandy L.", 
    "review_text": "I went in for a going away party the first week they opened and thought the concept was pretty cool.  I love the decor and the whole set up of the place.  They have a DJ booth upstairs and seats that pull down along the wall.  So far, everything that I tried in regards to food and drinks were delish.  I had the sanfrangria, meat and cheese plate, yummy bold red wine, nuts and olive trio, and pastry.  The co-owners were very cool people and know how to start a nice venue in the central part of the city...Jtown!", 
    "review_date": "2012-01-27"
  }, 
  "izfWJaChmgL1bIHb3-zFhA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Donald H.", 
    "review_text": "Great ambiance and cool vibe. Great place to hang out and let loose. The staff are very friendly and quick to serve you. Awesome Happy Hour. It is small and laid back.   Check it out if you like a great cup of coffee or to kick back and unwind with a drink.   d.", 
    "review_date": "2014-10-19"
  }, 
  "am2UDS4eHmL99dEDzUVeSQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Diane N.", 
    "review_text": "The Social Study is a very sexy study lounge.  I can't get enough.  The vibe is very chill--a Little Dragon's \"Constant Surprises\" and Prince's \"Purple Rain\" type of chill.  With a full bar slanging Sangria, beer, espresso, and ginger lemonades, The Social Study is great for a post-work wind/e-down.  There are also good \"study snacks\" for the adult palate.  I have yet to try the Sangria, but it's on the bucket list.", 
    "review_date": "2012-04-07"
  }, 
  "yGK2mFojDkln8pguXcnNlA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tori Q.", 
    "review_text": "My friend and I came to study on a beautiful Sunday afternoon.  All the cute little cafes in Japantown were packed so we had to do some yelping to find a study spot nearby.  The Social Study (appropriately named) popped up and we decided to give it a go.  I've always passed by this place on my runs and was meaning on stopping by.  I guess this was the time.    I love the pillowy, velvet blue walls with the built in chairs that you can fold down.  Such a cute layout!  However, both the seats and the tables attached to those walls are tiny!  Those seats are definitely not meant for bigger people or for studying.  It's meant for two people who want to drink.  Since we needed some space for our laptops and books, we took two seats at the tables, which were also very narrow.  The music they played was awesome!  I was jamming out to every song.  But it can be a little loud if you're trying to study.  There was only one bartender too who was busy trying to make everything.  I think this would be a good date place, evidenced by the couple next to us who were clearly on their first date (and probably met through online dating. lol).", 
    "review_date": "2013-02-12"
  }, 
  "fvPmgRm0qBs8gJHceqCduA": {
    "user_rating": 4.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Jahan T.", 
    "review_text": "Good place to have a caffeinated libation or something poured out of a bottle especially after a long grueling day at work. The place has a definite hipster vibe. Low key, inviting and genuine are words that come to mind. If you're looking for a pretentious place this ain't it. It's physically perched a little past the corner of Geary and Fillmore. This places it on the \"other side of Fillmore\" and reminds me of H St and the early days of the U St corridor back in Washington DC. But hey, the less DBs and carbon copy clones around the better. There are plenty of neighborhoods where they already frequent. I had a cappuccino the day I was there. It was well executed. The coffee had a kick but not the dreaded over-roasted/some would say burned aftertaste. There are also  small plates for you to play around with if you are so inclined and your stomach just won't stop gurgling.  Great addition to the neighborhood. Not all great things need to hide out in the Mission.", 
    "review_date": "2014-08-18"
  }, 
  "OmLK-5oDDF7q4xmXvE6XBg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe M.", 
    "review_text": "A welcomed addition to the neighborhood and the perfect fit to what was missing.  First, a couple of tips:  1) order at the bar (this is also written on the menu) 2) the Social Study only serves wine and beer / cocktails  Second, here is why I gave the Social Study 5 stars:  1) great vibe - mellow, cozy, and warm 2) you can actually listen to music and carry on a conversation...look up and you'll notice sound proofing on the ceiling 3) drinks - the sangria is just one of the tasty drinks on the menu  And third, things are only going to get better:  1) happy hour - is coming 2) live music - is on deck too", 
    "review_date": "2012-01-26"
  }, 
  "mhIWDTZgZN17tQvRBpSiBQ": {
    "user_rating": 4.0, 
    "user_location": "Wheaton, IL", 
    "user_name": "Peggy P.", 
    "review_text": "Fun Place, good music!", 
    "review_date": "2013-04-29"
  }, 
  "dIQnYbjf-rTxn5dQoRr0bg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristen S.", 
    "review_text": "Love this place.  Refreshing drinks.  Reasonably good selection of snacks (cheese board, pork sliders, etc.), and free WiFi.  Heaven.", 
    "review_date": "2012-10-15"
  }, 
  "RSLRo5XvR3uN3_Uqfc9geQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "I didn't like the wine selection in terms of quality. I didn't try the food bc I didn't see anything that i wanted to pair. There wasn't a cheese plate or charcuterie or lil nibbles or its or something. They had tacos and stuff, which is fine but thats not what Im looking for when i goto a wine bar. I felt the music was blasting and tasteless. Its ok to have loud music if its later in the evening but 430 ish, I felt the person that worked there wanted to rock out. It was loud and i trying to unwind, but i guess I'm a buddy duddy.  I thought the space itself was was quite charming, i loved the exposed brick but the wine selection needs to be upgraded.", 
    "review_date": "2012-03-20"
  }, 
  "yW-GBoKnzyduaG86Y1NLzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lily W.", 
    "review_text": "Damn, I can totally see myself returning here for both liquor and coffee. This...could be a very bad situation.  But the beers and food selection aren't overly pricey, so at least my wallet won't cringe. Much.  I walked in, and I swear the place is eclectic to my brain. Random books all over the walls (though, I guess I wouldn't have those med and bio books in my home), rap/hip-hop/R&amp;B with more of the 90's bent, coffee, liquor, and a projector playing Finding Nemo. On repeat. Pretty damn awesome already.  Staff here were friendly, but don't come out to the tables to get your order. So...order at the bar. And if you're feeling like a lot of liquor or coffee, sit at the bar.   There's just a few things that make it less of a 5 for me. The ceiling foam that looks like it's going to fall on my head at any time...is a bit scary. And the lack of waiter service. I guess its not too bad to walk up to the bar, but the bar also isn't set up for walk-ups...so I have to lean over people to get an order.", 
    "review_date": "2013-11-25"
  }, 
  "1me87I-cI8IcEe7CYLTiBg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dan N.", 
    "review_text": "This is a great addition to the neighborhood.  A perfect spot to visit after catching a movie or dinner in or near Japantown or Fillmore.   The ambiance is comfortable and hip.   Service was excellent. The owner, Harmony, was behind the bar and she is incredibly friendly.  This is the place to go if you want to have good conversation with others and not feel like you're yelling to have a conversation with each other. Very chill-out place.  I'm definitely coming back and telling friends about The Social Study. My new \"go to\" place for a drink and hanging out when I'm in the neighborhood.", 
    "review_date": "2012-04-01"
  }, 
  "mRRb8TZFCftKbuTTxx7ivg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda P.", 
    "review_text": "The Social Study is overall great. The food and drinks are fantastic, as is the ambiance and decor. However, the seats against the wall are less than ideal.  Don't get me wrong, they look great, and the whole interior is well designed, but the stool-like seats leave you hanging. I mean that literally, I couldn't figure out a way to sit on them comfortably because I didn't know what to do with my legs. They just dangled. I tried standing, but only ended up in everyone's way.  That being said, try and score a spot at the bar or a table.", 
    "review_date": "2012-08-20"
  }, 
  "bW2LMBS-D-qAgXfpeof3UQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gina S.", 
    "review_text": "1 or 2 glasses of wine turned into 6 glasses and 3 hours of conversation. Dont call me a lush, but yes I loved it!  Love the decor! Bathroom walls were really cool too.  The DJ booth is upstairs and the way they get up there is through a wooden ladder. SO cool, reminds me of climbing up to the top of a bunkbed.  Such a cool place to go for some wine and cheese and meats.  The guy who was tending to us was super nice! And then to find out later on in the night that he was part owner. I would definitely want to come back here and next time, I will order a bottle instead by glass and must try the sangria.", 
    "review_date": "2012-01-26"
  }, 
  "hRD1uMCRXkpDSbr5xC3R8g": {
    "user_rating": 2.0, 
    "user_location": "Corte Madera, CA", 
    "user_name": "Jade F.", 
    "review_text": "This place is pretty chill. I particularly like the dark wood and the old school hip hop that was playing the day I ventured in. I had some citrus-y type of beverage that was pretty tasty.   However, the bartender had a bit of an attitude. She kept me waiting, while she chatted it up with people who seemed to be her friends. When she did finally take my order, there was no \"Hi, how are you,\" and she seemed annoyed when I asked what she recommends. Needless to say, it's not the type of place you want to hang out while you're waiting for a friend to arrive... unless you know the bartender.     Even though I loved the music, I wouldn't return due to the service.", 
    "review_date": "2013-01-06"
  }, 
  "4sk51VxthFOM69Z8pUFAKQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joseph M.", 
    "review_text": "If ya need a fix of old Heman carton then this is the place. Oh and they also have a great wine list.   The ambiance is a dimly lit extremely intimate bar. With brick walls lined with 2 top bar tables. It's clearly a couples or date night spot. There is a bar in the back that feels a bit like a diner bar at pork store or some bfast dive. But the small bar makes the place feel small and urban.   The staff was low on a Tuesday night but I can walk my own drinks to my table. I'm just glad to see a nice bar in japantown.", 
    "review_date": "2014-09-24"
  }, 
  "ojL1lQtVrFdSHmghGmWLBA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joe S.", 
    "review_text": "The Social Study is a great addition to the neighborhood (Fillmore / Lower Pac Heights).  Great spot for coffee or drinks.  Try the sangria for sure!  Steps from theaters like the Sundance Kabuki, The Fillmore, and the jazz places.  Great atmosphere, great staff, and great patrons!  I can't wait to go back!", 
    "review_date": "2012-01-07"
  }, 
  "Xo74xSu8RY8pw-Lfb8JlqA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maren H.", 
    "review_text": "My favorite bar in SF - low key but not empty, very cool vibe, great drinks (and coffee if you need a Friday night pick-me-up). Great prices too for SF. Great for pre-dinner drinks in Hayes Valley or on Fillmore.", 
    "review_date": "2013-03-21"
  }
}