{
  "zS4dgSi662EmGqCLMhMYFg": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Woody F.", 
    "review_text": "Amazing cocktail service! This restaurant has a great atmosphere. I sat at the bar and had a few drinks with friends. After exploring the menu, which an amazing bartender Chad helped us navigate, we all split a delicious appetizer from the bar menu. Great for a date night or hanging with the homies. I will surely be back.", 
    "review_date": "2014-05-10"
  }, 
  "mE-hdFF4RgCxspZU72GAsw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian J.", 
    "review_text": "Been years since I've been to this old-school spot and was truly impressed with the overhaul. The fused enhancement--keeping the classic, faded North Beach charm with the addition of an excellent mixology program and hip cooking--really worked well. Definitely shell out for one of the menu cocktails, I loved the Suffering Bastard (always try a bastard drink) as well as the the Polo Cup. The Oaxacan Firing Squad will be perfect for anyone enjoying the Mezcal craze. Their Rosita differs greatly from my understanding of the recipe, so I'll have to try this one next time. On the food front, best thing is to share all your dishes for the optimal experience. Props for the pressed pig ears which we reluctantly tried. They tasted a bit like bacon sashimi, if such a thing exists, and we were pleasantly surprised. Make sure to add a tad of salt to the pieces lying under the top piece as a means to bring out the best flavor. The moscardini, aka octopus is tender, grilled, and I'm sure you will love it if you are a mollusk fan, like me. For mains, they were out of the cod, major bummer, so we got and loved the grilled polenta. The pork sausage is worth a go as well, very tender and different from any other. We were so full but tried the cannoli for dessert. Like everything, it was great. Can't wait to return. PS: Outstanding A+ service.", 
    "review_date": "2015-01-05"
  }, 
  "c8FOqDRhtL7q_YsQio6bog": {
    "user_rating": 4.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Kevin B.", 
    "review_text": "Tosca - it's so good to have you back.  This used to be one of my favorite North Beach watering holes back in the day. It's one of SF's classic bars. Many a celebrity used to frequent the place (and their infamous \"private back room\"), including: Sean Penn, Francis Ford Coppola, and famous rock stars. But over the years, Tosca started to experience some noticeable wear and tear in both upkeep and service. Finally, it was at risk of shutting down... until the team behind New York's Spotted Pig swooped in to the rescue. After a few months of revamping the interior, updating their bar program, and adding a kitchen, Tosca's doors are open again. And the best way I can describe the change - it's a like an old friend who's studied abroad over a year, and now he's back and a changed person. It's still the same old friend that you know and love, but just more sophisticated and mature (and quite frankly, the better for it).  My co-workers and I came in here the other night for some holiday cocktails and grub. After wading through the crowded, narrow bar area, we finally made it to their dining area. Fortunately for us, they were able to seat us right away. Looking around the room, everything looked somewhat familiar (the wooden bar, the large Rat Pack-style booths) but more spruced up than i remember. Obviously, the most notable change to Tosca is the kitchen and the smell of food. Our thirsty/hungry gang ordered some festive adult beverages and anti-pasti (pickled peppers, grilled octopus, roasted Romaine with pine nuts, charcutterie, fresh focaccia bread). I wound up sipping on a classic Negroni on the rocks (or one giant rock, I should say). This is an old-school cocktail and very easy to screw up if you over-pour one the Campari or Sweet Vermouth. My Negroni was perfectly balanced. One of the best ones I've ever had. I then indulged in their Point Reyes Blue salad (Heirloom Radicchios, Croutons, Dutch Shallots, blue cheese dressing). It was kind of like a more sophisticated take on a Wedge salad. I loved it. In fact, I pretty much licked my plate clean.  One warning - this place is LOUD. If you're looking for an intimate night out, this isn't the place to go. You'll be shouting at each other the whole night long.  All in all, we had a most enjoyable time at the new Tosca, I'm delighted to see it surviving and thriving in its new incarnation.", 
    "review_date": "2013-12-19"
  }, 
  "f4TmkSqamLyujpBSDksGcQ": {
    "user_rating": 3.0, 
    "user_location": "Junction City, OR", 
    "user_name": "Marin G.", 
    "review_text": "The wait was forever to get in. Doesn't take reservations. Service isn't very attentive nor helpful on ordering or answering questions. meal was burnt.", 
    "review_date": "2014-04-14"
  }, 
  "hpzBhu442zZMGaARnucwbQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "keith s.", 
    "review_text": "We lost a good bar and got an obnoxiously crowded overpriced restaurant.This used to be a nice quiet place to get a drink when everything else in the area was packed. Now the wait for a table is at least an hour even early on a Tuesday night.", 
    "review_date": "2014-02-22"
  }, 
  "81f0X1axCd9gIF9LCEJz5g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tomy T.", 
    "review_text": "I had high expectations because of The Spotted Pig so I was secretly hoping it was going to be as good.  While I did see the reviews here, I wanted to give the restaurant a chance.  It was a bit of a disappointment.  Like others have said on here, the food is salty.  Some of the dishes were overly salty that I drank so much water during dinner and drank more water when I got home.  That said the meatballs, gemelli and linguine were great (but could have a bit less salt).  For main I had the braised oxtail and I found it mediocre. The meat was a bit gummy probably from too much fat and oils - needed more braising time.    I got the gelati thinking it would be a palate cleanser from the too salty food but even that had salt!  I couldn't believe it - they sprinkled salt on top!!  For the wine lovers, note that they store their wines on a wall out in the open with accent lighting behind them.  I hope they go through the bottles quickly.  The exposure to heat and temperature fluctuation is not good.   On the plus side, they finally got their act together and you can now book a table via OpenTable instead of standing in line.  There aren't many tables so highly recommend making a reservation.  With so many other wonderful restaurants in SF, I don't think I'll come back.", 
    "review_date": "2014-07-17"
  }, 
  "Yi5JKaD1VY4Edeww92PZWA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Regina L.", 
    "review_text": "The new Tosca is amazing, and by far the best food/drink spot in North Beach. We went on a Tuesday night and it was really busy. The wait for a dinner table was around an hour, so we put our name down and took a seat at the bar. The staff was very friendly and made some delicious cocktails. My favorite drink is the Polo Cup (with gin), followed closely by the Cap Haitian Apple Toddy and the Bennet. While at the bar we ordered the marinated olives, the fennel salad, and the moscardini (octopus salad). The octopus was incredible, as was the fennel. Everything was done to perfection and tasted like food you would get in Italy. Once we were sat at a table, we ordered the two specials, a meatball dish and a crab salad. The crab was super fresh and the dressing was a crab-ceasar dressing. The meatballs were made of three types of meat and were extremely tasty. For the entree we split the bucatini and I was blown away by how good it was. I usually don't order pasta at restaurants, but this pasta was perfectly al dente with a rich tomato sauce.   It was an overall perfect meal. The decor is warm and inviting; a mixture of the new and the old. I love this place and I can't wait to go back.", 
    "review_date": "2013-12-02"
  }, 
  "IJUoKDLuxj8_2yXuYdzEBA": {
    "user_rating": 2.0, 
    "user_location": "Seattle, WA", 
    "user_name": "ELIN B.", 
    "review_text": "Ok. I don't review but I eat out all the time. I think this is my new thing . I have been told yelp is very fickle so I hope this makes it. Tosca has kept it charms...juke box is still the same (thank you). Drinks good . Here is where I have my problem...order your whole order at once . I get pacing but give me a break. Orders will only be taken once you have come to a consensus?? Orders came and it was for the table next to us. Nice pacing. Total salt lick once the food arrived.", 
    "review_date": "2014-05-31"
  }, 
  "4Y81J2Tdq5XAnkeYmCZ2ow": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nique F.", 
    "review_text": "I half expected a celebrity spotting at the newly face-lifted Tosca, with it's Rat Pack grandeur still peeking through the new polish. My friend tells a story of the time he watched a fancy car pull up right in front of Tosca, moved the orange parking cones out of the way, and claimed the restricted zone as his parking spot. The rockstar parking suddenly made sense when Huey Lewis stepped out and waltzed into Tosca.   Fast forward to 2013...only rowdy, cocktail-sloshing businessmen lined the bar on this chilly December night. The atmosphere is very North Beach: tightly-packed, with that European brand of unusual weekday vivacity. The narrow front half of the space is all bar, the back half is a small dining room with leather booths and a few casual dining tables. As we squeezed our way to the hostess stand, we passed the charcuterie station where hunks of cured meat were being sliced paper thin. Little bowls of olives, octopus, peppers, and fresh foccacia beckoned a bar snack. I never knew the old Tosca, but I was feeling optimistic about the new one.  We were able to get a table for 6 with no reservation on a Wednesday night. From there, we sampled the drink &amp; antipasti menu. The wines by the glass are limited and pricey - most reds are $12-13, so you might as well try a cocktail. Their signature is the \"House Cappucino\" (Armagnac, Bourbon, Chocolate Ganache, Organic Milk). Tempting, but you've got to be in the right mood.   The antipasti menu is great for bar snacking with things like: Giardiniera (pickled peppers), Moscardini (grilled octopus), and Roasted Treviso (roasted romaine with pine-nuts). From the dining room, you can see the open kitchen where the main courses come out: fancy incarnations of pasta &amp; polenta, Italian meat dishes, and classic desserts. Starters are $9-16, Secondi entrees $15-17, and Mains $29-42. Basically, a drink and a snack will run you about $25.   Service was fine -- not overly friendly, as you might (unfortunately) expect in a posh new spot. The food was creative &amp; comforting, and the ambiance is sleek &amp; lively. Overall, Tosca has retained the simplicity of an Italian taverna with the panache of a modern SF dining destination. If you're curious, it's worth a taste!", 
    "review_date": "2013-12-13"
  }, 
  "reQcVFgEEFdFmFrFycMHXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "nick g.", 
    "review_text": "I had been before for the drinks (fantastic cocktails. And the only place I know of in sf that has all 5 ages of pappy van winkle). Last night I went for dinner and everything was terrific. Sat our group of 5 within 15 minutes. Great food and service. Highly recommended.", 
    "review_date": "2014-05-25"
  }, 
  "5YlCQ3EfFBb9NWZbUPScDA": {
    "user_rating": 2.0, 
    "user_location": "La Cañada Flintridge, CA", 
    "user_name": "Andrew K.", 
    "review_text": "This place really deserves one star, but the bartender was so good, they get two stars.    We sat down to eat at the bar since the dining area was waiting for reservation parties to arrive.  After ordering a drink each and some dinner,  I was asked for my credit card.  Really?  You claim to be an upscale place?  WTF?  I felt like I had just ordered at In N Out and pay before I put a morsel of food in my mouth.  I was somewhat steaming, so I spoke to the manager and he politely said it was the restaurant's policy.  I should have paid for the drinks right then and there and left!  The food arrived (chicken for two) and it was good, but a bit salty as others have claimed.  The meatball appetizer was small (three little meatballs), but flavorful.  I was so irked over the pay before you eat, I couldn't really dig this place.  And..when I got back to L.A., I stopped at Sprout's and picked up a rotisserie chicken which was actually better than the $42 chicken from Tosca.  Oh well, will not return to Tosca.  Far too many great places in SF to waste another meal at Tosca.", 
    "review_date": "2014-12-23"
  }, 
  "sU_VYz_7W5zVGLbIn-hfGA": {
    "user_rating": 5.0, 
    "user_location": "Fishers, IN", 
    "user_name": "Chrissy M.", 
    "review_text": "We had a phenomenal  night at Tosca!  Sat at the bar and shared the bar panini, which was delicious.  Chad was  awesome -- Each drink we had was perfection!", 
    "review_date": "2014-11-26"
  }, 
  "a-G-LUBYtZkMMnntRn26AA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sf k.", 
    "review_text": "Not sure if this new and improved version of Tosca is a diner/bar or bar/restaurant...  I arrived at 7:15  PM on Saturday, April 5, to join friends at the bar before having dinner. We were seated at a booth shortly afterwards.  The waiter tried unsuccessfully to announce the specials to us, twice,  but the noise plus the loud music playing in the background made it impossible to hear the specials. Instead, we decided to focus on the menu, and after a brief review of the limited menu choices and the above average prices, by mutual agreement, we left and went elsewhere in North Beach.  BTW: At the bar we noted that one of the bartenders was clearly under the influence, and openly knocked back a shot glass of something other than H20. Not sure if drinking on the job is tolerated, but there was no attempt to be discrete about it.  Otherwise, the new Tosca looks a lot better than the original but is clearly designed to attract the under-30 demographic.", 
    "review_date": "2014-04-06"
  }, 
  "WzpS9g-sbaXfEqoaYLgPfw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Helen D.", 
    "review_text": "SUCH. A. LONG. WAIT.  I'm annoyed just thinking about the wait itself. The food itself is good - which is why I felt like yelling at them \"GET YOUR ACT TOGETHER - THIS COULD BE AMAZING\". After having waited for 1hr40mins (not my choice, a friend really really wanted to try this place) we were told that a table was being set, but we'd have to wait another 10 minutes because they were \"trying to pace the kitchen\". Really? At least let us sit down and liquor up!  They have an item on the menu (chicken for 2) which says \"please allow us 1 hour to prepare\". We thought OK (even though we've already been waiting for an hour and 40 minutes), we'll order lots of appetizers and pastas, etc. and at the end, the chicken will come out and will be amazing. 2 hours after we had been seated - there was no sign of any chicken. We had to check in again to make sure it was coming. When it did come out - it was truly divine. So moist. So flavorful.   Overall - I would never ever return again. Because the wait makes it such a negative experience (as evidenced by the really low star average on yelp). But it's unfortunate - because the food is tasty!", 
    "review_date": "2014-02-01"
  }, 
  "WcSUyRH_EzUfqKua1m93DA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelsea A.", 
    "review_text": "I fell in love with this place the moment I walked in. The fact that is so classy and old school make you happy. Sometimes you forget about these things when you visit all these hip new restaurants in SF.  Anyways, the food, drinks and service were impeccable. Started with the Giardiniera (Pickled Veg) and the Point Reyes Blue Salad (so rich a delicious). Great starter combo I might ad. For the meal, I had the Bucatini (pasta cooked perfectly, great flavors), the meatballs (had to order with pasta - delicious) and the roasted cauliflower (YOU HAVE TO ORDER, DON'T LEAVE WITHOUT IT!) Last but not least you have to order the tiramisu. The orange zest completes it.   During dinner I left the wine choices up to the server, which was a great idea. He knew a great deal of information and selected wines that went perfectly with each dish.   I left satisfied, fat and full. I'll be back without a doubt. This time Sean Penn better be there!", 
    "review_date": "2013-12-12"
  }, 
  "FI0dcCAuFmW0lutdKO2UwA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle K.", 
    "review_text": "great bar", 
    "review_date": "2014-06-11"
  }, 
  "IDy0O2yiKuIPTrTuxwi6Xg": {
    "user_rating": 1.0, 
    "user_location": "Thousand Oaks, CA", 
    "user_name": "Laura H.", 
    "review_text": "One of my favorite places to visit while in town. But this time was very disappointed. Waited 25 minutes to be acknowledged. Came in for their famous House Cap. About 30 minutes later was brought just a regular coffee.  Had to wait an additional 20 minutes after finding someone who would help us get it right. Such a let down. Had to track down he server to pay our bill. Probably won't be back unfortunately.", 
    "review_date": "2013-10-19"
  }, 
  "Z5JJ1e95WSo8Bsw_zvl8HQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt H.", 
    "review_text": "Ok the PR Machine that is the hallmark signature of new ownership has worn off and the reality is that Bono is not serving me drinks, Sean Penn is not bussing tables and Robin Williams is nowhere to be seen. All that is left is the reality that this washed out place is still washed out, now just expensive and run by a bunch a NYC dickheads. Skip it and go to Delfina for some quality SF Italian!", 
    "review_date": "2013-10-25"
  }, 
  "eVy48PkO4CPqYwV5JMDZgQ": {
    "user_rating": 3.0, 
    "user_location": "Paso Robles, CA", 
    "user_name": "John C.", 
    "review_text": "Had dinner on a Sunday in July.  The roast chicken was not on the menu.  Was very disappointed. All other items ordered tasted great.  $50 corkage for 2 bottles of wine we brought (one in our party is in the industry) and the server never poured a drop after the first pour.  I am guessing the chicken dish was not on the menu due to the Sunday family style supper being served that evening.  That was not suggested to our party when the server was going over the menu and taking our order.  Cool space, good food.  I would return on a night the chicken was back on the menu.", 
    "review_date": "2014-07-15"
  }, 
  "_q6XWUZYnoaqc9kYClxg_w": {
    "user_rating": 5.0, 
    "user_location": "Sunnyside, NY", 
    "user_name": "Amanda H.", 
    "review_text": "Tosca, was amazing. The food was A.Maze.Ing. The drinks were delicious. Love the renovations. It is a must spot in San Fran.", 
    "review_date": "2013-11-12"
  }, 
  "L4EiRoOH6cxPjiCUXxOcHQ": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Byron C.", 
    "review_text": "Thanks for agreeing with me Anna Roth at <a href=\"/redir?url=http%3A%2F%2FEater.com&amp;s=6b7910e6176ff9166277ef50a29af7da7b3dc698a133787bbaca8190e3495784\" rel=\"nofollow\" target=\"_blank\">Eater.com</a>. (do our reviews sound similar?)  <a href=\"/redir?url=http%3A%2F%2Fwww.sfweekly.com%2F2013-11-20%2Frestaurants%2Ftosca-cafe-april-bloomfield-ken-friedman-north-beach%2F&amp;s=9542ff7dfa7fa2f486d862813eb69b4834d4633e19db688bcf632ff8f0b5b0d6\" rel=\"nofollow\" target=\"_blank\">sfweekly.com/2013-11-20/…</a>", 
    "review_date": "2014-05-01"
  }, 
  "w0ge5Edx6eouuNQuyOvuuA": {
    "user_rating": 5.0, 
    "user_location": "Tuolumne, CA", 
    "user_name": "C. H.", 
    "review_text": "The drinks and food here is some of the best you will ever have.   This place knows how to treat it's customers.  Exceptional customer service and exceptional food.  What more is there?  Quality through and through.", 
    "review_date": "2013-10-11"
  }, 
  "hLC4Iu-hjFiZMx4c7Bqrfg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katherine J.", 
    "review_text": "I really wanted to like this place. After watching season 2 of Mind of a Chef on Netflix, we were so excited to try Tosca since it was featured on the show. I knew immediately we would order the meatballs made with guanciale, and the fried pig tails. We also had the turnips, the fried potatoes, the minestrone, the oxtail terrine, and the bucatini pasta. In the end, I could summarize my entire meal here in three words... TOO MUCH SALT. There was a consensus at our table and maybe even the one next to us. The flavors were there, and it breaks my heart because there was so much potential. Unfortunately, the salt rendered the food nearly inedible. Our table went through at least 5 or 6 pitchers of water to wash everything down. We most likely would not return. I gave 2 stars because the ambiance was decent, and the food was prepared well were it not for the salt. I also enjoyed the Tiramisu, if only because it was the one item that gave us reprieve from the salinity of the other dishes.", 
    "review_date": "2014-08-04"
  }, 
  "RwcoySTqRsFXN6wUDUmkEA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ana G.", 
    "review_text": "After hearing that Tosca made Bon Appétit's top 50, we immediately booked a reservation. Having been to the excellent Spotted Pig and John Dory in NYC, we expected greatness. Too bad Tosca fell so short of our expectations. The restaurant's decor is charming and comfortable. They did a great job of maintaining it's original vintage feel without resorting to clichéd reclaimed wood and filament bulbs. The service was slow and amateurish. The waiter presented the wine to my husband to taste even though I had been the one to order it. There were a couple of interesting tuna appetizers on the menu. The egg tonnato was very good, the egg making a natural pairing with tonnato sauce. It was a great alternative to the traditional veal recipe.  The tuna conserva with radishes on the other hand lacked brightness that should have counterbalanced the heavy oiliness of the tuna and the creaminess of the crème fraîche. The crispy pig tails, while cooked perfectly and full of flavor, were over-salted as were the crispy potatoes many of which were fried to death. The turnips were so very average. There weren't many enticing secondi choices. We settled on the hangar steak because we wanted a meat dish and didn't want to wait one hour for the chicken. Had we known the service would be so slow we might have ordered it. The hangar steak was tasty if uninventive. Not all the dishes were uninspired. The bucatini with guanciale and chile was undeniably the star dish of the evening. We should have foregone all the other dishes and just ordered 6 of those instead.", 
    "review_date": "2014-08-24"
  }, 
  "617f0bJTMgwuukhbRpHfAw": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Eric A.", 
    "review_text": "We walked into this place totally by accident. We live in nyc and are here on vacation. It looked pretty from outside so we decided to give it a try. WHAT A PLEASANT SURPRISE!!! It was totally Amazing. Try the meatballs I just ate an entire plate and can eat like 10 more. Even the water was perfect. Jordan our server was extremely kind and knowledgeable. DO NOT MISS THIS PLACE.", 
    "review_date": "2014-12-31"
  }, 
  "qdyC4LWk_TvoSgpM-P1M0g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marios B.", 
    "review_text": "I gave this place 6 or 7 tries...Awful experience.. This is a place you really feel unwelcome. The service sucks (the host is constantly pissed off and the same goes for the bartenders ). The food is so salty that you might need to check your blood pressure afterwards..I wish it was like Spotted Pig or  Breslin...", 
    "review_date": "2014-06-10"
  }, 
  "pmV8yMwGZzva2uCFwV-8sw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kathryn M.", 
    "review_text": "Wonderful date spot, nice ambiance with dim lighting, delicious small plates to share and the cappuccino---delightful.", 
    "review_date": "2014-03-22"
  }, 
  "-MyLPrB9K4d4XWRLE9KlMw": {
    "user_rating": 4.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "L M.", 
    "review_text": "Had an early dinner here with friends before seeing a show.  I love the atmosphere here - the booths tucked into the walls, the lighting, decor, etc.  I like looking into the open kitchen &amp; watching dishes get plated up before being sent out.  This was probably my favorite dinner during a recent trip to San Francisco.  The caesar salad was very good - the waiter said he loved the presentation of it &amp; felt it wasn't your typical caeser.  It had a nice hit of heat to it.  It was a bit filling &amp; I might have considered splitting it with a friend after I ate the whole thing &amp; was close to full.  The next dish was the lumaconi with prosciutto &amp; lemon breadcrumbs.  Um, OMG that was delicious!  I don't usually love to order anything with cream sauce b/c it's just too heavy for me....but this was a very light cream sauce &amp; not excessive.  I just wish I had not eaten so much of my salad b/c I just couldn't finish my pasta.  The cocktails were also outstanding - I had the whiskey smash &amp; enjoyed it. Loved the music playing on the jukebox.  My only knocks on the place are (1) the service - I thought it was just ok.  The waiter was not really very attentive, empty plates sat in need of clearing, another cocktail was not offered.  Yet I saw a lot of waiters just kind of hanging around in the corners of the restaurant.  (2) The bathroom - I get that this place is a former dive bar that hosted celebrities &amp; has a long history - but today I'm at a nice restaurant &amp; while your bathroom might be considered kitschy, it's old &amp; a bit on the gross side.", 
    "review_date": "2014-11-06"
  }, 
  "ds_k6_mJ3Oi7BiSN4iQU-Q": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Esse Z.", 
    "review_text": "Horrible service. Clueless hostess, absent waitress. However only reason in business is good food.  This year, we've been to SF several times and to NYC, Chicago, Philadelphia, New Orleans, Denver, LA, Phoenix, and Portland. Michelin-starred restaurants and hole-in-the-walls.  On this trip to SF, we ate at Tadich, La Folie, Akiko's,     Quince, and Mission Chinese.  Mission Chinese was awesome, even with service by one waiter at lunch for the entire dining room.  Tosca was the absolute worst for service.  No food is worth that experience at this kind of restaurant.", 
    "review_date": "2014-10-04"
  }, 
  "Z33ENXec3_VJRlymaDmQIw": {
    "user_rating": 5.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Happy C.", 
    "review_text": "Given that most places in SF roll up the sidewalk before 10pm, it is really nice to have a restaurant where you can swing by at 1030 and have a high quality meal in a vibrant but relaxed atmosphere.  Top notch service and food (pasta w mussels), with interesting cocktails.", 
    "review_date": "2015-01-15"
  }, 
  "wb3Tip9jwYT-1f73cvSyIQ": {
    "user_rating": 5.0, 
    "user_location": "Leesburg, VA", 
    "user_name": "PETER S.", 
    "review_text": "Was seated as soon as we walked in the door! The dining room is small and allows for personal service.  The food was delicious.  Would definitely recommend Tosca for any special event.", 
    "review_date": "2014-11-11"
  }, 
  "NGDgP4nAoAFbCNzwtlo1IA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rick E.", 
    "review_text": "The mussels were fishy and rubbery, had to turn it in, got the pesto pasta it was awful too.", 
    "review_date": "2014-12-22"
  }, 
  "gOEp68WaNgv1FqWT6TAXtg": {
    "user_rating": 5.0, 
    "user_location": "Cambridge, MA", 
    "user_name": "Jeremy G.", 
    "review_text": "I'm obsessed with this place. Remains my very favorite restaurant in SF. I used to love THE SPOTTED PIG in nyc and this place brings the hustle of a nyc kitchen to an otherwise gastronomically impoverished neighborhood. The focaccia is crispy -- so good! And the salumi platter is great. Don't miss the Cacio e Pepe, really well executed. Great cocktails too!", 
    "review_date": "2014-10-12"
  }, 
  "5-ngN0yVVNno60X5t_QOPw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Boriqua H.", 
    "review_text": "They somehow kept the charm but managed to strip the soul of this place. Maybe it's the clientele.  Maybe it's because they got rid of the old timers who used to run the bar.  Maybe it's because the tank of a coffee machine sits dark in the corner now (most likely because they got rid of the people who had mastered that piece of machinery). Maybe it's because I paid $30 for two drinks when I FINALLY got attention from the bartender. There used to be something otherworldly about this place. Like stepping back in time. Now it just feels like every other overpriced yuppie bar in San Francisco. What a shame.", 
    "review_date": "2014-02-15"
  }, 
  "-g3XIcCb2b-BD0QBCcq2Sw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa I.", 
    "review_text": "This review is only for the drinks, and let me tell you, these cocktails are AMAZING. I started off with a Diamond Spritz Fizz, and it was DELISH. Especially when it was a warm, lazy Friday and nothing caps off a rough work week like an amazing cocktail. I was about to order another one when I saw that my co-workers had moved onto the Polo Cup, which came garnished with a beautifully sliced cucumber. Other drinks that were ordered were Oaxacan Firing Squad (warning for males, this drink has manly ingredients, but is served up as bright pink), the Trouble in Paradise, and a few people tried their hand at the Dealer's Choice.  Overall, I thought the drinks here were truly outstanding, and would definitely come back here.", 
    "review_date": "2014-05-22"
  }, 
  "Ow_oHwqaBBRuUAiNrL8rRw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susie S.", 
    "review_text": "Went back to the new reopened Tosca's . Same look, they did clean the Pictures on the wall and they actually have a menu.  Full bar, however when we ordered a Cap Cod, bartender didn't know what it was , once told they didn't have cranberry juice? Didn't eat there. The menu was not my cup of tea. Chicken Liver,Pork Sausage, prosciutto, Grilled Lamb. Average range of entree $13.00. I had $13.00 glass of Red Wine, and went on my way.  The look of the food , looked good and probably was, so I can't really judge it, since i didn't taste it.  So if going for nostalgia, it's still there, but the crowd has changed with the prices. Oh yes and if wanting to eat, over an hour wait or you can eat at the bar, which is not very comfy and a tight squeeze.", 
    "review_date": "2014-02-13"
  }, 
  "Ve0LUwcrzxL7w0RYgY4Aaw": {
    "user_rating": 4.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Katy H.", 
    "review_text": "Cute little spot for a date or drinks/dinner with friends. Tonight I rolled through with 6 friends and though it's a Sunday night it was pretty packed around 9pm. Fortunately we were able to nab a recently vacated booth and enjoy a round of drinks.  The music ranged from Tom Petty and Bob Dylan to some current top 40. Definitely a great hangout for someone in their mid 20s-30s. Was too full from dinner elsewhere to try the food but many items jumped out at me.   At the top of the cocktail menu they feature a a signature drink called a Tosca Cappuccino that's definitely worth trying! I was tempted to try other drinks as well because the menu had a lot of interesting options, but going on the advice of a friend on a chilly winter night I couldn't resist tasting this 'adult hot chocolate.' Made with Marie Duffau Bas Armagnac, Buffalo Trace Bourbon, Dandelion Chocolate Ganache, and Milk, it's obvious why this is the house specialty cocktail. In fact, I'd come back just for that!  The lights are a little dim, the fixtures are clean but dated in a cool way, and hanging out there I definitely felt like I was out and about in a unique to SF spot. Just what I need when I'm visiting from out of town!", 
    "review_date": "2013-12-02"
  }, 
  "E5vMbJUjOxjr4AZ8y66trw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "howdy d.", 
    "review_text": "Tosca should have just closed, at least there would have been great memories and a reputation intact.  This new incarnation is just a steaming pile of douchery.  there is a certain type of person currently proliferating in the city who's hallmark characteristic is the desire to be fleeced like a lemming of their extravagant wages.  they will flock here and they will not leave disappointed.  small overpriced portions of mediocre fare coupled with lackadaisical service.  no thanks.", 
    "review_date": "2013-10-27"
  }, 
  "Sebeg4n6GwfjmlQO_qGADA": {
    "user_rating": 5.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Paul L.", 
    "review_text": "First restaurant review on yelp, because I am still processing how awesome our dinner last night was.   Every dish was mindblowing, from the meatballs to the chicken to the potatoes (yes, mindblowing potatoes, believe me). I've eaten at 20+ of Eater SF's top 38 in the last year and Tosca is the best dinner I've had in SF, in terms of food and service, without question.   Our first dishes were a little bit slow coming out (though we had wine on the table and none of us had noticed), so the staff went way above and beyond, bringing us multiple free appies AND a free extra bottle of the wine we were drinking. I wouldn't expect this again, but they really impressed us with how attentive they were.  Go, you won't be disappointed.", 
    "review_date": "2015-01-12"
  }, 
  "rLWW2l6oXyHrzv3TrbuBHg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Full W.", 
    "review_text": "I have been visiting Tosca since the 90s! I drank tequila with our former mayor Willie Brown there. It is under new mgmt but it has not evolved. I am not an expert/foodie but I know good food. This is NOT it! Salt, salt and more salt. Let me break it down for you. If you want pasta, go to Tomassos. If you want a Pimms cup, go to Romolo. If you want to settle for mediocrity, go to the new Tosca. Just sayin", 
    "review_date": "2014-10-02"
  }, 
  "aD-rsDe2S0e7jTkYD6ULaQ": {
    "user_rating": 4.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Eve K.", 
    "review_text": "Solid late night eats at an old school SF spot. 4.25 stars  Food: 4.5, Service: 3.5, Atmosphere 4 Cost to worth it rating: 3.5 (pastas ~$17, sides ~$8) Return worthiness: yes Eve award: best sit down SF late night meal  Highlights: - Special hot cocoa (aka house cappuccino: bourbon, chocolate ganache, etc how can you go wrong especially on a rainy night???  - Italian wedding soup: delicious, light, and topped with lots of Parmesan - Pastas: forget if we got the gemelli or bucatini but pasta was fresh and delicious - Crispy potatoes: tasty salty crunchy filling side - Late night meal: had a reservation at 12:30am on a Saturday night which was awesome  Lowlights:  - Waiter misheard us order a dish and fought us on it. Manager came over and was cool about it  Had a fun 2nd dinner and would return for more eats and that coffee.", 
    "review_date": "2014-12-09"
  }, 
  "iCr1Js7S3QIrNirF0_R1Aw": {
    "user_rating": 4.0, 
    "user_location": "Belvedere Tiburon, CA", 
    "user_name": "Martin W.", 
    "review_text": "Took the family for dinner last night.  Good service, booth was a little small but was fine for us.  The food was excellent.  Adults loved the pig tails, kids not so much (too fatty).  Oxtail terrine was a hit and we LOVED the meatballs and foccacia.  Pastas were great and we really enjoyed the tiramisu and strawberry balsamic gelati.  Would definitely go back with friends, co-workers and or family.  Nice eclectic mix of patrons.", 
    "review_date": "2014-09-01"
  }, 
  "zCGGWSR7-klRlPPeZ9BT1A": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Bob W.", 
    "review_text": "3 of us got there around 6pm (empty) on Wenesday 10/30/13 had a bottle of 2009 Antonotti 'PRAMARTEL', Bramaterra..$42, well made with that unmistakable \"tarry\"Italian underpinning,1 Manhattan ,1 \"Bennet\",$12 ea, a focaccia great $4, pig tails $9, 4 small crispy unctuous chunks, fried fresh artichoke hearts $9; 3 small meatballs $12!!! and not worth it, too rich, not seasoned assertively enough for me (bet they die) 5 or 6 chicken liver spiedini $7..arguably the best thing we tasted as well as the most reasonable  yum! The $42 giant roasted 1/2 chicken with the foot that i chomped up(3 1/2 lb.) on levain schmeared with ricotta and delicious chicken juices very tasty and moist. broccoli  $9!!! ok, potatoes$7 crispy yummy, and cauliflower $8!!! mushy feh..about $190 without tip. we thought they had comped our wine because one of our party knew &amp; had talked to a staff person before we ate. mistake!! after we paid our bill the waiter guy. apologizing profusely, brought us a bill for the wine..oh well     go there for the chicken livers and the chicken and it's kinda worth it BOYCOTT THE MEATBALLS RIDICULOUS!  started off fairly quiet but by the time we left it was packed &amp; very noisy. hard to hear across the table.  service so so", 
    "review_date": "2013-11-01"
  }, 
  "AJOCN_19rxCBXSVq_EnsHQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "emily b.", 
    "review_text": "Completely overrated - and a real shame it made Bon Apps list when there are actual amazing and worthy restaurants on the list (e.g., Estela in NYC).   The bar line is insane - and the service is sub-par. It's also so narrow that you should expect to get elbowed every 5 seconds, especially if you're a girl wearing a purse.", 
    "review_date": "2014-10-08"
  }, 
  "NHKJowBM-8mY2Iegfc87pQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Albertino M.", 
    "review_text": "Time: 9:23pm/54°F cloudy  Purpose: After watching the CNY's parade walking Kearney street about to head back to car in local garage. Saw Tosca pretty hip and busy thinking why not.  Ambiance: From the outside looks modern after complete make over the bar area was fill. People smiling picking up food taking a sip here and there. Noise level was pretty darn close to not hearing each other may need hand gestures. Front to back looks good enough for anyone who walks in without RSVP.   Staff: This is were I had a problem with the bouncer guy. I stood there looking in trying to get pass him while he was flirting with the ladies. I know all too well with situations like this were you want to impress and hope you can get in their pants after. The guy was light skin black shave head with a suit and tie, walks and act like he owns the place. Shit being a local and have roots in little Italy as well as Chinatown I know most of the owners that operates in the area. He was piss that I try to walk past him without acknowledging him. For what? Your attention was turn towards to three ladies hehe haha there and here I didn't want to bother you. Don't try to talk to me in front of the ladies for showing off or might be an (ADD) aka attention deficit disorder.  Cleanliness: It's clean all around step in there for about 30 seconds til he pulls me back out.  Eats/Drinks: Didn't get a chance to eat or drink due to bouncer who wants to show who's boss.  Punch Line: Hip,vibrant,for the 35+ crowd,clean concept,nicely remodel,a little dim,hard to park after 6pm,located on a busy streets,lots of foot traffic during weekends,Hustler Club next door,lusty ladies gone,great picture of Transamerica building.  Final Thoughts: You see what happens when your role as a bouncer does to a person. It fucks up their mentality so they want to really show that they're are better than a door person. I don't see it that way, it's like security guards with badges trying to act like police. Remember now you maybe somebody there many look up to. When you finish your shift and clock out you're a regular average joe, don't think highly about yourself.", 
    "review_date": "2014-02-20"
  }, 
  "uBgxqn5PTyfyApOQyjyUtw": {
    "user_rating": 5.0, 
    "user_location": "Herndon, VA", 
    "user_name": "Pratibha G.", 
    "review_text": "The mussels. Get the mussels. We refused to let the broth be taken away and ordered some focaccia to soak it all up. Oh. And the trouble in paradise...because who isn't a fan of that?", 
    "review_date": "2014-10-17"
  }, 
  "mhwcWLDpNXnKe568lQR9oA": {
    "user_rating": 1.0, 
    "user_location": "Sonoma, CA", 
    "user_name": "Robert E.", 
    "review_text": "Can you say rip off... $14.00 for an Irish Coffee and then the bartender asks if you would like to by a wine while you wait.  No more White Nuns which is the drink that Made Tosca famous, something about Kahlua being politically incorrect.  Please bring back the old Tosca!  Avoid!", 
    "review_date": "2013-11-18"
  }, 
  "ckO3UlBjpUtw_R62Hf89pw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "joshua m.", 
    "review_text": "Everything at Tosca is fantastic - food, drinks, decor.  We've been 3 times since it reopened, both for dinner and for drinks/snacks and the food is delicious and the cocktails are amazing.  We ordered the mazzafegati not even really knowing what it was, lo and behold it was the most decadent and rich sausage i've ever had, just spectacular.  i'm not really a squid person, but i've ordered it every time because it is so good.  the shallots in the salad too, i would eat those as a standalone dish.  the meatballs of course.  some friends could not stop talking about the artichokes and beets.  on the drink side, i never see cocktails based in armagnac, so i clearly had to try the zamboanga, and it did not disappoint.  just a great drink.  i could not leave without trying the house cappuccino, and like everything else, i found it highly enjoyable.  nicely done all around, we had high expectations and it did not disappoint.", 
    "review_date": "2013-10-23"
  }, 
  "t9ukoFO4EorEg5ZEXv_oCg": {
    "user_rating": 5.0, 
    "user_location": "Orlando, FL", 
    "user_name": "Ashley W.", 
    "review_text": "Unbelievable food. Jovial and warm environment. We had the roast chicken for two and it was easily one of the best things we've ever had. Incredible sauce, juicy and crispy--worth the wait!", 
    "review_date": "2014-11-13"
  }, 
  "epgLFdVaL--qAXyRJDs1XQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate N.", 
    "review_text": "After hearing/reading so many rave reviews about Tosca and the highly acclaimed new ownership, we had high expectations. Even some of my friends in NY were talking about this restaurant. There were a few good points but overall I'd say it was fairly average. I loved the atmosphere in the bar and the restaurant. It had a classy and fun vibe and lots of energy there. The dining area seemed small which I liked and I also liked the open view into the kitchen.  The service was above average. We had a lot of questions about the menu items since some of them are a bit different and our server was more than willing to help out. We stuck with beer and wine for alcohol. The wine list seemed a bit limited but I was able to find something satisfactory.  The food was hit and miss. It started out great, we started with the pickled veggies, a market salad, and the oxtail terrine. All three were above average. The best thing we had all night was the pasta dish. I forget what it was called but it had a lemon flavor and some toasted breadcrumbs. Very tasty. We ordered the lamb ribs and a nightly special veggie of turnips. These were  a letdown and a big miss. The problem was that the piece of meat was sooooo fatty. I'm not talking a little added flavor, it was almost inedible. The veggies were tasty but soaked in oil.  This seemed to be a bit of a common theme for all of the food. It was all too heavy/creamy/buttery/oily. You can serve heavier food without going overboard, but Tosca wasn't successful in doing this. I may go back for a drink at the bar or maybe try to order some different things, but I'd stay away from the lamb ribs or any veggies soaked in oil.", 
    "review_date": "2014-02-01"
  }, 
  "XIR1_GVjl2M2P9uit2kxpA": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Miriam W.", 
    "review_text": "Pastas are amazeballs. They prefer that you order everything up front but will check on you later to see if you need anything. Tea is served in the same glasses as water (small lowball.) Lamb rib was pretty fatty but was good; turnips were oily and tangled, but asparagus was pretty good . Loved the cheese on top. Meatball appetizer was delicious.   Menu is a bit ... pompous and overthought; if it takes you 3 more esoteric food vocab words to explain one of the already esoteric food vocab words on the menu (aka, no one can really read your menu unless they are a chef at your level or a foodie who is heavily invested in speaking your chef language) ... you might want to rethink approachability.  Prices reasonable. Bathroom is clean, well-sized.", 
    "review_date": "2014-04-30"
  }, 
  "9AiwWbBKf040lti41-v9SA": {
    "user_rating": 1.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Steve K.", 
    "review_text": "We made a reservation 2 weeks in advance based on good reviews and hype.  Our reservation was for 5:15 PM, which we were told was the only available other than 11PM.  Despite how difficult the restaurant said it was to get in, we noticed many empty tables throughout our entire dinner.   The atmosphere was nice and the wine was good, but the food was so salty that it was nearly inedible.  We were \"awarded\" a complimentary dessert and coffee, which were, at least, not salty.    In sum, unless you are a camel searching for a mineral lick, don't eat at Tosca Cafe.", 
    "review_date": "2014-10-31"
  }, 
  "Sem3wD90eSvZ1K9GAKudMA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J K.", 
    "review_text": "I was excited to come to Tosca's for a meal after reading all the rave reviews. Sadly, I was disappointed with the food. I thought all the dishes were too salty and simply not very good. Our waiter was pretty good though.", 
    "review_date": "2014-12-24"
  }, 
  "SdSFFy6GzpP7QZfT_HeDAw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ralph A.", 
    "review_text": "A big disappointment.   First the loud music, not just loud but unmelodic and annoying.  Then the food, so overly spiced for every item ordered, and far from memorable.  Finally, a server mistake on a split salad resulted in our having to order an extra salad.  It appeared on the bill, with not even an acknowledgement or a gesture.   Too bad, because the waiters and the manager  were competent efficient and friendly, but the whole experience said loudly, I will not be back.", 
    "review_date": "2014-12-24"
  }, 
  "7zFA3EeZpSns6yLD1RClfQ": {
    "user_rating": 1.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Grant H.", 
    "review_text": "It had been a long family tradition to go to Tosca for a house cappuccino after a night on the town in San Francisco. We are from the valley and were anxious to try the new Tosca. First of all, the service was poor as we had to wait about five minutes to get service at the bar. It then took another five minutes to make our house cappucinos. I watched the woman in the white jacket make the drinks and use a measuring shot glass  (never a good sign !). The drinks came, tasted good but not as hot as I would have liked. When the bill came for $26.75 for the two drinks I realized that there must have been a mistake...hey, it happens.  Nope, no mistake; $12 for each drink, tax and, get this, a fee for using my credit card ! As it was not the bartenders fault for the rape, I left a tip - $30+ total ! Talk about getting \"blanked\" and not getting kissed ! Needless to say we won't be going back to this \"new\" San Francisco clip joint. The New Tosca will suffer for repeat business. Sort of like the touristy wax museum that kids beg their parents to go to; go once and never go back.  Tosca is done folks, the show is over.  I agree that Tosca should have folded the tent. Very sad. Keep your money in your wallet and head on down to the Buena Vista for an Irish Coffee for that hot after dinner drink!", 
    "review_date": "2013-11-15"
  }, 
  "Gh-g5zvP4i6tQKrMJZzfCw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "holly B.", 
    "review_text": "Perhaps my expectations were too high. Was really happy that they started taking reservations tho. My friends and I had wanted to come here for awhile. Checked in at the host stand for an early res (5:15) and was told they would come and get us when it was time. Sat at the bar and ordered a very delicious cocktail - so far so good. It was past our res time by about 10 minutes and no one came to get us so we went back to the host stand and were seated in a nice rounded booth. Service was nice - I don't know why others are so critical.   The food is where the disappointment came for me. Had the pig tail app - delicious! Had meatballs - very good. Cesar salad - overdressed for me. I ordered the gemelli, done in the cacio a pepe style and it wasn't made correctly - very grainy with cheese instead of smooth. This is a dish I have had elsewhere better. The rigatoni was very good and the bucatini was tasty but the noodles were quite thin - bucatini should be thicker and chewier. hmmmm. Foccacia is delish and we had some broccoli that I didn't try and the potatoes.....too much food. Potatoes were a bit too salty for me.  Way too full for dessert but nothing on the menu seemed that inspiring anyway.   Glad I went but don't really need to go back. I find it interesting that this received such a glowing and high review in publications. Maybe when the chef/owner is there it's better but I don't get the idea she is there often. Maybe it was the chef de cuisines night off. Anyway.", 
    "review_date": "2014-10-27"
  }, 
  "O_kWf3jO95lqRWV0ZYE7dA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Megan P.", 
    "review_text": "Had dinner late Sunday night, it was so good.  Portion sizes were perfect and hands down one of the best caesar salads I've had since moving to the city.  Definitely would recommend this place!", 
    "review_date": "2014-07-11"
  }, 
  "MsbIFptSdbUIBng23wFhbw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Michael S.", 
    "review_text": "They did a slight renovation kept the old skool with a bit of new.  Great cocktails, great service and the food looked incredible.  Place was hopping.  Loved it.  Sure I miss some things they got rid of.....but they saved that place big time.  Real hand crafted cocktails.  Go there.", 
    "review_date": "2013-11-15"
  }, 
  "i_XzZXGrvAGFKNrwwCzF1A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "FRANK S.", 
    "review_text": "We were out for a walk on a Saturday afternoon 1 week ago when, fortunately, we came upon Tosca at 4:45. The line had formed waiting for the door to open at 5. We had a nice social time in the line with co-line participants. The doors opened we went in and sat at the bar. This is what we intended. The bartender was very helpful with the menu and the recent background on the restaurant. My wife and I have been to the Spotted Pig and The Breslin in New York 2 of April's (the owner) restaurants. We do love both of the New York Restaurants. We were impressed with Tosca. At the bar we talked to the bartender and the people near us. A very friendly atmosphere.   We had the meatballs and the bar sandwich. The meatballs were a wonderful combination of meats and spices. They are worth the walk! The bread with the meatballs is wonderful and the bar sandwich was small but very good.   We will return!", 
    "review_date": "2014-02-02"
  }, 
  "9bWLc31bQvgxJfRH0lBzQg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Massarra F.", 
    "review_text": "One of my favorite things about San Francisco is that you really do not need to make reservations for some of the great restaurants our city has to offer, Tosca being one of them.  We arrived around 8pm and were told that it would be a 1.5 to 2 hour wait, but literally snagged two seats at the bar within 15 minutes.  I'm a big fan of April Bloomfield and was eager to see what she has done with the restaurant, so would not have minded the wait, regardless.  Besides, we were in no hurry and happy to have found a restaurant open on New Years night.    The atmosphere reminds me of a classic mobster movie, playing old Italian music, with dim lighting and dark booths as you pass the bar.  Very cozy, even sitting at the bar.  I was also very pleased with the service, as they were attentive despite how busy it was.    We started off our night with a cocktail to settle in, both of us ordering the Polo Cup (vodka, cucumber, mint, basil, elderflower, lemon soda).  Much care was taken to ensure they were made properly, as we watched our bartender beind the bar.  If you like cool, refreshing drinks like myself, this one definitely made an impression.  We ordered several dishes to share; my recommendations being the linguini with mussels, pancetta, and toasted coriander.  The combined flavors of the dish were excellent and the linguini cooked perfectly.  When I return to Tosca, this will definitely be a repeat.  Although I was disappointed that they ran out of the caulifower gratin, the crispy potatoes, prepared in pork fat, rosemary and garlic, did not disappoint.  And when you dip the potatoes in the remnant tomato sauce from the linguini dish?  Even better.  1 cocktail and 2 very generous glasses of wine later, how could you say 'no' to their House Capp (armagnac, bourbon and dandelion chocolate) and cannoli?  Perfect ending to a perfect dining experience...", 
    "review_date": "2015-01-02"
  }, 
  "fe7XWEvsP1h-wHStCx2GIw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James K.", 
    "review_text": "This past friday came in with a couple of friends stood a few steps in the doorway not one person answers how many. Night was just beginning after that grab  a drink at bar then left. Gave in $43 for three drinks+tips. Enviroment was full of wanna be wall street banker type lol. Can't imagine this is happening it's a new place just open less than a month.", 
    "review_date": "2014-03-04"
  }, 
  "s3vjVl0K8y_UwYtZR7s_-A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "lisa w.", 
    "review_text": "I went to Tosca with friends on a Saturday night and found the atmosphere very pleasant. The bar wasn't too crowded and the ambiance was friendly. This review is because I received particularly good service from Henry who made sure my water didn't go empty even though he wasn't a server.", 
    "review_date": "2014-12-07"
  }, 
  "CilpDejgd6PPMSmWbBQkgQ": {
    "user_rating": 2.0, 
    "user_location": "Junction City, OR", 
    "user_name": "Ellrey G.", 
    "review_text": "If the lamb ribs were't completely burnt and turned into charcoal, it would have gotten 3 stars. And if everything hadn't been over salted it would have gotten 4 stars. The only dishes that we had that weren't over salted was the baby octopus antipasti, and the pork sausage dish from the seconds section of the menu. The quality of the ingredients were wonderful, how ever the preparation was lacking a lot.   Not only was the food an issue for us, but the service was inattentive, not very helpful with ordering or answering questions, and it took forever to get seated and even longer to get our food. We arrived around 7:15pm and the hostess told us it would be a little more than an hour to be seated but probably less. We checked back with her at 8:30 and they still needed 30 minutes before we could get seated. In the end it took almost an hour longer than we were told it would take to get seated. Then we ordered. Our first dishes came in 10 or 15 minutes. But after that we had at least half an hour  gaps between courses while others who arrived after us had, in the meantime, been served 2 or 3 courses. We spent over 2.5 hours at Tosca; 80% of the time just waiting for service, food, or drinks.  I would not go back and would not recommend.", 
    "review_date": "2013-12-30"
  }, 
  "P-jv9v8gs5p0_hkA4o9Icw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex H.", 
    "review_text": "The food is fantastic.  I can empathize with some of the negative reviews as this place can get so busy that it can detract from the overall experience.  My recommendation is to go early in the week close to opening and sit at the bar so that you skip the cluster this place can become at prime time.  Pro-tip; if you're tall, sit at the end of the bar closest to the door.  The bar bows out in the middle/toward the end and makes it tough if your legs are long.  You don't want to be hunched over your soup.  Speaking of soup, get the Italian Wedding Soup.  It's perfect and a must have.  Also, fried pig tails with balsamic reduction, yum!  This is another place where I think you get more bang for your buck and more interesting flavors by sticking with small plates.  The entrees are good, but my preference is the pastas and small plates.    If only the space was a little bigger and less hectic, but there isn't much they can do about that...", 
    "review_date": "2015-01-26"
  }, 
  "FLUY2FXFIQ_YOldZElK_Rg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexander K.", 
    "review_text": "Came here for happy hour and snacks. The remodel modernized this place without getting rid of its classic charm.  Cocktails and snacks were nice but unfortunately didn't have time for a main. Will be back to try those lamb ribs.   Looks perfect for a date in the back corner. Dark and romantic.", 
    "review_date": "2013-12-26"
  }, 
  "xjGlDn8juvva9IMrEeRn6Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Massimo M.", 
    "review_text": "I took my sister here when she visited from Milan last month. Nice relaxed dining experience. Had the mod carding appetizer and olives. She had the lamb entree I had the fish. Scrumptious food and good service. Came back with coworkers for happy hour. The bartenders are friendly, professional and mix great drinks. I will go back", 
    "review_date": "2014-06-01"
  }, 
  "w1tI3Oh7GB-fUYzECYrnlQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Monelle P.", 
    "review_text": "On the rare occasion when the culinary stars aline, walk-ins to the hottest restaurants in town are possible.   Last Saturday, during the height of the weekend dinner rush, I was able to walk-in to Tosca at 7pm and score a table of 4.   Dont ask me how. Maybe I can be that persuasive? ;)  I was ECSTATIC to eat here because I had just finished Season 2 of Mind of Chef\" on Netflix and was really impressed with April Bloomfield's cooking style: fresh ingredients done simply or honest ingredients in unforgettable dishes.   The food lived up to my expectations and I really enjoyed my meal here:  The standouts: -Crispy pig tails: One of those dishes that are so good that you think, man, why hasn't someone done this before? A classic example of throw away bits that you can re-purpose into delicious dishes. Crunchy coating, succulent fat, and the carnal experience of eating with your hands and gnawing fat and cartilage from bone. So satisfying. -Rigatoni: One taste of this dish and you understand why Mario Batali flew her out from London to New York and offered her a job that day. This British girl knows her Italian. So simple, so delicious.  -Roasted chicken for 2 in marsala and ricotta bread: I wasn't a fan of the soggy ricotta bread under the roasted chicken, but the chicken itself and the marsala sauce was delicious. Moist, juicy, flavorful chicken and silky, decadent marsala sauce mingling with the jus of the chicken. Comfort food brought to another level.  -Crispy potatoes in pork fat: the perfect accompaniment to the roasted chicken. Perfectly crispy and slightly salty on the outside and creamy on the inside. Slight notes of herb.   Pretty good: -Grilled polenta with mushrooms, mascarpone, and parmesan -Artichokes in oil, red wine vinegar, aioli, mint and oregano  Pass:  -Oxtail terrine: strange dish for me. Cold, identifiable gelatinous substance solidified around meager chunks of oxtail.", 
    "review_date": "2014-08-20"
  }, 
  "w60IfM7aXw2L45uS1KBNJQ": {
    "user_rating": 5.0, 
    "user_location": "Skokie, IL", 
    "user_name": "Melissa P.", 
    "review_text": "Oh Tosca. We will be dreaming of your Spring Minestrone soup. So delicious that we went back 4 days later. I feel the Yelp ratings are a little lacking and probably a testimony to high expectations of a celebrity chef / angst over a SF legend. I have been to Tosca when it was just a super cool bar with a famous juke box, and now I've had the privilege of enjoying dinner twice. Most recently with April Bloomfield in the kitchen. And I was very satisfied.   The pastas are legit. Exactly what my Italian husband was looking for in terms of comfort food and taste. The soup was, well, let's just say I would pay money to get the recipe (hint). We also had the meatballs. Oh. My. God. A meat combo of pork shoulder, beef short ribs, and guanciale. GUANCIALE!! I don't get the overly salty thing mentioned by others. I thought all the seasoning was spot on. There were other amazing things like roasted carrots and broccoli, but I think you get the picture.   I thought the wine by the glass options were exciting. I love a Sicilian Frappato (trendy, I know, but I do). And there was an amazing red frizzante (lightly chilled) that was absolutely perfect for an abnormally warm SF night. I admit I am a fan of April Bloomfield, but I also do not tolerate a mediocre meal or service. I felt well taken care of. I will recommend to all my friends. And I hope you get to enjoy as well. Oh - I tried the house cappuccino. It was good. Yeah... I said it. It was real good.", 
    "review_date": "2014-07-26"
  }, 
  "MzXPOK2_T5O8GF-4qUVmGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Veronica M.", 
    "review_text": "I've been going to Tosca for over 2 decades.  I've had a birthday party here, I even had a photo shoot here.  So, I, like a million or so others, eagerly awaited the reopening; &amp; very much appreciated the interior upgrade that did not sacrifice the integrity of the original space.  It's been almost a year since the addition of dinner service, so time to review...  Oxtail terrine.  Thumbs down.  We did not care for this at all.  Too gamey &amp; fatty, which is not a good thing for a cold dish.  Pass.  Egg Tonnato.  Fresh &amp; different.  A boiled egg served chilled dressed w anchovies &amp; served w tuna &amp; lemon sauce w capers.    Bucatini.  The undeniable star of our dinner cast.  The sauce was zesty, spicy, &amp; uber flavorful.  Absolutely delicious.  The pasta was cooked to perfect bite.  A must order.  Crispy potatoes.  Oh, wow.  Who doesn't love potatoes fried in duck fat?  Decadent &amp; addictive, like the bucatini.  Do it.  Roasted carrots.  OMG.  These were the BEST CARROTS I've ever had in my life.  EVER.  So unexpected.  This dish won for best supporting actor in our dinner cast.  Even against the crispy potatoes.  A must.  The host was delightful.  Despite how busy it was, he was calm, cool, &amp; collected.  Genuinely helpful &amp; professional.  Nice.  Service can be spotty, but that's par for the course at most restaurants, unfortunately.  The server was flustered, but we ordered through the bar, &amp; they were great.  There was a 45 minute wait between our cold apps &amp; our dinner, but it was Friday night &amp; a packed house.  When I brought it to the attention of our server, it was rectified immediately w finesse &amp; positivity.  Impressive.  Another great night @ Tosca.", 
    "review_date": "2014-08-12"
  }, 
  "WBiBUFlN4BNp_VRbtQwSOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua G.", 
    "review_text": "Really enjoyed our dinner at Tosca. Great cocktails, the linguini with mussels was perfect and the the chicken was well worth the hour wait! (It says on the menu that it takes an hour, wasn't due to slow service). Look forward to going back, will be hard not to order the chicken again. Plus, they play good music!", 
    "review_date": "2014-12-24"
  }, 
  "aPfvp1IInbpUkWHi6OLNrA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ame W.", 
    "review_text": "Tiny portions! Smaller than tapas!  $11, 3 teenie pieces of fried artichokes. $17, for a sliver of polenta and a few mushrooms $15, 3 teensy and very bitter meatballs. Weird. And barely sauced... What's the idea behind the food here?  Are you trying to feed us...or cheat us?!  Tony's does it better", 
    "review_date": "2013-10-11"
  }, 
  "-CdioCf2vBD_agBBW3NIww": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul S.", 
    "review_text": "Was at Tosca last night for the grand re-opening!  The place looks great!  It's different, but it's still real, still Tosca!  Maybe even better.  They serve food now, until 1am, no less, and wines are chosen by Randall Grahm, the master of Bonny Doon Vineyard! New owner Ken Friedman and his manager, Jennifer, presided and the doyenne of Tosca, Jeanette Etheredge, was there, positively glowing!  Brought my son in today for a superb Dandelion hot chocolate.  Looking forward to coming back again soon!  Good job, Tosca! And good luck!", 
    "review_date": "2013-10-11"
  }, 
  "o3PGs0t2a8ORb0gUXFr0bQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joel C.", 
    "review_text": "Everything was amazing. The artichokes in oil are perfection.  The special rosemary focaccia delish.  I ordered gemeli with pecorino and pepper which is cacio e oepe.  And a side of broccoli di cecco.  So macaroni and cheese with broccoli.  And it was the finest ever made.  Wine list ... Italian heaven. Cannot understand the 3 star overall here.  Get a life.  April's menu is fantastic and the room is \"preserved \".  Enjoy and rate responsibly.", 
    "review_date": "2014-07-05"
  }, 
  "o6Tm2BUCH38NwDWgdsLu8g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "mel l.", 
    "review_text": "Well I ate here with my best friend after waiting for 3 months to finally have a night off together due to our crazy schedules. Ordered a lot because we like to go big. And heard from other chefs that this place is nice for late dinner (especially for industry people who get out late everyday like us). Anyways....like everything we got. Octopus was good. Cacio de pepe was too cheesy it was gloppy and not creamy. The tiramisu was perfect. The problem is here.....We got the chicken liver. We both love chicken liver. We are BOTH chefs here in SF.!! It came out and it was on a skewer. Took it off the skewer and noticed it was very medium rare.  Not the best idea to eat chicken liver so under done and we knew it. Not blaming tosca. We poked at it and talked about weather or not we should eat it. We ignored our better judgement and ate it cause we were so hungry. Finished our meal and went home. 5 days later I became extremely I'll from food Bourne illness aka food poisoning. To be honest I had no idea what it was from. I was in so much abdominal pain that I almost fainted twice. It lasted strong for 3 days. A couple days later after returning to work I texted my same friend and asked her when we can schedule our next meal together, that's when she said she has been bed ridden due to food poisoning. That's when my jaw dropped. I told her I had the same thing and it must have been our dinner from earlier in the week. We remembered the \"if-y\" liver we ate. I emailed tosca and told them what happened. Only seemed like the right thing to do. I wasn't blaming them And I wasn't mad or upset, but being in the food business I just thought it's something I should share. We would want someone to share that kind of info if it was our restaurants. It's been over a month and I haven't heard anything. No sorry. No thank you for sharing. No we will try to be on the look out for that. No nothing. So I took this time to write a yelp review to share my experience with people who actually care. Here it is. Enjoy everyone. Bed time.", 
    "review_date": "2014-09-15"
  }, 
  "3FJ4B-R4ejW0CyoUVw1KDw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Frank P.", 
    "review_text": "I would have given the New Tosca Cafe more stars, however there was one major experience which marred the entire night for my wife and I.  To start, the ambiance when we walked in was amazing. There were tons of people, old-tyme jazz,  and an overall celebratory attitude. We've been here twice and the part that bothered both my wife and I was the chef, the head chef I believe. On both occasions he started yelling at the servers despite the fact that our service was on time and extremely hospitable. He just started berating the staff members like they were doing something wrong. It was like having a crazy person in the room. TOTALLY unprofessional.   I will be returning however I hope this guy isnt there.", 
    "review_date": "2014-03-07"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "Chef April Bloomfield is an awesome culinary bad ass. Only 1% of all Michelin chefs worldwide are female; she has two Michelin starred restaurants. Two! She was named Best Chef, NYC in 2014 by the prestigious James Beard Foundation. She's the highest scoring Iron Chef competitor who beat Iron Chef Vin Diesel (aka Chef Symon). AND, her newest restaurant, the revamped Tosca Cafe was named #4 in The Best New Restaurants in 2014 in America by Bon Appetit!  It was only fitting to end the year with a bang and have our last meal of 2014 at a Tosca Cafe before KO at 9:30 pm and waking up 10 minutes before the countdown...only because I thought it was an earthquake. Come to find out it was just our puppy, Tater Tot furiously humping Mr. NSS' shoulder. I guess we know who's boss!  Anyhow, the stars were aligned when we able to snag last minute reservations at Tosca Cafe and were seated in a cozy booth with front row seats to the kitchen. Reservations are a must on the weekends unless you have 2+ hours to kill.   Tosca Café serves Italian food with a twist. The prices are really expensive for the small portions (hello, $4 for a chunk of bread!) but worth it. Prepare to spend about $80-$100 pp for food and drinks.   ~ * ~ C O C K T A I L S ~ * ~ All cocktails are $12. *Polo Cup: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1DftXBk&amp;s=6bfde8b4605e478ea7a474f3f47b7c334fe6281fc03050353a7822927ca42cf2\" rel=\"nofollow\" target=\"_blank\">bit.ly/1DftXBk</a> *Choke Hold: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1BDY8xO&amp;s=fa402b39df6d706a07416e5251d8c9d8c81a95006936ba46bd201084a5b81f9e\" rel=\"nofollow\" target=\"_blank\">bit.ly/1BDY8xO</a> *Suffering Bastard: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F14sfbZB&amp;s=5dc40a679bc5c20beeeb9f248e6752f3db5531a357e813e4a2872ded48f37311\" rel=\"nofollow\" target=\"_blank\">bit.ly/14sfbZB</a>  My fav was the Polo Cup because it's super refreshing. Choke Hold was super stiff. The Suffering Bastard was a bit too sour for my liking.   ~ * ~ F O O D ~ * ~ Reading all the reviews complaining of the food being overly salty, we requested \"lightly salted\" for our order which was just right.   *Pressed Pig Ear ($5): 3 STARS <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1xvMbeM&amp;s=94dd3eac0c6f4c9329d9d385717e062e17b6da91596b2e1dd87f9aced0547b66\" rel=\"nofollow\" target=\"_blank\">bit.ly/1xvMbeM</a> Nothing special; reminded me of thinly sliced headcheese.   *Crispy Pig Tails ($9): 5 STARS <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1tDFJwF&amp;s=33a87e3de6bf0d3188f8cb385ffe3bdf865f590292de193df91547d021dbf72b\" rel=\"nofollow\" target=\"_blank\">bit.ly/1tDFJwF</a> These were phenomenal. Think super crunchy and juicy chicharrones. The drizzle of balsamic reduction perfectly cut through the richness. It was SO good that we ordered another round.  *Meatballs w/ house baked focaccia ($12 + $4): 5 STARS <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F14qkeKj&amp;s=15e23ed116920df23bcaf0e9af3052e1041d3808890356ba35c335eef1093e60\" rel=\"nofollow\" target=\"_blank\">bit.ly/14qkeKj</a> These were disappointingly tiny but the flavorful meatiness and airy texture made up for it. The crunchy yet cloudy focaccia dipped in the marinara sauce was deliciously satisfying.   *Lucamoni w/ prosciutto, treviso, lemon breadcrumbs ($17): 4 STARS <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1AxfL4r&amp;s=d78e32c2185e81aeaf309b6fd00651d0c87b98fb895a9ed3d85b6dfaf55b2649\" rel=\"nofollow\" target=\"_blank\">bit.ly/1AxfL4r</a> All their pastas are made in-house, and you must order one. The lucamoni had a great toothsome bite and I loved the light saltiness from the prosciutto and the crunchy texture contrast from the breadcrumbs but it was way too lemony.   *Roasted Half Chicken For Two w/ ricotta, pine nuts, marsala ($42): 4.5 STARS <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1Ihkh7t&amp;s=8ac3a1acb9e415c15a83f64289a3d9b31fbe3ececb6d757bc0b5a25c7abcd959\" rel=\"nofollow\" target=\"_blank\">bit.ly/1Ihkh7t</a> For the price of 8.4 whole rotisserie chickens at Costco, you get a whopping half a chicken at Tosca Café...BUT, this roast chicken beats Zuni Café's hands down (their chicken is so boring and overrated)! The skin was lightly crisp and the meat was succulently moist; even the breast meat. The marsala sauce added a great complex savory sweetness. Loved the crusty bread topped with creamy ricotta and pine nuts. Best roast chicken ever but the price tag is just too ridonkulous to warrant 5 stars.   *Crispy Potatoes w/ pork fat, garlic, rosemary ($7): 2 STARS <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1xLmnNg&amp;s=d8238055135d371a96356f5407e143decc06028d5a556422367e1fa1cd91e974\" rel=\"nofollow\" target=\"_blank\">bit.ly/1xLmnNg</a> People raved about this but our order oddly tasted like bitter, burnt garlic.  *Tiramisu ($9): 4 STARS <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F1xvNt9u&amp;s=69df2f3c4d47878f5f4a14ecc695fd0e98f1ba3617cebdb76a5c35419024ee24\" rel=\"nofollow\" target=\"_blank\">bit.ly/1xvNt9u</a> This tiramisu will rock your taste buds. The espresso flavor is super strong; way too strong for me but it was well-executed and nicely fluffy.      ~ * ~ S E R V I C E ~ * ~ This would be a 5 star review except the staff is cold and the service very slow (we had 5 pm reservations).   The only friendly people in the army of staff are the hostess and the American Indian waitstaff (super nice guy). Hopefully one day their kindness will rub off on the rest of the other staff. Obviously, it's their job to get sh*t done and they do but a little kind reciprocation would be appreciated. They wouldn't even acknowledge our \"thank you\"s. Don't expect them to ask you how your meal is either.  Our meal was coursed out so there was an unbearably long lag between courses. Dinner took over 2.5 hours for 4 courses so liquor up!  Only knocking off a star for service because we expected this given all the other reviews.  ~ * ~ A M B I A N C E / D E C O R ~ * ~ Dark, old skool, and insanely loud. There's 6 tight booths, 3 four tops, 4 two tops, and a private room in back for large groups. Not recommended for an intimate date.  ~ * ~ P A R K I N G ~ * ~ Insanely difficult street parking which is why I normally avoid the area. They need to offer valet parking.", 
    "review_date": "2015-01-06"
  }, 
  "4iFx8XlmOFJ1fg93ctFqVA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa T.", 
    "review_text": "Wow I can't believe I have written a review of Tosca yet! This place is amazing. Food is so unique, it never seems to disappoint. The menu does change a bit which is good since I am forced to try different items. The first time I dined here, they had clams in a vegetable broth. One of the best dishes I've eaten in a while. The roasted chicken was worth the hour wait. I get a little carried away with ordering here so why the time the main course shows up, ie an entire chicken, my stomach is reaching the full point. Moscardini is also on the top of my list here. Cocktails are also tasty!  Bring a friend and share everything! You will have a great expereince.", 
    "review_date": "2014-07-24"
  }, 
  "3Kn05dbSYgsEFxad7oETBQ": {
    "user_rating": 5.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Karya L.", 
    "review_text": "The vibe is very elegant and modern.the food is to die for especially the meat balls and focaccia bread. The service is very quick and helpful,the kitchen is very open so you can watch your food being made.its a perfect place to be if you want a early dinner because waits aren't long yet.the dim chandelier lighting and old fashioned booths add a great effect .", 
    "review_date": "2013-12-29"
  }, 
  "oHOInzaXWM7uJIni498auQ": {
    "user_rating": 2.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "John W.", 
    "review_text": "Do not order the chicken. I waited about 2 hours to be cooked when I was told that it would take about an hour. As more than an hour passed, I was hoping that it would be worth the wait. When it finally arrived and I tasted it, I was extremely disappointed. I ate about 10% of it and that was too much. The chicken seemed uncooked, and had no taste. Do not waste your time and money on the chicken.", 
    "review_date": "2014-07-31"
  }, 
  "nYDozThOT6SxLzLQC8U14A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeanne B.", 
    "review_text": "Bring back the Old Tosca.  This new version has tampered with tradition.   It is also too expensive.", 
    "review_date": "2013-10-22"
  }, 
  "t6dnI9F0_MyLKNCxI591RA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tracy K.", 
    "review_text": "I'm surprised the reviews here aren't higher -- I had the most delicious experience from start to finish.  The hits? - Lumaconi:  wonderful bites of large shell pasta with lemon breadcrumbs and prosciutto, bathed in cream sauce - Bucatini:  perfectly al dente in a hearty tomato/guanciale sauce.  Order this with a side of meatballs - Grilled Lamb Ribs:  fall-off-the-bone, tender, flavorfully marinated and nicely complemented by marinated grilled onions - Focaccia:  sop it all up with a tall, fluffy slice  Oh, and if you have space, the gelato is perfect!  The downside is you won't get the predictability from being able to reserve in advance, but if you happen to be passing by and there's no crowd, Definitely worth a stop!", 
    "review_date": "2014-04-26"
  }, 
  "65M53Vg0LxmvPx31oYzFZA": {
    "user_rating": 3.0, 
    "user_location": "Richmond, VA", 
    "user_name": "Frankie B.", 
    "review_text": "Delicious plates with poor service and inflated prices dragging the star level down to 3.  My date and I show up as walk-ins on a Wednesday. The bar is hopping, but there are plenty of 2 person tables open. The hostess informs us she can seat 2 but she cannot accommodate our friend if she decides to join (despite many open 2 tops) - minus points.  Service starts off well - attention to the water glasses, folding napkins after the restroom... But then it starts to slide quickly. Our waitress informs us that we must make a complete order... What? We were never given bread and then the water refills started to slip.   We started with the baby octopus. Outstanding! I didn't know it was possible to get such a wonderful texture from octopus.  The tuna salad with radish was bright and full of flavor, very refreshing.  The salmon entree was exquisitely prepared, it had a dual personality that was completely balanced between sashimi and cooked. The crispy skin on top was the icing.   We ordered two espressos and this is where service really fell off. Plopped the espresso down without a plate, no sugar, no espresso spoon- had to ask for these items. On top of that the espresso was terrible! Bitter, and not in the strong espresso way! But in the, omg this is almost inedible way (even with 3 scoops of sugar)!", 
    "review_date": "2014-09-25"
  }, 
  "UZRMPhyWEPqyiGJaTjrWLA": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Anonymous U.", 
    "review_text": "The cocktails are delicious, albeit expensive, but do not go here for dinner unless you want to pay a lot for very little in terms of quality and service.  We were told there was a 10 minute wait, then waited an hour for a table with no apologies from the hostess. As other reviewers mentioned, the dishes are tiny and unimpressive.  They even undercooked the pasta.  Getting charged for bread adding insult to injury, especially since the only redeeming part of the meal was the slightly sweet gravy with the overpriced half chicken.  The waiter was very attentive about asking us whether we wanted more drinks or dessert, but never checked on the quality of the food or gave us any useful recommendations.  I hope that Tosca figures this out, as it is a great little historic bar with potential.", 
    "review_date": "2013-10-20"
  }, 
  "BlCLKtUfNErckfM1ULvBOw": {
    "user_rating": 4.0, 
    "user_location": "Monterey Park, CA", 
    "user_name": "Zan C.", 
    "review_text": "Reunion with an old friend from Shanghai!  Love the atmosphere-it's reminiscint of NYC", 
    "review_date": "2014-04-27"
  }, 
  "KUusL15g7gVmPO7_XRp8cQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline L.", 
    "review_text": "* absolute mind blown..  From our apps: marinated olives, fennel, octopus, chicken liver toast.. To the chicken for two. Wao. Soooooooo yummy!!!  Service was on point, our bottle of Chardonnay Nebbiolo was insanely delicious and so was the chocolate ganache cappuccino with bourbon that ended my meal on cloud 9.  What a wonderful little gem. Will definitely be back!!!", 
    "review_date": "2014-12-14"
  }, 
  "OTCxrFVCPN5vZH09kxIj9w": {
    "user_rating": 1.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Jimbowicz J.", 
    "review_text": "Terrible is all I can say. No ports to offer? And the prices for their whiskey offerings are ridiculous.  I was at three other bars in SF this week that offer Pappy for considerably less....  The service was awful as well. We waited at the bar for at least 10 minutes and not a peep from either bartender. This was on Wednesday.  It was busy, but not packed.   I thought the \"Spotted Pig\" influence was going to make this place better. We do look forward to eating here soon, so perhaps a redemption is possible in the near future.", 
    "review_date": "2014-04-27"
  }, 
  "kcNaMdowMzX8mKlWGlvjBw": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Sam D.", 
    "review_text": "Lovely spot, great bar, excellent service.  But, the food is overly salted.  Every dish:  the salad, 3 pastas we ordered, the roasted chicken, the focaccia, several appetizers were salted beyond belief.  Totally unnecessary, ingredients were good and they could stand alone but why so much salt.  We told our waiter no salt after the first few dishes, but everything is prepared in advance, ie pasta sauce and sauce for chicken, dressings. So we said no final dusting of salt which maybe they  did.  But it was terrible, will not go back.  Will go for a cocktail at the bar but not for dinner", 
    "review_date": "2014-02-16"
  }, 
  "wHxQxNbNbWQQdIKhWpWb-Q": {
    "user_rating": 5.0, 
    "user_location": "Manhattan Beach, CA", 
    "user_name": "Peter P.", 
    "review_text": "Food was amazing. Pasta and meatballs, and the brioche bread were out of this world. We got lucky and walked in at 9pm on a Saturday &amp; got sat in 10 min.", 
    "review_date": "2014-02-23"
  }, 
  "kMLbPSkqNjquPvt2kB6OIA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keith J.", 
    "review_text": "First time since the re-do.  Looks great and I don't know that I've had Italian food this  good in years.  Had the meatballs (extraordinary, not your typical lump of tasteless meat, but complicated flavors and great sauce); bucatini (perfectly cooked pasta with a rich (not too rich) sauce with little bits of pork and crunch...superb); and a side of broccoli di cicco (if you're going to eat a vegetable, this is the way to eat it...again, perfectly cooked and seasoned, actually sort of complex).  Finished with buttermilk gelato, which was perfect.  The cocktails (negroni) were nice, too.  A tad pricey; but the serving sizes are just right.  We sat in the backroom (who knew?) and it was quieter, if a tad stuffy (air-wise).  Only complaint was that, while the staff are on the whole friendly and helpful, our waitress was a tad chilly...but we'll be back.", 
    "review_date": "2014-09-12"
  }, 
  "XvypNyl5nA227YBk4KJFdQ": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nora N.", 
    "review_text": "This is one of those places you hear people RAVE about.  Popped in around 6pm. It was PACKED. No greeting. Found a seat at the \"wall bar\" with trash near by.  Ordered one of these whisky coffee drinks. One with and one without alcohol? Maybe it's because I prefer my coffee black.. but it was pretty disgusting mix of coffee and milk and I don't know what. Maybe they had a good menu in the dining area.. but I don't think I'll be going back. Not with all the other options near by.   Snooty and crowded was my memory of the place.  But if you like loaded milky coffee drinks with whisky in super crowded bars! This is the place for you!!", 
    "review_date": "2014-12-03"
  }, 
  "lHeAyj_7kSVakMMHDT5ORA": {
    "user_rating": 3.0, 
    "user_location": "Washington, DC", 
    "user_name": "L M.", 
    "review_text": "I used to live in North Beach and loved the old Tosca Cafe for drinks.  When I returned to SF for a visit, I wanted to check out the spot's new life as a restaurant with a much talked about offering.  The interior has not changed much except for more lighting and a window into the kitchen as well as some wall decor.   I was hoping they'd soften the ambient noise some how but the dining room still has a dark diner feel to it.  They could improve on this.  Regarding the food, it was delicious...when it finally arrived (a tease about the service which I'll cover later).  The bread for the table came warm and tasty.  We had to rip it apart so would suggest they partially score it.    Then, we got the Italian wedding soup and it was solid - light w/ yummy meatballs / pasta.  We also ordered the grilled polenta and gemelli.  Highly recommend the polenta.  A burst of interesting flavors and nicely presented.  The gemelli was ok.  Nothing good; nothing bad.  Lastly, was the trout.  Solid execution.  Overall, the food was great. Would give food 3.5 stars.  As for the service, it's clearly something they are still working on.  We arrived and the hostess was not the warmest.  When we were seated, about half the dining room was full...yet, it took quite some time for our server to get our order and then, for the food to come out.  As I sat from our banquette, I could see the dining room fill up and once that happened, the slowness became obvious.  It seemed like the crew was overwhelmed a bit.  Would give service:  2.5 stars.  It needs improvement.", 
    "review_date": "2014-11-07"
  }, 
  "V5Th21KjUiYLJQyV-vGtpg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Ben H L.", 
    "review_text": "I didn't get to have a drink at Tosca because the bar was super packed.  We ended up going somewhere next door.  The place seems like a step up from the dive bar competition all around them.  I stared at a loaf of foccacia bread on the bar counter for at least a minute because I was hungry.  It looked so good and I was hungry at the time FYI.  It's not often during my Friday night drink hopping trips that I get intrigued into finding a place that I want to try their food.  I definitely know now that this is a popular nightspot so I'll definitely make sure to try their food and drinks and subsequently update my review later on...", 
    "review_date": "2014-04-05"
  }, 
  "8BWHn8BNHtRW4rbzFc3u5w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Pilar P.", 
    "review_text": "Well I was underwhelmed. Hard to compete with all the press and live up to the expectations. We arrived, 4 of us, at 5:15. Drinks at the bar took a solid 10 minutes. Thankfully, they were excellent.   Our waiter was too soft-spoken and it was difficult to understand him. We ordered pig tail, fennel, oxtail terrine, 2 pastas, meatballs, fried anchovy, and tuna conserva. All were solid. There were complaints that the pastas and meatballs were under-seasoned. I loved the chili that came through.  I would say the biggest flaw was service. I ordered another drink at the table and it simply never arrived. They also sent us the wrong pasta dish, and they never once checked on the table to ask how the food was.   Expect more from April &amp; Ken by reputation. Love their NYC restaurants.", 
    "review_date": "2014-09-17"
  }, 
  "rzPH0MaG7MMS2IPEAr1dqw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Elizabeth F.", 
    "review_text": "The new Tosca is effing FANTASTIC! I dont really like playing this card, but Im going do it: Im an old timey, fifth generation San Franciscan. I know there's been lots of discussion about the old Tosca closing and new one opening, but guys -- we're incredibly lucky to live in a community that cares about its history, its bars, its restaurants, its haunts with such fierce loyalty . San Francisco thrives because of the constant populations streaming through the golden gates to build a life they simply couldnt build anywhere else. And thank god the team coming into Tosca 1. care about great food 2. know how to cook it well.  We had the meatballs, the oxtail terrine, the octupus antipasta -- to die for. Roasted cauliflower and the roasted chicken -- what a diva. That chick steals the show, and well worth the 45 min slow roast wait. Each piece is succulent and perfectly evenly cooked. Absolutely amazing.  Cocktails were delicious and I love the glasses. My sister got the cappucino, and it was truly amazing...   The decor is fantastic. Red vinyl been replaced by red leather, but my fave is definitely the bathroom -- the coral tile that seems to have been the standard pre-war, and my dad and brothers proudl confirmed Marilyn's still in the boys room. I personally love the library ladder on the south wall used to grab bottles of wine.  thank god Tosca is still around! thank god they took such care to maintain the character. Most of all, thank god the food is so delicious and done with such care! times, they are always a' changing. Tosca, glad you're still around!", 
    "review_date": "2013-11-16"
  }, 
  "PB8DShHIsOw7A2iFnF-LMQ": {
    "user_rating": 2.0, 
    "user_location": "Nob Hill, San Francisco, CA", 
    "user_name": "Neil C.", 
    "review_text": "First time back since the redesign. Went there a few years ago after hearing great things about their drinks. I had an amazing dirty martini and loved the character of the bar. Went back yesterday and have never been so disappointed in my life.  Ordered a dirty martini and the bartender says 'we don't have dirty martinis.' Wait, what? I pressed the issue a little and asked why a cocktail bar couldn't a very basic drink (vodka, vermouth, olive juice) and she was extremely rude, basically yelling and belittling me and telling me 'I'm SO sorry we can't appease you but that's just the way it is so if you don't like it you can leave'  Needless to say I will NEVER be coming back, to what used to be a favorite North Beach hang out.", 
    "review_date": "2014-02-23"
  }, 
  "GnaVGdKi7MF-vkO-Z25qTQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "F G.", 
    "review_text": "Went here last night for dinner.  Very nice space and setup, would love to return for a drink and small bites, but food just okay.  Prices are high but not out of the range for SF. Had crispy pig tails, meatballs, Dungeness crab salad, Bucatini and Gemelli, Tiramisu for dessert. Overall everything was overseasoned. Bucatini was salty but decent, while Gemelli had about 90% of a lethal dose of salt. Tiramisu had enough orange zest and liqueor to lack any appreciable taste other than that. Overall, most things weren't that balanced; with a lighter touch I bet they would have been really good. Nowhere near as good as other Italian places in the price point and nearby, like Cotogna or Perbacco.   Digression: Arrived about 515, wanted to start with cocktails and small plates, but waitress said we'd have to order everything at once.  Little strange for a bar/restaurant, especially when we wanted to space a couple of cocktails over the meal.  Most places seem to prefer it the other way, to order drinks first and have those arrive before ordering food so that you'll order more booze over the course of the meal. Apparent attempt to turn over tables quickly at expense of enjoying meal and drinks. Which I guess is fine, but just interesting the way she refused our request to start by ordering our appetizers first.", 
    "review_date": "2013-12-06"
  }, 
  "1oZYTtix-ewdp7gKMu4BGA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julia C.", 
    "review_text": "We really wanted to like this place, but it was just a bad experience all the way through. 4 of us put our name in around 6:30 and were told 45 minutes. No problem though, the place was crowded and we totally anticipated a wait. We went to a bar across the street and came back/ checked in with the hostess after 40 minutes. She told us we'd be the next couple of groups seated. 20 minutes later, we saw we had a missed call from the hostess, who we were literally standing 3 feet from and had at this point checked in twice with. Apparently she had completely forgotten who we were and passed us over on the list-- long story short, we waited 2 hours to be seated, instead of the quoted 45. The only reason we stuck around was because we were starving and a little tipsy after some strong drinks at the bar. We explained the situation to the waitress and said we were disappointed with the experience thus far, and she mumbled some lame excuse about the previous party taking a while to (not relevant to our situation, we were repeatedly passed over on the wait list). Their sorry attempt at appeasing us was to bring a free (gross) cold vegetable plate-- would have been more appreciative of some comped drinks. Sadly, the situation didn't improve-- drinks took 20 minutes to arrive, and the grilled lamb ribs we all ordered were 90% fat. Only highlights were the brussel sprouts and the foccacia (which we devoured in our starved state). Went home hungry and disappointed! Hope others have better luck.", 
    "review_date": "2014-01-25"
  }, 
  "U32PUYeupHWju0e9PUEU_A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ali V.", 
    "review_text": "The food here is no good and way overpriced (sound familiar for North Beach?). Had two pasta dishes, forgettable (that's why I can't recall them here). Put to top it all off, it was my birthday and a friend brought me a cupcake. After a struggle, the waiter brought the cupcake back with a candle. Upon getting the bill, he charged a $7 \"cakeage fee\" for doing nothing more than sticking a candle in. No plates, cutting, etc. Needless to say, he took the charge off, but just a pretty below-average experience overall.", 
    "review_date": "2014-03-24"
  }, 
  "sIt0zmHkelTevuvkM55ImA": {
    "user_rating": 3.0, 
    "user_location": "Studio City, CA", 
    "user_name": "Ashley K.", 
    "review_text": "Maybe I'm just disappointed...I have very fond memories of the old Tosca...Unassuming, delicious and reasonably priced prohibition era drinks.  They have LITERALLY doubled in price, since I last visited.  You can't even sit at a table anymore,  unless you're having dinner. Why'd they have to make it all snooty? The House Cappuccino, used to be awesome, now it's super sweet and way fancier, the servers made sure I knew, but sorry, the expensive ingredients don't make it taste better. And the charm it used to have is gone. The food is very good, yes, but it's basically a completely different restaurant now, not a charming neighborhood bar, and I miss the old Tosca, where I'd spent hours drinking and chatting with friends and loved ones.  Sadly, my husband and I won't be back. Unless we're ready to drop 25 bucks on 2 drinks!!!", 
    "review_date": "2014-03-29"
  }, 
  "97YdD8tkMkUSvGUw6_u4GQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rebecca C.", 
    "review_text": "this place is way too loud and crowded for Friday night. it reminded me of those crowded New York places that I came to dread since I moved to San Francisco. Better check it out on a weeknight.  the murals on the wall were quite impressive, reminding one of the renaissance height of Italian art without being too pretentious. Good collection of cocktails and the food was quite delicious. We ordered the fried artichoke where small pieces were lightly battered with some capers to counter the slight grease.   If one could chase the crowds away, this place would be perfect!", 
    "review_date": "2013-11-24"
  }, 
  "zYxeaO2gDxS1eIZ_3pE1iQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "N M.", 
    "review_text": "Get your act together in terms  of service.  I know I'm gonna sound like an old fart since I've been coming to Tosca for over Thirty years but if I'm ordering food at the bar the first fuckung thing you ask for is my cc card ? Manners baby. I get it if I'm standing w drinks but sitting and eating!  Good food but aside for the woman bar tender the guys don't give a shit.  Smile !", 
    "review_date": "2014-04-08"
  }, 
  "UHfB_MWtZnK8UB_WhmK0wg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron J. C.", 
    "review_text": "I am not sure why there are so many negative reviews for Tosca, we had a great meal and wonderful and attentive service.  We will be back soon and often!", 
    "review_date": "2014-06-16"
  }, 
  "2dPE2x2ILv9-IkndQwo1vA": {
    "user_rating": 5.0, 
    "user_location": "Nashville, TN", 
    "user_name": "K. D.", 
    "review_text": "Went last night w/ 2 restaurant biz pals - WE LOVED IT! Every item of food was dee-lish...our server Tyler was fabuloso...great cocktails &amp; wine (you can order a half glass:)...old ambiance with new energy. Here's what we had...fried artichokes, mussel soup, focaccia to get every last drop of that soup, Point Reyes blue salad, roasted chicken, and every one of the vegetables; broccoli di cicco, roasted cauliflower (my fave), crispy potatoes w/ garlic, baby beets w/ walnut pesto and then finished the feast with upside down pear cake (boozy).  It was Friday night busy, but we got a table with no wait...not sure how long that will last. It was noisy, but we expected that and parking was tough, but we expected that too.   So glad that Tosca is back in fine form and I hope Jeannette Etheredge is proud!", 
    "review_date": "2013-11-02"
  }, 
  "k-uAx-Cwq0R-rDcxm6VjRQ": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jim M.", 
    "review_text": "It was good not great.  And I wanted it to be great since I enjoyed the Spotted Pig so much when I went there.  The pastas are decent. We had the gemelli, the rigatoni and the special pasta, which turned out to be our favorite. It was something with cheese and cream but honestly, I can't remember the specifics because those drinks are so strong! And good.   The chicken though. For 42 dollars you are hoping for an amazing chicken. Nope. I still can't figure out why it's 42 dollars.  So, while I'd go back because the space was beautiful and the bartenders were attentive (we sat at the bar), I wouldn't wait in a line or go out of my way to eat here but be prepared to spend some money and also, it gets crowded.", 
    "review_date": "2014-08-19"
  }, 
  "4oJemmxW2uyRCJRH1p9niA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon S.", 
    "review_text": "The Bucatini is seriously special.  I find bacon to be so overused on so many menus, but April has some delicious skills when it comes to guancale.  Somehow the pork face gets soft, succulent and crispy, all at the same time.  But the porkiness is subtle as to not over power the dish.  When you don't have a bite of pork, you get a rich, spicy, tomato bite of pasta.  The chili works well to power down the pork, and adds a whole new layer to finish off the dish.  The dish is salty, spicey, and rich.  In my mind it's the perfect pasta.  The bartenders here are great, they truly care about their craft.  I waltzed a little after 5pm, so seating was not a problem at all.  If this pleace gets crowded and you have to wait long, there is nothing the restaurant can do about it!  That should not impact your review at all.  If you don't like the subtle changes in the restaurant, then you're crazy.  It's beautiful in there.   I would stay away if it's over-jammed in there, get here at an off time and enjoy the well crafted food.", 
    "review_date": "2014-03-12"
  }, 
  "h0FPJR1jCDpwq0C4t8ArLA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline M.", 
    "review_text": "After reading a thousand rave reviews for the newly revamped Tosca - I had to give it a try.  The bar opens at 5, and we arrived at 5:30. Good thing, because the bar seating was already full. Good to see!  For our first round we ordered the House Cappuccino and a Polo Cup with gin. The House Cappuccino tastes incredible. Hot, luxurious and just boozy enough to make you fall in love.    The Polo Cup was decidedly unpleasant. I usually love a cocktail with lots of different flavors - and I'm a sucker for any drink that combines cucumber, mint and citrus - but this combination just didn't work for me. Alas. Maybe with vodka next time instead?  We split the charcuterie plate to munch on while we sipped our drinks. It was a surprisingly hefty plate and a great pairing to our drinks. The pickled veggies were amaze.   Excited to go back!", 
    "review_date": "2014-01-06"
  }, 
  "76j5wa3rZJt96K90PkFoUg": {
    "user_rating": 5.0, 
    "user_location": "Concord, CA", 
    "user_name": "Patrick F.", 
    "review_text": "We had a large group and needed to push tables together but they were uneven. The manager insisted that we have even tables and moves their tables around to accommodate our group. We didnt mind but it was not up to us. Both our server and manger were delightful. I can't say enough good things about their service and professionalism. Raising the bar for north beach and booze coffee everywhere.", 
    "review_date": "2014-10-28"
  }, 
  "dkYcB0yD0Fx_r0mhGBFzUQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa L.", 
    "review_text": "Had reservations for two then last minute had another couple join us, the host was very accommodating. We all grabbed a drink at the bar then were escorted to our table, we were greeted very quickly the server was lovely and on point. Every thing came out in great timely fashion and he never missed a beat. Everything from the drinks to the appetizers to the main dish to our cappuccinos were splendid. I have been back since and it didn't change, service and food were outstanding...", 
    "review_date": "2014-12-30"
  }, 
  "Ap2OKYiipmm3hITXsjMZCQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caselli M.", 
    "review_text": "Atrocious service.  We showed up at 7:30 and were told we would be texted as soon as a table opened up.  We went to a bar down the street and received a text a half hour later.  After immediately responding and heading back to Tosca, we were told that there had \"been a mixup\" and that a table would not be ready for another hour.  We then waited an hour and a half during which time one member of our party was spilled on with a burning beverage by a drunk person at the bar. . . that the staff recognized and promptly ignored.  When we were finally seated, no recognition whatsoever was given to the fact that we waited as long as we did for a table.  To put a cherry on top of the lovely evening: the majority of our party ordered the steak, and rather than being asked how we would like it served, it was automatically served vastly undercooked. We couldn't believe the service would be so bad. As recent ex-New Yorkers, we can say that a patron at the Spotted Pig would never be treated so poorly.", 
    "review_date": "2014-08-03"
  }, 
  "OB5DYt6yVwYuTSaSYYWoxg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brski B.", 
    "review_text": "I really don't believe in sighing in print unless you're truly sighing and not just playing for effect. Sigh.   Prologue: I happen to like April Bloomfield's cookbook very much. Her food is hearty, smart, and well conceived. While I realize she is neither in the kitchen nor creating the menu top to bottom, I do believe this is wholly her method and her essence. At Tosca, the food is *all* seasoned heavily - taken right to the brink of being too salty. This is actually a great plus because it's hard to reach and easy to pass that salt line into failure. None of this or the previously noted contributed to the failures of our meal.  We started with the meatballs, which were not on the regular menu but an app special for the night. There were three nice meatballs in a shallow plate of well seasoned marinara. A nice start.  The focaccia too was well seasoned - again, almost too well seasoned - but very tasty. This is not the focaccia I grew up with on the East coast, but that was many years ago. Our waitress said we would love the focaccia to dip into our marinara, but that did not prove necessary (or true).  Next, the crispy pig tails, which I'd never tried before. My guess, they're braised/boiled until soft and then deep fried - the result is a pig tail chicken wing. Except they're fattier and stickier than a chicken wing and the meat is not as easily discerned as it is on a chicken wing. Part of that is due to the darkness of the room, but it's also due to the nature of the cut. No matter, such was its unctuous deliciousness that I chewed it down to almost nothing (which I do not do with a chicken wing). They were not dressed with anything and they were delicious. The highlight of the evening.  Alas, the mid-point of the meal is where all went awry.  First, the fritto misto - butter clams, padron peppers, and salsa gribiche. The most unforgivable problem was that it was served with our pasta dishes. There was a lull after the pig tails when the fritto misto should have been served. Served with the pasta, we had to set the pasta aside because soggy fritto misto is merde. Second problem, the clams were a little too tough. Third problem, either it was a mistake or intentional, but one of the battered pieces was a piece of lemon. This may be a delicacy to some, but I found it repellant and spit it out. The gribiche was okay but it didn't matter because of all the rest.  Then as quickly as we could go to the quickly cooling pasta...  Sigh.  The gemelli, my dish, was in the style of Cacio E Pepe ('cheese and pepper' - pecorino and grated black peppercorns), one I adore. It was over cooked, over-cheesed, and the sauce had seized and separated. Terrible. The proportion of pecorino to pasta was all wrong. I happen to put too much cheese on most of my pasta so for me to complain about it here is (almost) stunning. In addition to that, the sauce tasted lemony - so maybe they added lemon (which is not Cacio E Pepe), I don't know, but it was dreadful. As to the pasta itself, I absolutely demand al dente. Yes, the pasta was briefly set aside to pick through the fritto misto, but this pasta was too soft because it came out overcooked.  The date had the linguini with mussels, pancetta, and toasted coriander. The date is a soft touch who likes almost everything she tries in a nice establishment like this one. Her pasta was not as overcooked as mine, but she said the sauce was so sour and nasty that it tasted like vomit. Seriously, she said vomit. I have never heard her describe anything like that before. I tried a bite and it *was* vomitous - it had the raw, uncooked taste of poor quality tomatoes right out of a can. Sour like bile - hence, vomit.   Okay, so the pasta experience was awful - so awful that I actually complained to our waitress. This is also a first. I swear on the lives of all the puppies in the world that I have never done anything like that before. To the restaurant's eternal credit, they took both dishes off our bill. In retrospect, we ate almost none of either so that just makes sense - but I certainly did not expect it and I respect the integrity of the staff to make this decision without my request.  Some might say that every restaurant can have a bad night. I don't care. I don't have the time, inclination, or money to care - as professionals, I really don't think a restaurant deserves a bad night - or at least as bad as this one was at points in the evening.  In closing, but for the pasta dishes, this would have been a fine experience. The space is great, it's charming to see how they fit an open kitchen in there, the cannoli was very good, the house 'Cappuccino' still a treat, the service very good, and the cocktails quite excellent. This is why I cannot go below 3 stars.", 
    "review_date": "2014-12-20"
  }, 
  "fvM08uRbB6-jobLMEkfhAw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sam E.", 
    "review_text": "Oof. We wanted to love this place. My boyfriend raved about the bar it used to be. In its new incarnation, it was pretty sad.  1. Ordered wine and a cocktail. Wine came right away, with a ton of sediment in the bottom, and the cocktail came 15 minutes later.   2. Ordered the chicken liver, which came out fast and was the highlight of the event.  3. 50 minutes later our one pasta dish had still not arrived.   4. Ordered an old fashioned, which came 10 minutes later almost HALF full, including the enormous (we're so fancy) ice cube. So it was basically two sips for $12. I like to think they spilled most of it and just sent it out anyway.  5. Switched to a chianti, which came out ICE cold. Like, your hands are too cold to hold the glass cold.   6. The pasta dish we waited so long for was: Gemelli, black pepper, pecorino toscano. That is fancy talk for mac &amp; cheese. Now I know. I huffed it in 45 seconds and then wondered if it would be another hour until we ate again.   7. For a main I ordered the pork sausage with squash, brown butter &amp; sage. Thank god for that squash b/c it was very good and could be used to mask the sausage, which was moist in a really odd way. It almost had the consistency of a pate.   8. For dessert, instead of getting out of there, we ordered gelati and a coffee drink they're all proud of. Ten full minutes after we had finished the gelati, the coffee came.   We were there for two hours. There were so many missteps along the way, both in service and in food.   My least favorite part of the event actually happened twice, to my surprise. This was that the waitstaff smeared food ONTO our table as he attempted to be fancy and wipe up crumbs. It was so gross.   TL; DR: slow service, weird food, bad at drinks, smeared food onto the table twice.", 
    "review_date": "2014-11-19"
  }, 
  "lfFmv3vZAflRnFMywEKu9g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erika F.", 
    "review_text": "Overall we did not enjoy our meal.   Positive: The olives, wine, and cocktails. The specials were tasty: a rigatoni dish with fresh tomato sauce and mozzarella and focaccia.   Negative: Too loud for conversation. The service was inexplicably slow. The chicken liver skewers had an off flavor and were not cooked through as we had requested (served medium-rare). The linguine with clams was bitter. The salmon was far too salty. The roasted carrots were overly sauced and underdone.  An unfortunate dining experience for 2 locals and 2 visiting from out of town.", 
    "review_date": "2014-09-29"
  }, 
  "7v8H8b03IUNBDVl_bSy7KA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark C.", 
    "review_text": "The food is great but the staff is truly lacking. We asked to be put on the list for a table (and were happy to wait) but the hostess (seemed very inexperienced) failed to advise she would text us but not walk the 10 feet to get us. No problem, we decided to eat at the bar. Except the distracted bartender forgot to put in our order (until we asked about our order an hour later and watched him put it in without apologizing). Overall, stressful three plus hour dinner at the bar. So sad given the quality of the food.", 
    "review_date": "2014-09-30"
  }, 
  "tSp5RGbfoVcjZUWZPrU6eA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rosie F.", 
    "review_text": "Tried the new Tosca and will NEVER go back. Took over 25 minutes to get a drink and it was so watered down and expensive...and it wasn't even that busy as it was before 6pm. Food menu is so uninspiring and too expensive. Go to North Beach Restaurant if you want good food or any of the many other great restaurants with outdoor cafes and character in North Beach.", 
    "review_date": "2013-11-23"
  }, 
  "L4i0pVaeXgMSCcD3vyXplQ": {
    "user_rating": 1.0, 
    "user_location": "San Anselmo, CA", 
    "user_name": "robert d.", 
    "review_text": "Very very disappointing. It still looks great. And the Booths are fun. So its a great setting but the food ranged from mediocre to poor. Fatty lamb. Undercooked fish. Overcooked potatos. With so many great places to eat in SF this place just isn't worth it. It was better as a bar. Good Italian wine selection but the food menu is poorly conceived and not well executed", 
    "review_date": "2014-02-22"
  }, 
  "OtbooagsCGPM00ZbDOyPgw": {
    "user_rating": 4.0, 
    "user_location": "East Bay, CA", 
    "user_name": "Jason F.", 
    "review_text": "What is the best way to describe the Tosca Café? It's a legendary stop in San Francisco's North Beach that any native and quite frankly any tourist has to hit the next time they are walking the famous Columbus Avenue.   My friend and I arrived at 5:30pm on a Friday evening and the place was already packed. (And they only opened at 5pm!) It was loud and the crowd was a we bit tipsy already. By the time we left by 7pm the place was hot, suffocating, extremely loud and absolutely overflowing with people. A place with the narrow bar all the way in front and the main dining room in the back does not provide for great aesthetics (or great breathable air for that matter), but then again this place is well, shall we say, \"vintage\" so like a fine wine we should celebrate the fact that it's still alive and kicking with providing great drinks and delectable dishes.    We managed to weasel ourselves two barstools to drinks and food. As for drinks since we were at the bar, my friend and I had try Tosca's world famous \"House Cappuccino\" a hot totty if I've ever had one before. It was rich and strong, just like I thought it would be. For the bar bites, we decided to try the roasted beets with pesto, the Frito Misto with clams and prawns, and the grilled polenta with heirloom radicchio. My friend said it best when she declared it was \"one of the best meals\" she's ever had in her life. Quite the high praise Tosca's. I too found Tosca Cafe's menu delightful and rich with flavor and meaning. Star chef April Bloomfield's menu has clearly has a purpose and it's not just geared towards the casual tourist or barfly.   So that's a very good thing. Since the place is so popular now it tends to fill up very fast and gets loud even faster. The place is popular now with locals and tourists alike. In this case, the place is no longer the romantic gem of North Beach. But still I plan on returning in the future, so I can sample their pasta dishes and more of their flavorful bar bites.", 
    "review_date": "2014-12-22"
  }, 
  "WeWbt17LJ40HGGEOW_7qrw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charles D.", 
    "review_text": "Complaints about wait and prices are understandable, to a point. You people stay away and those of us willing to enjoy a cocktail or two at the bar before being seated will stretch a bit financially and have a terrific meal and an extraordinary evening. One of SF's unique places.", 
    "review_date": "2014-06-15"
  }, 
  "9Jc9yJ3EbCP0ancpazHBfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ian C.", 
    "review_text": "Would have given a 5 except Darren K the server was far from the sharpest tool in the shed.   He knew the menu in detail but his ability to forget to deliver items was amazing, he wasn't overworked as there are plenty of staff, he just didn't show up mentally and would often disappear.  Were it not for the bus boy helping him, last night would not have been a great experience.  Food AMAZING though.  Hopefully the owners are reading, basic training and monitoring of customers at tables will fix this, will be back for sure.", 
    "review_date": "2013-10-16"
  }, 
  "2s6DVB4YgDyDuNX_FbAHFQ": {
    "user_rating": 5.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Tyson H.", 
    "review_text": "One word....Jordan! That's all you need to know if you plan to eat here. My girlfriend and I ate here on our last night in San Fran. Our waitress (Jordan) was fun, and kept us highly satisfied the entire time with drinks and food. Not to mention, she's not bad to look at. If you're looking for a good date this is the place to go. I recommend the big tails as a starter. In fact, I just recommend you eat as much as humanly possible at this place. It's just that good. Way to go Jordan, cheers to you for Making our last dinner so awesome.", 
    "review_date": "2014-07-14"
  }, 
  "jKb91dWICYsTaN567XJCnA": {
    "user_rating": 2.0, 
    "user_location": "East Williamsburg, Brooklyn, NY", 
    "user_name": "Emmanuel M.", 
    "review_text": "Salty. We ordered a lot of food and every dish was over salted.  I left with my lips burning and a pretty bad stomach ache.  Honestly the food seemed really good on the menu, and the pork dishes were pretty delicious had it not been so salty! We didn't even order dessert just in case that was also over salted.  Very disappointing meal. The ambience also didn't help, I am not a fan of a place where the staff makes it feel stuffy and uptight.", 
    "review_date": "2014-06-08"
  }, 
  "RKfETgoe0wuZds8EMDBw0Q": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Marcus K.", 
    "review_text": "This place considers itself rustic italian.  Not sure what that means except it was interesting to try the pigs tail.  Also had a polenta dish.  Not sure why I got it since I am not a polenta fan.  Wanted to give it a try but did not like it.  Turnips however were great.   The bar tender was top notch.  I went for the tenders choice and we got two creative drinks.  One was the chokehold.   Wish I remembered what was in it but it was good.  The other drink was Hotel National.  Not quite as memorable.    Worth a try.  If the wait is too long for a table, grab a seat at the bar.", 
    "review_date": "2014-09-09"
  }, 
  "yAddvlqyzO_puuL1kZStHA": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "John G.", 
    "review_text": "Uneven experience. Other comments on the high salt levels were on point - on a few dishes the salt was overwhelming.   Service started strong but timing began to slip as the meal went on. I'd consider going back for snacks and drinks, but they aren't delivering a full meal that is legitimate at the price point.", 
    "review_date": "2014-08-24"
  }, 
  "9U30DANobkrn3Zlu6T9p6Q": {
    "user_rating": 4.0, 
    "user_location": "Boston, MA", 
    "user_name": "Jeff F.", 
    "review_text": "The 3 star average is insane. I new nothing about Tosca Cafe until my buddy started talking about some bar he used to post at regularly that was a San Francisco institution reopening w/ a restaurant serving April Bloomfield's grub. Posted up at the bar for dinner. Here's the rundown:  - Crispy Pig Tail - pass  - Off Menu Meatballs &amp; Foccacia - double yes  - Radishes &amp; Tuna Conserva - fantastic  - Market Salad - perfect  - Bucatini - a must  - Roasted Chicken for 2: I rarely order chicken when I'm out to eat, but the salmon and steak weren't doing it for me. Chicken was great and keeping the feet on was a nice touch.   Put this on your shortlist.", 
    "review_date": "2014-09-13"
  }, 
  "w_o3zjPJeBEuDnFRiCXTTQ": {
    "user_rating": 5.0, 
    "user_location": "Cary, NC", 
    "user_name": "Karl M.", 
    "review_text": "Excellent drinks.  Spectacular pasta.  Super cool vibe for the boy from Carolina. We sat at the bar, ordered the bucatini, broccoli and roasted potatoes.  Wasn't super hungry so we passed on the apps but saw a few come out and they all looked great.  Bar tenders are superior and deliver awesome cocktails with an appropriate amount of drama.", 
    "review_date": "2014-09-19"
  }, 
  "aqWXHhcR_CdmKmxggFOlEA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wendy L.", 
    "review_text": "What a great spot! Dim lighting, but not too dark; dark wood, great vibe.   My friend and I showed up for dinner on a Thursday night around 8:30 p.m. - no reservations or anything, and the wait was over an hour. But food is served at the bar, and the bar is first come, first served; we found a couple of seats at the bar and were able to sit immediately.   We had prosecco, the speck and citrus salad, bucatini with guanciale and cauliflower gratin. Both the bucatini and the cauliflower gratin were both so great. The bucatini had some good bite and chewyness and not overly saucy. The cauliflower gratin was rich but somehow you feel okay eating it because it's cauliflower...  I don't find myself in North Beach very often, but if I did, this would be my go-to spot for drinks and bites.", 
    "review_date": "2014-03-09"
  }, 
  "zT7t1ECcvP88KCGSw_c42A": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "emme n.", 
    "review_text": "I went here for my fiancée birthday and we really enjoyed ourselves. I had the best pasta in my life, it was the rigatoni and it hands down best the bucatini. At the end we had wished we ordered more food!", 
    "review_date": "2014-11-24"
  }, 
  "B7xDljCT-OS_qaJtTtBdPA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "K T.", 
    "review_text": "I went here for our joint bdays with one of my besties. She said it got really great reviews and she was really excited about it.    The kitchen is interesting and it's a cute trend place. I'm a fan for sure, the bar got packed at around 9pm and there were attractive people on a Sat. Go with the paid parking down the street though unless you are feeling lucky. Can never find parking.", 
    "review_date": "2015-01-06"
  }, 
  "7OcRn5dPm2IlKUkEMtQvWw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SY A.", 
    "review_text": "Three of us stopped by around 5:30 Sat. evening to find a very nicely cleaned up Tosca.  We were dying for an Irish coffee, &amp; had a hard time communicating this to the server, for some unknown reason.  I am a native San Franciscan,who grew up, so to speak, on Irish coffee at the Buena Vista, &amp; assumed Tosca would know how to make them.  They finally arrived, but without the \"float\" of cream on the top, &amp; luke warm, at that.  When the bill came, &amp; we saw $40.00 for the three, we were shocked! The price of the food is also over what one would expect, &amp; I'm not willing to eat there after the first impression that , frankly, left us cold!!  Skyking", 
    "review_date": "2013-10-14"
  }, 
  "eAavwM32i2h7sNNer--kGw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren S.", 
    "review_text": "I saw this restaurant advertised on a website I subscribe to. I had high hopes, seeing as the description and pictures sounded and looked pretty good. My friend and I went in on a Tuesday night and I realize that I didn't have a reservation, but we had to wait for over an hour. On a Tuesday night!   Once we were seated, a member of the wait staff brought us water. He was very friendly... at first. When our waiter came to take our order, my friend and I had already had a chance to look at the menu and knew what we wanted. Our waiter read out the specials of the day, and when he had finished, we told him that we were ready to order. He then said to us, \"So I just wasted my breath then.\" RUDE!!! When we told him what we wanted, he asked us if we wanted anything else to go with it, and we told him no but we would let him know if we changed our minds. He was very persistent and weird about telling us multiple times that if we wanted to order anything else, we had to let him know NOW because the food has to all come out together (what he should have said was are you sure you don't want anything else to go with your pasta, the portions are on the smaller side). I don't know what his  deal was. He then proceeded to walk over to where the host was standing, whisper something in his ear, and then they both turned to look at my friend and me in an obvious way.  Summary of our experience there: WEIRD. Not going back. Ever. Wait staff was weird, not to mention RUDE, food was expensive for such small portions, wait time was long, some of the prices for food was not the same on the menu as online menu.  Most likely will NOT be returning. What a disappointment.", 
    "review_date": "2013-12-05"
  }, 
  "opPL44lvjw_sBMxkGkM4-Q": {
    "user_rating": 3.0, 
    "user_location": "Bethesda, MD", 
    "user_name": "H. L.", 
    "review_text": "In short, food - 2 stars, drink - 4 stars, dessert - 5 stars, service - 4 stars.  We went Tosca for dining, not for drink.  Unfortunately, all the dishes we ordered were too too much salty though the flavor was good.  However, Tosca is still in my list.  I will try again.", 
    "review_date": "2014-01-30"
  }, 
  "xTdIxiANFE6bQQaNhGJHBg": {
    "user_rating": 3.0, 
    "user_location": "Downtown, Los Angeles, CA", 
    "user_name": "Sarah H.", 
    "review_text": "Love this place for the decor and the bartenders, not so much for that crowd, at least on my most recent visit.   Drinks are a little pricey but well made and delicious. I love that the new owners kept the original feel of the place.   Another one of my favorite stops in that neighborhood whenever I'm in town. Lots of other great places to check out in the immediate area.", 
    "review_date": "2014-11-16"
  }, 
  "kbtWpV_hc9U7LWdDhDqu7Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kim K.", 
    "review_text": "Loved it before, and still love it.  An SF gem. I'm glad they didn't change the interior too much with the renovation.", 
    "review_date": "2014-03-03"
  }, 
  "VJ0fP8DlN4YeFkh0y1iciw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maurice B.", 
    "review_text": "Spectacular Italian food.  Everything we had was exceptional.  Service Top notch.  Meat platter enough for 4.  Pasta delicious.  Small plates but enough to share.", 
    "review_date": "2014-07-24"
  }, 
  "2_ZGgdMoavEW3KxS-c2FxA": {
    "user_rating": 3.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Paul T.", 
    "review_text": "Cannot rate them on food yet, but just based on the bar scene.  All the new changes as now being a restaurant seem to be a successful venture. However, it's definitely lost its old SF charm.  Crowd is there because they want to be seen.  The drinks are good, but pricey but you're in SF so....   Other than wanting to be seen by \"people\" and paying too much for drinks, it's not worth it.  A good time can be easily had is a half a dozen places in North Beach simply by walking aimlessly.  I will go back to try the food, but Tosca will be only a memory now for what it used to be.  But, good for them that they are packing the house.", 
    "review_date": "2014-12-07"
  }, 
  "qIrgZ_iSRMyMOkJq5xt_8g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lewis F.", 
    "review_text": "Note to Yelpers:  if your review is more than 3 paragraphs, I won't read it.  This is not Bon Appetit magazine. Get in and get out people.  Now, Tosca . . .   Food:  Why only 3 entrees on the actual menu, with 5 specials announced by the waiter?  Just print a daily menu with the specials included.  Don't you have a printer?  The food overall was very good.  Caesar, pasta and meatballs all above average.  Cocktails were inventive and top notch.  Service:  I would refer to it as hipster indifference.  Bearded waiters just didn't seem that interested.  Never asked how we were.  Took forever for focaccia bread.  Brings dessert, but not coffee.  Coffee (excellent) comes after dessert is gone.  3 different waiters served us, when all we needed was one good one.  Price:  Not cheap and the portions are pretty small.  Sadly I have gotten used to paying $ 100.00 for me and my girlfiend to have a fancy snack.    Not sure I would go back, considering the lame service.", 
    "review_date": "2014-06-05"
  }, 
  "RhUQ1Vz3-bDMLbIGlcyzfA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "CJ G.", 
    "review_text": "Tosca Café redux: better than the original.  From all the coverage in the traditional media and the blogosphere, you might have confused the re-opening of Tosca Café with the Second Coming.  No, it's just a re-take on an iconic North Beach restaurant / bar.    While there are now great food offerings at Tosca Café, the star, as before, is the bar.   Isaac Shumway has created a cocktail program based on the classics:  from the Casino Bar negroni ($12, Beefeater gin, Campari, Antica Formula, and orange peel) to the aptly named suffering bastard ($12, almanac, St. George Terroir gin, pressed ginger, lime, bitters, and soda), they are all good--maybe too good.  There is a fine selection of wines by the glass and by the bottle, and with Drakes IPA ($8), Borgo oyster stout ($11), as well as other offerings, beer aficionados will not be disappointed.  Chef April Bloomfield's food is almost as good as the drinks.  The bucatini ($17) with tomato, chili pepper, and guanciale was delicious. While it may not give Zuni Café a run for its money, the roast chicken for two ($42) is succulent and juicy. However, despite the accompaniments of mushrooms, mascarpone, and parmesan, the grilled polenta ($17) was a little disappointing.   While well-meaning, service was a little confused: servers, bus personnel, hosts, and bar staff need to learn the ins-and-outs of their positions.  Pacing of courses was a little off, but the timing errors were not egregious enough to destroy the experience.  Buzzing again with life, the all new Tosca does justice to, and improves upon, memories of days past..", 
    "review_date": "2013-12-31"
  }, 
  "LbXPxx2HwO9yz7RkOQP3QA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kerry F.", 
    "review_text": "I want to like it. I mean Beyonce ate here. But alas, I felt like it was disappointing.  First of all, our server had no menu knowledge. When asking for recommendations, he could not give anymore information than that which was already printed on the menu. This is the kind of place where the cocktails are way better than the food. So cocktails maybe should get 4-5 stars.  Foodwise, we got.... Pig tails - gross. So greasy. We didn't even finish these. It was honestly like fried bones. pickled veggies - came in a very small teacup, meh. 3 pastas: Bucatini, Rigatoni, Linguini. All of which, were lacking in real depth of flavor. They were all oily and oversalted.  bottom line: come for drinks only. the food is kind of expensive and it is subpar italian cuisine.", 
    "review_date": "2014-09-06"
  }, 
  "QOMoA_G5PBrUA_WXu1ZdIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Debbie C.", 
    "review_text": "What a great job on new tosca! Been here twice since renovation and enjoyed the drinks and food. Food is  on a greezier/cheesier side which is good for drinking:) takes forever to get your order too. They are busy!! Will come again yes!", 
    "review_date": "2014-02-13"
  }, 
  "qHmLQQZF1GKrU6HFZqZqGA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela D.", 
    "review_text": "Dined here in the private room on Christmas Eve and our group of 9 had a pre-fixe 4-course menu.   To start- Crispy Pig Tails- really delicious and oh so fatty! \"Point Reyes Blue\" Salad- there was a lottt of blue cheese! House-baked foccacia- we asked for refills like 3 times. Fresh and addicting.  2nd course- Bucatini. Wow, the pasta was amazing! The perfect bite and just enough sauce. Highly recommend getting this dish.  3rd course- Whole Roasted Chicken. (Broccoli and Crispy Potatoes as sides) The chicken was so moist! Their marsala sauce was perfect atop the chicken and sides. The crispy potatoes were fried in pork fat- reminded me of my favorite potatoes at Plow except more fatty and fried!  4th course- Tiramisu with orange zest. A perfect end to the meal! There was definitely a lot of rum which we all loved.  As in other reviews of the restaurant, the service was spotty but not entirely horrible. It was tolerable but there were some long pauses in between courses and getting refills of anything.  Overall, a solid 4 stars and definitely want to try their famous \"Cappacuino\" next time.", 
    "review_date": "2014-12-29"
  }, 
  "yKF3gzA8MxJO54RA-S2Uxg": {
    "user_rating": 1.0, 
    "user_location": "Corte Madera, CA", 
    "user_name": "Des D.", 
    "review_text": "Used to be a nice hang-out and part of a wonderful varied group of area pubs - Mr Bings, Specs, Vensuvios, Tosca...  Cross Tosca off the list, it thinks its hip but has become very uncool - barmen all bearded; crowded with the \"IN CROWD\"; long waits for drinks (about 20 minutes for the CAP).  The heart and soul of the place has been ripped out, same basic look but no life.  We were sad to see it this way, finished our drinks and moved on.  Not worth a return visit for anyone that used to go, and hardly worth the visit for visitors to the City.", 
    "review_date": "2014-06-07"
  }, 
  "xPd-lodXhvc6SHuUkfX3mQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Audra S.", 
    "review_text": "I have to commend the group that did the renovations of Tosca. It still has the classy vintage feel, warm and inviting. It was nice to see the gigantic vintage steamer machine sitting at the end of the bar first thing upon entering. I remembered the old warm cocoa and brandy drinks we had one late afternoon when I came in with out of town friends to escape the cold, foggy, wet mist about two years ago. The bartender back then was an older gentleman, who had lined up about 12 of those cute vintage glasses, which they still use, (Yay) and was filling them with some kind of powder. I remember thinking it looked like nestle quick mix. Back then it felt charming.   Last night, the first time going back there since they reopened, I missed the old gentleman immediately. He doesn't work there any more. The new staff was friendly enough, I love the crisp white jackets they wear, but I found it annoying that the gal bartender was texting in front of me. I must be old fashioned. She recommended I give the house cappuccino a try, and it was so much better than the nestle quick one I remembered. Better than charming. Truly a little piece of heaven and worth the $12.   We did not order any food so I can not comment on that. The 3 star review is because the modern music, which I love in other locations, felt discombobulated in a classy vintage environment. It was later in the evening though and there was a young crowd...I get it. I'm young too, but I wanted the throwback-nod-to-a-more-gentile time, experience. The two person ladies room with the door that locks really sucks. A woman went in and locked the door with just herself in there. Maybe she was sick? Maybe I should say thanks for not letting me hear you do something nasty? Maybe they should take the lock off the door?   I will say the hand soap in there smelled wonderful. I kept smelling my hands all night. I need to eat food before I pass judgment and get too negative. Plan to go back earlier so we can really appreciate the full experience and hope they play some old big band tunes or something like that.", 
    "review_date": "2014-04-03"
  }, 
  "08mOpJRCpZe3D8UHszP4FA": {
    "user_rating": 2.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Ann L.", 
    "review_text": "Checked out the newly reopened Tosca Cafe.  We got there around 6pm on a Sat and the place was super busy, was told an hour wait.  Gave them a cell number to call us when a table was ready.  Got the call to return back for our table almost 1hr later.  They have a music jukebox, I couldn't get it to play, but I think it does work.  FREE still or sparkling tap water.  That's nice.  We got sparkling.    Tried out:  Oxtail terrine $8 - tiny portion of some cubed oxtail meat and other stuff, served cold.  Pretty gross, Skip it.  Cesar salad $12 - tiny portion of salad, I think barely enough for 1 person, 2 people not enough for both.  I did like it, but not for $12!  Rigatoni pasta $16 - tiny ass portion again, too al-dente for us, we didn't like it much.  Bucatini $17 - small portion of the pasta, we liked the taste though.  Overall, overpriced &amp; tiny portions &amp; super LOUD in there, Won't be back.", 
    "review_date": "2014-05-20"
  }, 
  "R_IvZ-PrpXd3uSSnxANFYg": {
    "user_rating": 5.0, 
    "user_location": "Danville, CA", 
    "user_name": "Kathy H.", 
    "review_text": "Wow....Let me begin by saying,\"After reading several Yelp reviews and the initial vibe I was getting when first entering the restaurant, I was skeptical.\" (When we get caught in traffic driving into the city for 90 min., it's frustrating to arrive just after the restaurant has opened and wonder if we'll get a table - just a personal challenge of mine.) Fortunately, I had the chance to sit at the bar for a bit and unwind before my husband met me. A friendly bartender greeted me and shared the cocktail and wine list...even offered a taste of Italian wine. After he offered to mix me up something special, I requested a margarita. (I know, not very adventurous.) From the alcohol offerings on the menu, I assumed they would have some tasty tequila. Margarita was delicious. Just the right mix of tart and sweetness. The man sitting next to me noted Tosca's bar menu included a very rare Bourbon - $50/glass. Upon checking in with the host, the restaurant has a policy that you cannot be seated until your entire party arrives. Unless there's valet, parking is never easy in SF. As I watched parties arriving, I assumed there was no way we would have an opportunity to be seated in the restaurant without a long wait. Fortunately, my husband really wanted to try this restaurant, so once he joined me, we relaxed at the bar, enjoying drinks and conversation. You often meet friendly and fun people sitting at the bar. We chatted and shared experiences about other nearby restaurants. I began to relax and decided not to stress over the wait. We could always eat at the bar. We ended up being seated in the back of the restaurant. My husband is all about ambiance and atmosphere. He would have preferred to sit in the front and more active area of the restaurant, which gives one a look at the open kitchen, however, it was nice to hear our conversation and check out all the pictures of famous people who we gather frequented Tosca Cafe in the past. Given what we've read in the foodie and SF Magazines, Tosca Cafe has been around forever and the likes of Sean Penn, Mickey Rourke and others, out of sight from the front of the restaurant, played pool and talked late into the night. As we ordered, chatted with Jordan, our server, you could imagine the nostalgia of years past. Our selections included warm rolls, meatballs, grilled polenta, asparagus and clams. The rolls, doused with olive oil, garlic and parmesan cheese came out with the meatballs. OK, so I'm Italian and make meatballs, which I've been told are pretty tasty. I've never had meatballs that were as tender and perfectly seasoned. Amazing flavors. I could have stopped after that course. The polenta was served with delicious mushrooms and the asparagus was grilled and topped with parmesan cheese and almonds - also perfectly seasoned. Finally, I believe it was Manilla clams in a scrumptious tomato, garlic and onion mix that completed our delicious tastings. Desserts looked inviting, however, we were stuffed. It was probably that extra order of garlic rolls. The only comment (and it's not negative) that I offer for people interested in eating at Tosca Cafe, arrive early and together, if you're hoping to get seated in the first round, otherwise prepare for a wait. Tosca does not take reservations. Our very competent and friendly server did say that the rear area of the restaurant can be reserved for larger parties, etc. Tks Jordan for a delightful first experience at Tosca Cafe. We'll return and bring friends.", 
    "review_date": "2014-05-24"
  }, 
  "1A-geB-PQr1uveSFOS7Feg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachael S.", 
    "review_text": "Expect a long wait.  We were told the wait would be up to 3 hours on the Saturday evening we stopped in.  Rather than wait for a table, we grabbed a seat at the bar.  I think if we go back, we'd do the same; in our opinion, the ambiance in the bar section is actually more inviting and cozy than the dining area.   We ordered an appetizer - however, we dined here months ago, so I frankly can't remember what it was.  The real stand out of our meal was the roasted chicken (takes over an hour once you put in your order, so plan ahead) and the duck fat fried potatoes.  Those potatoes - oh my gosh, so tasty.  So crispy on the outside, served pipping hot - and the flavor...outstanding.  I want to go back if not only for those fried duck fat potatoes!  Also - excellent drinks. The service was also great.", 
    "review_date": "2014-10-01"
  }, 
  "_0UXptnf1DtCqqYByMBS0Q": {
    "user_rating": 5.0, 
    "user_location": "Paradise Valley, AZ", 
    "user_name": "Kelli D.", 
    "review_text": "Went here on our first night out in SF and were welcomed by knowledgeable, friendly and super fun bartenders w a trendy and fun ambiance.  They made us feel right at home, suggesting drinks and giving us taste tests of their incredibly unique beverages! I loved everything about this place. Our main bartender had just moved there from Australia and could not have been a more interesting and cool person to chat with while he whipped up some amazing elaborate drinks. Customer service people. ITS SO SIMPLE! Sadly a lot of places miss that concept.   We wanted to go back again before we left but never made it in there but I would recommend this cozy spot to anyone venturing out in the city!!!", 
    "review_date": "2014-06-24"
  }, 
  "OGUBC7uz8yqySaCZDK8tsg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rene B.", 
    "review_text": "The bar and cocktails are great but somehow when you cross that threshold to the restraunt the vibe changes.  Snippy host, decent service but terribly over priced, mediaocre food .  The price point is similar to Perbacco or other top Italian establishments but not even close in quality.  I'm very disappointed in M Bauer's review as he is clearly cow toeing to the NYC food mob.  Try the food, judge for yourself.", 
    "review_date": "2014-02-22"
  }, 
  "vurvJX_rVIvGSdAgeGtqKA": {
    "user_rating": 4.0, 
    "user_location": "Walnut Creek, CA", 
    "user_name": "Jeff F.", 
    "review_text": "Tosca cafe, newly renovated by chef April Bloomfield has brought contemporary Italian dishes to North Beach! We started off with the deviled egg. Perfectly balanced, good flavor, not going to change your world. Meatballs and foccaccia are not on the menu, but you can order them anyway. The meatball is tender and juicy, but the sauce is the star of the show. Foccacia is humongous, nicely salted and seasoned with rosemary. The buccatini is small, but incredibly rich. The guanciale is crispy and adds a pleasant crunch. Try the linguine and clams, nice and light, again on the small side portion wise, but it's rich. Come for the cocktails, the \"cappuccino\" has no coffee in it. Try the \"dirty\" if you're looking for a coffee buzz. The decor is too dark to snap instagram photos so don't bother. This place is pricey and will not blow your mind. It is however, a solid place to go for apps and cocktails.", 
    "review_date": "2015-01-23"
  }, 
  "d8A4EU8sJlKsRAFYYyCO4A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rose T.", 
    "review_text": "This has become one of my favorite places in SF.  I love the old school vibe and the food is awesome.  The best is the minestrone soup, quite possibly the best soup I've ever had.  I order it as my entree with some vegetable sides and the super yummy focaccia bread.  If they have meatballs as a special - those are a must have.  They actually take reservations and they're on Open Table..  It's a small restaurant though and there aren't many tables than can seat more than 4 people.  It's easiest to get a table for 2.", 
    "review_date": "2014-10-14"
  }, 
  "hXC3vuCPWUCCtfa_Fsug2Q": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Spencer M.", 
    "review_text": "So I promised the staff that I would write a review because they treated me so well. It's also better late than never because I went some weeks back and maybe they forgot my promise.  Anyways, they did me well and I really appreciated their services. It was almost as if we were old friends (cheesy,  true though).   They called me by name and checked up on me for drinks, for food and getting a table. The atmosphere was amazing and the place was packed but they diligently brought us our drinks and were sympathetic about the table wait.  I didn't mind at all because I was getting down on their delicious drinks.  I got the good booth table with tasty entrees and played some good tunes on the free jukebox.  All in all, thanks to the staff and hopefully you remember that I remembered.  Spence", 
    "review_date": "2013-10-30"
  }, 
  "9o_ePu9wfQZFpnE8Nss27Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bianca P.", 
    "review_text": "Echoing the underwhelmed sentiment.  Following the Bon Appétit write-up and rave reviews from friends I was prepared to have my world rocked, but to no avail. Over-seasoned, small portions, and checked-out service.  I was with a party of four that started off sharing several small plates to begin, as well as some house cappuccinos all around. Cappuccinos were alright, nothing that I would write home about. We shared meatballs, focaccia, fried artichoke, and the crispy potatoes. Focaccia and meatballs were great, but I will definitely say any sharing of the small plates (antipasti) is best done between two people. You'd need at least two orders of everything we had to constitute a decent serving size per person, even just for an appetizer.  As for the artichoke, I could not taste the mint or oregano for the life of me. The red wine vinegar overpowered any other flavor that could have possibly come through. Crispy potatoes were so crispy they were difficult to bite into by the time they got to our table, and way too salty.  All around we had a decent meal, but if you're going to be touted as one of the best new restaurants in America by such a respected food publication, you had better be ready to deliver on the title.", 
    "review_date": "2014-11-03"
  }, 
  "mrXim_3tiYt3FuIf3lSRYA": {
    "user_rating": 4.0, 
    "user_location": "Piedmont, CA", 
    "user_name": "Tyler J.", 
    "review_text": "Just got back from the bar. Got there at 5:10 and sat right down. When we left at 5:40 place was jammed.  The room is great. Perfect 40's vibe. Busy but not loud.  Ordered a Corpse Reviver. Bartender said \"1 or 2?\"  Yes there are two versions and we wanted the \"2\". Drink was perfectly chilled and right on. She knows her booze and it was fun to watch her work.", 
    "review_date": "2014-02-15"
  }, 
  "QLd5JVa5bt2PamRe5onH2A": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Ji Y.", 
    "review_text": "The moment I feeling now love this place now I walked in. it is the fact.... Is so classy and old school make you happy. if you forget about these things when you visit all these hip new restaurants in SF.   Otherwise .... The food, drink, staff quality and enter the service is great and responsible. The all drink have picked and the enter drink was so tasty.  Gone ...... and earned.", 
    "review_date": "2014-01-20"
  }, 
  "Kr9TSi4vz6SHDuPfORtjzw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jake A.", 
    "review_text": "The food was horrible and the service mediocre at best. The hostess was the only good thing at this restaurant. Inedible fritto misto, unless you like eating crustacean shells. We would never return. Nor should you.", 
    "review_date": "2014-12-29"
  }, 
  "GnkhVQoyUgFtnpBE_gnk3g": {
    "user_rating": 4.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Alyssa Y.", 
    "review_text": "I'm really surprised by the negative reviews! I recently moved to the Bay Area from NY, and Tosca is one of the few restaurants in SF that I happily return to again and again. Sure, don't go on a Friday/ Saturday night as it'll be overcrowded and too noisy. But it's like going to bars-- you have to go on the off nights for the best experience, service included.  The food has been consistently delicious every time I've been. Their antipasti are perfect to nibble on with your cocktails, and be sure not to leave without their fresh pasta (I recommend the bucatini and linguini). Vegetable sides are fresh and well seasoned. Stay a little longer, and order a Suffering Bastard and Trouble in Paradise!", 
    "review_date": "2014-06-09"
  }, 
  "J26rLFEmURqUVADQYYxqBQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fzarond K.", 
    "review_text": "This is a fun bathroom mainly because of the marilyns everywhere. Interesting that there is a lock for a 4+ person bathroom. One of those superpower air dryers. No towel option.", 
    "review_date": "2014-05-08"
  }, 
  "3G9Jkn7hKc8fmbdK8_lC8g": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Regina C.", 
    "review_text": "after having changed hands Tosca Cafe cannot be held to their old standards. sure the dishes are more expensive but their quality has increased as well. April Bloomfield's people have done a great job keeping the menu simple and executing them well. i've read plenty of reviews that complain about the salt content but during my dining experience there the only thing that was overly salted was the fat fried potatoes. everything else from the succulent, juicy, full of flavor meatballs to the perfectly al dente bucatini and vegetables were well seasoned. i thoroughly enjoyed dinner at Tosca. the server was great and well informed about their wines and the hostess made sure to coordinate with the server when i handed them my credit card earlier in the evening so that i could force payment before my boyfriend's parents got to the bill. fantastic! no wonder Bon Appetit named it one of US's top 10 restaurants of 2014!", 
    "review_date": "2014-08-21"
  }, 
  "qe9OwFZHNI8fS73li2nY-g": {
    "user_rating": 5.0, 
    "user_location": "Brookline, MA", 
    "user_name": "Isabella G.", 
    "review_text": "One of the best dining experiences of my life. I went with just my mother, and we definitely got more food than was necessary. But it was so hard to choose what to get because it's an amazing menu. To start we got giardiniera, meatballs, focaccia. For the larger plates we had the skirt steak, lumaconi, and roasted beets. For dessert we shared the dark chocolate sorbetto and a coffee gelato (we might've mixed them like children). For drinks I got a moscow mule and a glass of Vallana Spanna. Every time I began to taste something I would freak out, but I seriously had to try and not make a scene in front of the waitstaff. It's been two weeks since this meal, and I am still thinking about the brussels sprouts in the giadiniera and how they have no bitterness at all and only taste like their pickling juice, which was so subtle and sweet and spicy. Those brussels sprouts are haunting me. The focaccia is by far the best I've ever had. It's lavishly covered in really strong olive oil, it crackles when you bite into it, but it's so warm and doughy. It's also extremely thick for focaccia, and like the brussels sprouts, I can't figure out how they do it. The lumanconi was delicious, probably my favorite, and our waiter said it was the staff's favorite as well. They use the prosciutto ends! PROSCIUTTO ENDS! It's really lemony and the breadcrumbs make it crunch. The steak was cooked perfectly, and came with mushrooms that were just as good as the steak. I swear. They were ridiculously flavorful and meaty and just perfect. It's hard for me to think of words right now because I am recalling all of the great flavors and textures of the food, and I'm becoming lightheaded.   NOT ONLY WAS IT PRETTY MUCH THE BEST FOOD I'VE EVER EATEN... The service was by far the best. My water glass was never even halfway empty, or was it always more than halfway full? Whatever. My glass was always full! I went to the restroom and they refolded my napkin for me. And yes it was formal and professional, but the service didn't lack personality or generosity. They saw how much we were enjoying the food (because we were pretty much screaming), and brought us complimentary potatoes! We had a really nice conversation with our waiter too. The waiters were so nice and somewhat restored my faith in humanity? Yes, maybe. It's also in one of the best parts of the city, and is such a beautiful space. It's pretty much the perfect restaurant and I don't need to go to another restaurant ever again. Thank you, April Bloomfield.", 
    "review_date": "2015-01-23"
  }, 
  "W2jwEOlGSXUkf86d05Ijgw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen T.", 
    "review_text": "So disappointing. The food was terrible and expensive. For the price, you could eat at Zuni or Boulevard. Instead, you have Tosca which charges $$$$$ for food I would find sub-par at a diner. What a joke.  The service was bizarre.  It took several minutes to get acknowledged by a buss boy with water, then we had an even longer wait to put in a drink order.  Then I got to watch our server walk around the room gossiping with staff while holding my wine glass.  After finally ordering, we watched the chef shoving food into her mouth on the line, but unfortunately not cooking our food. 45 minutes later, our crab salad and sausage plate arrived.  We were never asked if we wanted another drink.  TL;DR: save your money for a legit restaurant. This place is a joke.", 
    "review_date": "2013-12-19"
  }, 
  "uf3nRzvQiLXqP8KTCpBkaw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Munnie T.", 
    "review_text": "Came here for dinner on a Thursday night with the boyfriend. We shared the Crispy Pig Tails ($9), Rigatoni ($16), Linguini ($17), Hanger Steak ($25), and Crispy Potatoes ($7). We also had a Polo Cup and a Whiskey Smash based on the waitress's recommendation, which were both delicious and strong!  I would say that the Crispy Pig Tails and the Rigatoni were definitely the standouts of the meal, while the Linguini, Hanger Steak, and Crispy Potatoes left much to be desired. The rigatoni sauce was PERFECT.  The linguini was extremely oily, and didn't have much of a flavor to it save for the clams. The Hanger Steak was cooked extremely well, however also lacking flavor. Unfortunately, the Crispy Potatoes were way too salty for our palettes, and we had to wash it down with a lot of water.  I wouldn't strongly recommend this place to my friends, but would not mind returning for some drinks.", 
    "review_date": "2014-09-08"
  }, 
  "gisZy0HKXvX4YMspboRmZQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben T.", 
    "review_text": "How is it that they only have 3 stars?!  Look, Bartlett Hall has 12$ well drinks. This place is chock full of charm, history, and masters of craft in both food and drink. Did they mention that they have the best negroni in San Francisco? No? Did i mention the house cappuccino is ridiculous?   Look, it's not the cheapest place on the planet, admittedly. but trust me, this place is worth every penny.", 
    "review_date": "2014-08-01"
  }, 
  "vf1DBLUOG4qHYxs7qCAXUA": {
    "user_rating": 4.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Rick L.", 
    "review_text": "Great slice of SF history. Although you know it has been fully updated it looks the same as it did at the party after La Boheme in 1975 (or 76?, the 70's are a bit of a blur). Jeannette should be very honored.   Drinks were great as was the bucatini.   Hearty Bravo to our server Tyler who was great and recommended the house cappuccino which was the perfect way to end the evening (BTW, it has no coffee).", 
    "review_date": "2013-12-29"
  }, 
  "KDewJBJknfWvQyHHFNbfdg": {
    "user_rating": 5.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Jon A.", 
    "review_text": "Expectations is a game people play. No one should expect Tosca to remain the same after such a shift from the old guard to April Bloomfield's team now owning it. And every type of approach to a bar like this is commendable, even more commendable considering that Bloomfield's team saved this place from the unsavory landlord who owns North Beach's notorious strip clubs as he raised the rent with nefarious plans for the space. Take it as a sign of the times for San Francisco, certainly, however the negativity coming straight from the gullet here in these first few fistful of reviews for the new Tosca are pretty unwarranted.   I frequented the old Tosca about one sixtieth as much as Sean Penn use to back in his prime. I use to sit in the back booth and order proper martinis either alone or with a friend, and the most astonishing aspect of the nights was the table service. Rarely do you get such a perfect San Francisco martini at your seat. Guess what... that hasn't changed. Not a bit. They spruced up the place and kept the same red lamp tone of the space. Yes, of course, after the litany of Eater emails in desk jockey inboxes, of course the front of the house is packed every single night as the allure of being a part of the old guard of San Francisco is strong for the new era of this city's polished aristocracy, however effete. I have no qualms at all with the company of parrots paying seven shekels a pint to maintain the possibility that I can linger in one of these booths all night long.   The menu has upped its game to near Spotted Pig levels. Thank you Ms. Bloomfield. The drinks just the same. The House Cappucino remains.   Maybe Yelpers haven't recognized the change as a good thing. If anything, Tosca's increased prices are properly supporting a growing reliance on the service industry. Consider the sky-rocketing cost of living in this city, and Tosca is on par, and no I'm not someone who can afford to be at this place more often than most. In fact, I'm not someone who could afford being at any bar, including the old priced Tosca, more than most. I'm just realistic about how much booze should cost. Yes, there's an immediate urge to defend nostalgia and the abandonment of a lost time. Most of us were never a part of that era. While people complain about the exorbitant costs of a lemon drop, the old guys romanticized of the old days of this city are likely thinking about how charming this city use to be -- when people cared enough to complain about having to step over their brethren on the streets who can barely afford to eat. I really question whether or not their allegiance to the old guard of Tosca is as vehement as they say, or are they riding the wave of disdain of a changing San Francisco?  Money was the motivation to ruin this place into the ground. Money saved it. They could've gutted it and stuffed it with $40 salami. They could be serving $15 martinis like we see in D.C. and Manhattan. Instead, they have integrity. I'll fork over earned dollars to make sure Tosca stays in the hands of those whose allegiance is to Tosca. My expectations for our city remains the same: look hard enough and you find integrity resting in a red booth over a proper martini.", 
    "review_date": "2014-02-27"
  }, 
  "Gwb9rLRFBhIFnINf0IXyew": {
    "user_rating": 4.0, 
    "user_location": "Del Mar, CA", 
    "user_name": "Jay S.", 
    "review_text": "Great addition to North Beach scene. Earlier bad reviews appear to be based on the first week the \"new\" Tosca Cafe reopened and was still working out the kinks. We went with a party of five early (about 6 PM) on a Saturday evening. Lucky to be seated right away in a booth. (When we left about 8:30 PM I overheard the hostess tell someone the wait was 90 minutes.) Our service was great --- very professional --- especially the wine director. Drinks okay. Food was fine. Pricey, but no more than any other comparable tourist neighborhood restaurant in the City. Noise level average --- all five of us could carry on a conversation. We'll go back.", 
    "review_date": "2013-11-01"
  }, 
  "h1WweAH6dmG5Gx9gUeA3mw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Candace C.", 
    "review_text": "Great place! You just need to get there early and get a seat at the bar. Great cocktails!", 
    "review_date": "2014-02-17"
  }, 
  "6MwGjz0MwwjstQT8lp03Tg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael E.", 
    "review_text": "I am torn about this review as I wanted to like Tosca more than I did. Starting from the beginning, we were seated promptly. The space itself feels warm like it has history, but not old. However the banquette where we were seated was too small for four. The restaurant also was very warm and we all stuck to the vinyl.   Service was mixed, starting well but then sliding into neglect. Our server was friendly but then forgot to refill wine and the length between courses got longer and longer. One person's steak took extra time so they comped a dessert.   The food itself was pretty good but very salty. The focaccia bread to start was delicious. I got the radish salad and bucatini which were both good. Others liked their dishes but too salty was a common refrain. The desserts were very one note and surprisingly ordinary. The cannoli lacked any sweetness. The last thing is the wine list which struck me as very expensive.   Tosca has gotten a lot of good press but I can't really compare it to favorites like Rich Table and State Bird.", 
    "review_date": "2014-08-30"
  }, 
  "DjFsfJWkzRuDszuJWTsSXQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt G.", 
    "review_text": "This is a three-star place.  I really wanted it be better, but it's not.    We booked a prime time table on a Saturday; the place was busy but not bustling.  Perhaps almost a year in, the novelty has worn off.  Lots to like about this place.  It's flat out gorgeous.  Beautifully re-done, keeping all the elegance and character of the space.  Warm lighting and tables spaced out far enough for conversation.  The booths look especially charming (we had a two-top).  I will say the vibe is a little casual for the pricing, so keep that in mind.  Food is well-done but nothing particularly memorable.  We started with oxtail and chicken liver; both nice.  The minestrone was good, but the excessive salt took away from the freshness of the ingredients.   Both pastas were good, but not mind blowing.  I thought the wine list was aggressively priced.   It's a thoughtful and ambitious place, but Tosca didn't quite work for me.   All-in-all, it makes for a great date night, but not really worth the trip across the city. And, relatively to what I'd call Tosca's competition (Contagna, Locanda, Beretta) it falls short.  p.s. No valet in North Beach for a upscale restaurant!?  Um, really?", 
    "review_date": "2014-08-11"
  }, 
  "pme7GsuU86rKc78DMoyBIQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beril Y.", 
    "review_text": "Pleasant surprise to see Tosca Cafe back, they still have super yummy house cappuccino going on w/ an artisan SF based chocolate maker,Dandelion. Also It's extremely convenient that they serve food and keep the kitchen open till 1 am which is quiet hard to get in North Beach and many other parts of the city. I liked the fact that they kept the original decoration but polished is nicely so it didn't lose it's soul.", 
    "review_date": "2013-10-30"
  }, 
  "ao3OM2qTqwA5qpIF4UHaJg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick D.", 
    "review_text": "Avoid this place. I tried this with a couple friends. The service has been consistently troubling. Also, even with the revamp, the food is just * okay*. For instance, the focaccia was dryer than would be desired, the meatballs were definitely overpriced and the pasta was waaaay oversauced and soggy/wet.  To add to this, we were asked to leave after an hour and fifteen minutes by the manager because they wanted to use the table in the middle of SantaCon. Classy.", 
    "review_date": "2013-12-14"
  }, 
  "CZ36wJqV-Xit758UaOr81A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco Bay Area, CA", 
    "user_name": "Bruce C.", 
    "review_text": "I don't understand the 3-star overall rating for Tosca Cafe. Other Yelpers ripped their food for no good reason. However, I think I discovered why after doing some research. Tosca Cafe was taken over by Michelin Star chef April Bloomfield sometime last year. If you're not familiar with Bloomfield, she's a British chef famous for her New York restaurants, The Spotted Pig and The Breslin (both hold a Michelin Star) and for her beatdown of Michael Symon on Iron Chef in 2008 where she still holds the highest score of any challenger (56). I believe a lot of the \"hate\" Tosca is receiving has something to do with her being a New York chef. It's not a secret that SF and NY have an ongoing culinary rivalry. I believe that very element has forced hardcore SF locals to downplay Tosca Cafe. I don't fault anyone for showing pride for their city. In fact, I welcome and encourage it. But it shouldn't prevent people from giving credit when it's absolutely deserved.   Dined here this past Saturday night with 10 other people. We ordered several of each item to share. Before I dive into the dishes, I have to give everyone a heads up - Tosca's portions are very small. Their menu is constructed to encourage you to order four courses (Antipasti, 1st, 2nd and 3rd course with the possibility of sides and desert).   ***ANTIPASTI*** MEATBALLS (Three pre order) ~ $11 ~ 5 stars CRISPY PIG TAILS ~ $9 ~ 5stars FOCCACIA BREAD (Enough for 4 people) ~ 4.5 stars MOSCARDINI (Octopus) ~ $9 ~ 4 stars  ***PASTAS*** BUCATINI ~ $17 ~ 5 stars GEMELLI ~ $16 ~ 5 stars LINGUINI ~ $15 ~ 4 stars RIGATONI ~ $14 ~ 3.5 stars GRILLED POLENTA ~ $17 ~ 3 stars  ***MAIN*** WHOLE ROASTED CHICKEN (1-hour prep time) ~ $42 ~ 3.5 stars  The Meatballs (off-menu item) are to die for. Flavor is on-point and the texture is what you expect from a Michelin Star chef - moist, tender. The Crispy Pig Tails might sound disgusting but it's anything but that. Deep friend to perfection. Imagine combining the best pork rinds you've ever had with little morsels or perfectly cooked, fall-off-the-bone meat. Absolutely amazing. The Foccacia had excellent flavor. A very aromatic bread that went very well with the Meatballs and the sauce it sat in. Moscardini? Never heard of it? It's octopus cooked to an amazing tender texture. Dressed with a simple vinaigrette and you get a winner.   We sampled all their pasta offerings. Don't waste your time on anything else but their Bucatini and Gemelli. The Bucatini had amazing flavor. Imagine macaroni pasta stretched to the length of spaghetti. That's what bucatini is. The sauce had very deep and complex flavors. You can taste all the quality ingredients and the Gruanciale (essentially bacon) really adds another layer of taste and texture. The Gemelli was on-point. It's a type of pasta I never heard of. It essentially looks like two strands of pasta twisted together, each piece about 3/4 of an inch long. The pecorino comes through beautifully and you get a nice subtle black pepper finish.   The roasted chicken was good but not great. However, the sauce was creamy and a tad citrusy. It's perfect with the foccacia.   They have a healthy list of premium cocktails. I tried the Casino Bar Negroni, Suffering Bastard and House \"Cappuccino\". All were very good and well made. The Cappuccino is the perfect way to cap off an awesome dinner. We also brought six bottles of wine. Each one had a standard $25 corkage fee.   The biggest knock I have on Tosca is their service. The staff makes you feel like you're below them. Everything from how they say things to their facial expressions are big turnoffs. It's not the most welcoming place. They did show flashes of courtesy and quality service once in awhile but it's definitely something they need to improve on. Plus, it's nothing several drinks can't take care of. This is one place I'd be happy to return to even though the service was bad. The food was THAT good.   We didn't have reservations. However, our party of 11 only had to wait 45 minutes after showing up around 6:15pm on Saturday. Don't show up any later if you have a bigger party because the place got packed by 7pm.", 
    "review_date": "2014-06-02"
  }, 
  "dugBVGBnagCMLfgES6-Niw": {
    "user_rating": 2.0, 
    "user_location": "SOMA, San Francisco, CA", 
    "user_name": "Mario S.", 
    "review_text": "The service is good, ambience exceptional, the drinks above average (except for the Apple Toddy, which I couldn't finish to the bitter end), then why just a two star review, you may ask.   The food. Did we pick a bad day, I doubt it.   My friend and I ordered Linguini (meh), meatballs (competent) and grilled lamb chops which we had to send back given how badly cooked it was. Not much meat and too much fat riding on the bones; this was one experience I wish I didn't have, because I've had such a romanticized notion of this place.   That said if you insist on going, ask to be seated in the back-room filled with movie posters. Imagine Sean Penn's Facebook profile and his likes come to life. Very laid back, very cool retro movie vibe. Now that's definitely worth two stars just by itself.", 
    "review_date": "2014-03-28"
  }, 
  "0DsxbQxw1cPRvbMkJmGwVA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua B.", 
    "review_text": "Went  on a thursday night. Food was tasty (Loved the chicken liver Spiedini &amp; Lamb chop). . Bar very noisy.", 
    "review_date": "2014-02-23"
  }, 
  "WP3p6rPGM6-MmyRNL_tglg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "gogo g.", 
    "review_text": "The service completely ruins what otherwise would be a delightful restaurant. The first time we visited, the service was lacking but the food was wonderful. So we went back but this time the food could not make up for the atrocious service.  We ordered a full chicken when we checked in for our reservation knowing the chicken takes one hour to prepare. After sharing a few small plates, we waited and waited and waited for the chicken. One hour and forty five minutes after we had ordered the chicken, it finally arrived.  I get that the kitchen can be backed up. But expecting guests to wait extra 45 mins for the main dish without a warning ( when ordering) is inexcusable. Also inexcusable was the waiter pushing us to order additional appetizers and entrees while we waited. The gracious thing would have been to apologize and send out a couple of apps on the house instead of telling the table \"I'm just the messenger\" and pointing out pasta dishes we could order while we wait.", 
    "review_date": "2014-07-29"
  }
}