{
  "38luwEt7EArykLDBLf1E9w": {
    "user_rating": 1.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Rude A.", 
    "review_text": "the service was bad, the food was bad, and glass came with lipstick on it", 
    "review_date": "2012-01-19"
  }, 
  "GJsRGdnvfGsG3w0becDD2w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cec D.", 
    "review_text": "Great little dive to watch the game. Ample tvs and seating, tasty southern style food (pairs well with day drinking!) and a solid selection of brews. Draft beer could be a little colder and the service quicker but it gets the job done. Go Pats!", 
    "review_date": "2012-12-23"
  }, 
  "_n40AvOlP7bZi3qcljaMyw": {
    "user_rating": 4.0, 
    "user_location": "Portland, OR", 
    "user_name": "Jeannie J.", 
    "review_text": "We only stopped for drinks since we already had dinner, and their happy hour didn't end until 8. The bartender was extremely nice (she even offered to charge my phone since it was dying!), the drinks were nice &amp; stiff, and I liked the dark space.   I would love to come back and try the fried chicken.", 
    "review_date": "2012-07-27"
  }, 
  "A_sXhZinXGrna9b-d6YxQw": {
    "user_rating": 5.0, 
    "user_location": "Santa Barbara, CA", 
    "user_name": "Hector S.", 
    "review_text": "After a long night, this was the best morning-bar I could have asked to been taken to.  The Chicken and Waffles were amazing. and I'm not really even that into the whole chicken and waffle craze, but I think I might be now.  The fried chicken itself had a good southern kick to it, and combined with syrup and a solid waffle base made my taste buds bow down and worship.", 
    "review_date": "2013-12-22"
  }, 
  "3dUnClUv_gF9tzkPN9Z5TQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cornelia I.", 
    "review_text": "We went on a Friday evening and ordered some drinks and small dinner. The waitress was very friendly and attentive. The food was okay. A live band played, which was nice. A fun evening!", 
    "review_date": "2015-01-15"
  }, 
  "mbKTjA5ULpn1FtTGxkdmcg": {
    "user_rating": 4.0, 
    "user_location": "West Lafayette, IN", 
    "user_name": "Rohit J.", 
    "review_text": "We were able to find seats right next to the band. The band was really good. Drinks were good too. Okra fries were good. Potato fries, not so much.", 
    "review_date": "2013-08-18"
  }, 
  "Md1UsBvMLJwQA7PC2gS4pA": {
    "user_rating": 5.0, 
    "user_location": "Union Square, San Francisco, CA", 
    "user_name": "David S.", 
    "review_text": "Live music, and much better atmosphere than some surrounding bars.  I've eaten here too, good ole comfort food, which I would give 4star.", 
    "review_date": "2014-02-09"
  }, 
  "IB0_DRx-L8O1MtzwPF-lQw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jon y.", 
    "review_text": "The highlights pretty much hit it all - great soul food, especially the brie mac n cheese and the fried pickles. Would never have thought to look in North Beach for great bar soul food, but that's SF for you. Surprise around every corner.  Came for a holiday party. Was a little surprised by the choice of location but in hindsight this was a brilliant pick. Not pretentious at all, good food, plenty of drinks. The only complaint would be that the live music overwhelmed the conversation, but that's what this place is known for so you've gotta know that coming in.", 
    "review_date": "2014-01-06"
  }, 
  "1BuH5Es8d161YjfBmt6cDg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vera W.", 
    "review_text": "I like Tupelo! Good--above average--southern food! Granted, I really only ordered the waffles fries and tried bites of the fried mac and cheese... they were delicious. The drinks are good and the bartenders are friendly.   Good place to just chill--a bar for drinking, high tables for eating as well as lower tables and chairs for lounging. They also have several TVs... I'm sure it's a good spot to watch the SuperBowl, NBA finals, etc.", 
    "review_date": "2012-10-05"
  }, 
  "FeRA4Qpm9gF9_CACJUQ6og": {
    "user_rating": 5.0, 
    "user_location": "Truckee, CA", 
    "user_name": "Kaitlin M.", 
    "review_text": "Love this bar. Awesome atmosphere. Janice the bartender- perfecto! Will be back every time we come to the city!", 
    "review_date": "2014-09-09"
  }, 
  "WRdXMEGqq1YzmjmwSJ-T-w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chloe M.", 
    "review_text": "QUICK TIP!!!!  They do not have fried chicken and waffle fries anymore!!!  SO sad.", 
    "review_date": "2012-09-18"
  }, 
  "Ey7u10UjOz7Urroq4J0a4Q": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Marjie T.", 
    "review_text": "this place was awesome! i came here for march madness with a friend of mine who was a boulder buffalo alum and was excited to see others from that school cheering on their team. i had to admit that i didn't have them winning in my bracket, but i was there to support. what i really loved about this place was the food! it was no ordinary bar food...it was serious soul food! i shared fried chicken (tender &amp; well seasoned), mac &amp; cheese (cheese, breadcrumb goodness), and cornbread (sweet and awesome). i can't wait to come back to try the build-your-own grit bowl!", 
    "review_date": "2012-04-21"
  }, 
  "Apau1YNAIKUe_iNRE8HD2A": {
    "user_rating": 4.0, 
    "user_location": "La Mesa, CA", 
    "user_name": "Alyssa M.", 
    "review_text": "Just a warning, their online menu is way out of date. They only serve about half of what it says. But the food I did get was good and service was great. Loved the love music as well", 
    "review_date": "2013-03-31"
  }, 
  "ZEm9VJi2cE2LLUPFpGb7Tw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah J.", 
    "review_text": "Where to start?  It was a rainy Saturday evening when some friends and I decided to pop into Tupelo for some food with soul. Right away we all remarked on how beautiful the interior was. The dim calm lighting brought out the orange wall color with such class and comfort it was hard not to notice.  There was casual seating by the window for a small group (8 or so people) to relax and kick back with cold beer or even an appetizer or meal if they wanted to, there was seating at the bar, as well as tables along the wall and down through the center of the bar/restaurant. There were also two decent sized flat screen TV's playing two different football games (nothing irritates me more than a bar with 2 TV's not even 15 feet from each other with the same game on during football season). There was a friendly staff and a friendly atmosphere of patrons enjoying the rainy evening. We felt comfortable and cozy right away. The noise level was also just right. Not too loud, not too quiet. My friends and I could catch up without overhearing all the chatter around us or feeling like we were screaming at one another. To start, we had beer. Ice cold, delicious. Nothing better than COLD beer. Then, bring on the soul food!!  Let me start by saying that anyone with the audacity to complain about $7 soul food tapas doesn't really know what good food is, or what is put into it. Yes, I would complain if it was $7 and sucked, but the tapas were all DELICIOUS! Crispy Fried Pickles, AMAZING Grit Cakes with a mustard sauce, AMAZING Collared greens with Pork belly, AMAZING We even reached out for the $10 tapa menu for the fried green tomatoes, and the roasted garlic brie mac &amp; cheese both,  TO DIE FOR! Because we had stuffed ourselves on such delicious starters, we ordered only two entree's and decided to split them between our table of three.  We got a soul food supper plate with the Veggie and rice stuffed pepper as our main entree with the supper plate, and then we got the Grits and Creole Shrimp as our second entree.   Let's just say, one member of our table, who will remain un-nammed, basically licked the bottom of both plates just to try to savor every last bit of flavor. That's how good it was.  In the end, the bill was reasonable split between all 3 of us, and we decided right then and there, we'll be back. Highly recommended to anyone who's looking for a delicious soul filled plate of soul food. My only suggestion, try to walk out, not roll out. You're almost guaranteed to over-eat in a place this good.. ENJOY!", 
    "review_date": "2011-11-22"
  }, 
  "7zNRYBXuNJJGqUOvUcMZ0w": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Chris B.", 
    "review_text": "This place is way cool! I went with a buddy to experience an awesome band called Sinister Dexter and really enjoyed the whole experience! We showed early and had some of their delicious grub.   Their Catfish Po' Boy is out of this world! Also highly recommended are their Chicken wings and also their fired pickle spears! Just be sure to ask for extra chipotle aioli, as you will be drinking the stuff (may want to ask for a straw too)!  To compliment it all, they have a ton of great beers on tap!  I look forward to returning!", 
    "review_date": "2014-02-25"
  }, 
  "KOWl_ZhqhYqY33-CbaJubw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Bobby L.", 
    "review_text": "Tuesday nights rock at this joint!...thanks to DJ Purple!    It's rare to see a karaoke DJ bust out instruments and start playing (very well) with a karaoke singer.  With his musical talents, adding his touch to make performances better...this one-man band makes Dance Karaoke Night thrive at Tupelo.  Love how the crowd gets into it here and how fast songs come around.  I guess that's what you get with the Dance Karaoke vibe.  I'm sure I'll be back for more of the fun.  My eyes are on their food menu too.    Next Time!", 
    "review_date": "2014-08-06"
  }, 
  "65uUyG9yuF0rdMh0z7ajaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Don H.", 
    "review_text": "Best things to know about Tupelo:  1 - Live music! They get a pretty good selection of bands, and there just aren't enough places left in SF that do live music, so they're worth visiting just for that. 2 - Tasty catfish! I've never had the full blackened catfish plate, but the catfish po'boys are great. I get them every time. 3 - They've got a few TVs, including a projector, so the game is probably on, and if not, they'll likely put it on. 4 - Tasty beer selection, even though it's not very big. Mostly tilted in the lighter direction, which is good when you're all hot &amp; sweaty from dancing. 5 - WAY cleaner bathrooms than Grant &amp; Green. Such a plus. Seriously.", 
    "review_date": "2013-10-06"
  }, 
  "5qgJTus1l35A6bqW2fFk0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raina D.", 
    "review_text": "I LOVED this place! Wandered in on a random Saturday night and there was an awesome live band just jammming their faces off and having a great time.  Pretty good beer selection and the place was just crowded enough where there was enough room to dance around and hang out.  I would 100% return with friends for a fun night out. Seems like the food is legit too, so that's always a good reason to come back as well :)", 
    "review_date": "2013-11-06"
  }, 
  "J0G7SAItOT4opuLSK2-tmw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Melody L.", 
    "review_text": "Had a craving for fried chicken and I used to frequent the old Mojito bar, so I came down here last weekend for dinner with a friend to see what this new place was all about. When we walked in, it was kind of dark, and everyone else was drinking...but the service was amazing. We picked our own table, and the staff would come check on us every ten minutes or so to make sure we were doing okay. We got the shrimp po-boy and fried chicken with mac and cheese (which they gave us two pieces of fried chicken for since they knew we were sharing!!). Shrimp po-boy was good, and the fried chicken was interesting with its lime flavor. I wasn't too into the mac and cheese - it had the seashell shaped pasta pieces and was also kind of lime flavored. Overall, really really loved this place for their service - the staff was just super friendly!", 
    "review_date": "2011-12-25"
  }, 
  "dqxnx_vls8X_PVEAYQChHA": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Amy T.", 
    "review_text": "The majority of my rating is for the awesome service.   We started off by ordering a couple of beers, the fried chicken with mac n' cheese and the shrimp po'boy with their house fries (aka WAFFLE FRIES).   My friend and I were talking for a while and then it dawned on us that the food was taking a really long time. Before we even cared to get mad about it, our server came over and said, \"hey, your food seems to be taking a little long, the next round of drinks are on us.\" We thought that was awesome, and then our food came out 2 minutes later.   Before we ordered, we saw an amazing plate of fried chicken and mac n' cheese, so we had to get it. Our plate came out and had the sorriest piece of chicken on the plate. Luckily we were sharing a couple of items so it didn't bother us too much. A guy then comes out from the kitchen and says that he knows our piece is small and is making another piece for us. By time we ate all the food, we took the extra piece of chicken home.   Come for the laid back atmosphere, the great service and you HAVE to try the shrimp po'boy - so fresh and delicious.   I'll be back!", 
    "review_date": "2012-04-10"
  }, 
  "4Dnl646nK7BkEiPFcXE5yw": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Aldo V.", 
    "review_text": "The wife and I decided to check out this place because of the music they had. The 4 dollar beer special was inviting.  I have to day we enjoyed the music and the atmosphere was ok too. It was not until I order my second beer that I decided to closed my tap and to my surprise I was informed by the rude \"bartender\" that they had a 15 dollar minimum! WTF!!! Don't get me wrong I dot mind paying, but them. It saying anything until the had my creadict card captive?? That's very shady! Lucky we stumble upon an ATM and was able to avoid the hidden 15 dollar minimum tap. Mind you there was no signs or warning my the girls at the bars. For this reason, I give it 3 starts. I would go back but for sure this time carry cash.", 
    "review_date": "2013-08-18"
  }, 
  "-iDnbLtsRHs1-IYf0tL4Gg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily N.", 
    "review_text": "Mixed review - lots of beers on tap for good prices ($5-$6) but I went on a Thursday and there was only 1 bartender who was taking her time getting to serving people. As for the food, I'd give that 0-1 stars. It's a dive bar though so obviously not known for their food...would recommend this place for drinks/live music only.", 
    "review_date": "2014-09-27"
  }, 
  "d1iQ6JAdwg3meF9WOND3og": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Delilah B.", 
    "review_text": "There's nothing like walking into an old familiar place, only to find that it's been improved 100 fold.  Since Tupelo's partial opening last week, I've been here twice now.  You can say, I'm a huge fan of this place.   Located in North Beach, Tupelo is spacious, clean, plenty of seating and great for happy hour.  The bartenders and staff are extremely friendly and attentive.  They have a cute lounge area with coffee tables and chairs as well as eating tables big enough to sit about 6.  Noise level is great for casual conversations.  The menu is a collection of robust Southern comfort dishes with a slight twist.  The chef really took these basic Southern dishes to a whole new level without losing any of it's integrity.    Things that we've tried on the menu:  Burger w/ Tupelo Fries  - The burger was cooked medium rare.  - 1/2 a lbs  - Wide variety of toppings to choose from.  *Each time we've come here, we ordered the burger.  The first time was with Avocado and bacon. The second time was with blue cheese and candied bacon. The burgers were HUGE and tasted just as we thought it would.  Absolutely amazing.  The meat was cooked as we wanted, medium rare and the bacon was thick and crispy.  It's crazy messy and absolutely enourmous, but so worth it!  There are only a few places that I would ever get a burger, now Tupelo's is one of 4.  Pork Belly PoBoy  * You better be ready for this one.  It's a great combination of ingredients and it's melt in your mouth good.  SO worth every calorie.    Grits with sauteed mushrooms  * Creamy deliciousness. They have a variety of different \"Grits and ...\" combinations.  I wish they had a sampler option, because it's hard to choose, they all sound delicious.  Other things we've tried and each in it's own way was unique and tasty:  Grit Cakes Spicy chicken wings Mac n Cheese with Garlic and brie Regular Mac n Cheese Fried Green Tomato's Boiled peanuts  This place definitely takes your standard night out for dinner  and drinks up a few levels to pure gluttony.  I love it!", 
    "review_date": "2011-11-11"
  }, 
  "vEQQq1GPkAurMrMcW4W6ag": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dee Dee R.", 
    "review_text": "Went there for an event last night. Since North Beach is my favorite hood we were happy to have an excuse to romp on Grant Street.  The place has a nice dim rosy glow. The servers are polite and were fast. The bathroom was clean and they have a communal sink area, good for coed mixing. We ordered the chicken wings...o ma gawd. They were delicious!! So much so that my picky friend and I ate them down to the bone! Best chicken wings that I have had in quite awhile. I would like to host an event there and I will keep you posted when that happens.  Soul food in North Beach? YES yes yes!!! Tupelo would be a good first date spot.", 
    "review_date": "2012-06-20"
  }, 
  "tGgTIueZy1JNTzQD9rkZLQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny L.", 
    "review_text": "09.16.12 || bookmarked 12.21.11  Completely agree with Emily B's review.  I was at Tupelo hoping to make the most of my Bloomspot deal before it expired.  Didn't realize that I spent money on what I could eat at home (eggs, bacon, and toast).  Poor new chef (and existing waitstaff) really got stuck in a bind, but I think they did try to make the best of the situation from the old chef quitting days before.  I will have to say, the bloody mary was bloody fantastic.  With top shelf vodka for $8, it feels like a steal.  Would go back if I happen to be in the neighborhood during football games, but that's a slim chance in itself.", 
    "review_date": "2012-09-26"
  }, 
  "lLfcbYGTeVxQN5Ig0ompJg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elena N.", 
    "review_text": "Came here with Rodney H, Bobby L &amp; Peter L on a random Tuesday night after dinner. Peter had been here before and had a blast so we thought why not check it out?!  All I have to say is that the DJ made the night for me! Tupelo has karaoke and a stage in the back. DJ Purple was running the karaoke and he was awesome! Out of the blue we'd hear a saxophone accompaniment and it turned out to be DJ purple! In need of a harmonica accompaniment, DJ purple to the rescue! Wanna sing a duet but you don't have a singing partner? DJ purple can do that. Need some backup singers? DJ purple is there for ya!  I don't sing karaoke, but it was fun to watch everyone else singing and having a good time. Just give me some beers (and maybe some shots) and I'm here to cheer you on!", 
    "review_date": "2014-07-26"
  }, 
  "IPYIi9LH0zddqKEscbDjYg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kelly K.", 
    "review_text": "This was the second time i dropped in on tupelo, and i'm always glad i have. Good live music on a saturday night, prompt service and i can always find a stool. I drop in because i'm waiting on a table at tony's around the corner. Seems to be the only bar in the neighborhood that would welcome a mature adult like myself. That said, my mid 20's kids also liked it.", 
    "review_date": "2013-06-29"
  }, 
  "UyhnjAlyMXtbR-qB5kkhlQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jean Y.", 
    "review_text": "Tupelo serves nicely plated Southern food in a dive bar setting. The food tastes much lighter than I expected for the cuisine, and portions range from small to medium. I found just about all the food I've tried to be simple and good but not spectacular. Service is a bit slow, but the staff are friendly.  From the tapas section of the menu (available at all meals): * Crispy pickles with spicy aioli - $7. Five pickle spears deep fried in a thick layer of dough. Eating these was messy. Not a fan of how the dough kept separating from the pickles. * Roasted garlic + brie mac + cheese - $10. Small portion. Garlicky and good.  From the dinner menu: * Build your own grits - $7, with mushrooms +$4 and asparagus +$5. I was expecting more for the price, but the grits were really tasty. They were neither too greasy nor too bland, which I often find to be the case with grits. * Soul food supper plate (combo of one entree + one side) with fried chicken thighs and baked mac + cheese with cheddar + pepper jack - $15. Yum!   From the brunch menu:  * Ham hock omelette with hash browns + toast - $13. * Cornbread and cheddar biscuits with honey butter - $6. Two large pieces of each.", 
    "review_date": "2012-04-26"
  }, 
  "5Ql9mdL1wZVC8cJ8xZxKEA": {
    "user_rating": 5.0, 
    "user_location": "Richmond, CA", 
    "user_name": "Secret R.", 
    "review_text": "A friend took me here last night. I was delightfully suprised. The doorman was so nice, no attatude that one sometimes encounters. The cocktail waitress, was fast and friendly. The food was good, tasty and un pretentious. Then came the music.....fantastic, is an understatement. All in all I will be a repeat customer and recommend Tupelo to my friends", 
    "review_date": "2012-11-03"
  }, 
  "cCwqJff1QuHOsORGqkXFTw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sonam G.", 
    "review_text": "Born and raised vegetarian I never even thought to try soul food, and I am glad I tried it first here! So many options (including a few vegan options such as the stuffed pepper yummmm :)  Brie mac and cheese was amazing, as well as the fried green tomatoes!  Can't wait to come back! At first hearing that it was a bar that served food made me a bit weary, but the ambiance of the restaurant on the rainy Saturday evening I was there was relaxing and I had a great time catching up with friends over great food! Bravo!", 
    "review_date": "2011-11-20"
  }, 
  "qr39aau6xMYLY7GDsJ8sEg": {
    "user_rating": 5.0, 
    "user_location": "Bellingham, WA", 
    "user_name": "Heather D.", 
    "review_text": "I have been traveling from Washington, Vegas, Mexico and then up through California. I had tasted my first grits in Vegas and did not like them. I stopped in San Francisco for a few days and heard about Tupelo and that if you don't like grits, then you have to try Tupelos. I haven't had a lot of experience with Southern Cuisine so I decided to expand my pallet. I ordered the Blackened Catfish, grits, fried pickles, and ham-hock croquettes. I had arrived on a Wednesday and the place was filling up fast because it was Trivia night. The ham-hock appetizer was a good way to start the meal. I enjoyed my dinner, and for the first time I liked grits! They had a more butter &amp; creamy taste that was far superior to creme of wheat tasting grits I had experienced earlier in Vegas. Catfish where I come from is not an item I would normally order. It's not a fish we respect much in Washington. Salmon is. I liked the Catfish, it was light and tasted good. The fried pickles was my favorite. A nice light salty flavor and not scalding to the bite like they've been at other places I've tried them. I ended up staying for Trivia night and looked at what the other patrons were ordering and everything looked delicious! I started to wonder about the other items on the menu. The hamburgers &amp; waffle fries were popular, and the special was the Fried Chicken supper, but I wanted to be more adventurous. I ended up having so much fun meeting cool people that I stayed till the late night menu, and tried the Pulled-Pork Sliders which complimented my draught beer perfectly. I had so much fun that next time I'm in San Francisco, I am coming back to try those hamburgers.", 
    "review_date": "2012-03-19"
  }, 
  "lPaPRP7rYISQ5P7wNmVVMg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John H.", 
    "review_text": "Bartenders are fine, and bar has some vibe. Food is the problem. I had two experiences. Brunch item ordered one sunday was fine despite being a small portion. On a subsequent visit, ordered two items  -- Mac n' Cheese and Collard Greens. The Mac was the most dry, flavorless, bland I have literally ever had. Pushed it away after three bites. Collard greens were a soup of water, oil and salt -- inedible. I never send things back or complain, but did mention to bartender as she cleared and clearly noticed that all was uneaten. She just kinda nodded and said, \"I know\". No attempt to fix, etc. $20 for inedible food and not even an apology. At minimum, I wish she had told me I was ordering bad items.  Go for the beer at most, not the food.", 
    "review_date": "2012-04-02"
  }, 
  "FM9C-WTCI0qLgN_q8QhGJA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alan C.", 
    "review_text": "Tupelo's the best neighborhood bar in North Beach, hands down. Teague, the owner, has brought great live music back to Grant Street (and is a badass musician of his own). Mostly blues/rock on the weekends, with an assortment of other classic bar activities (karaoke, trivia, Sunday bingo, etc) all happening too.  You're not going to find craft cocktails with shaken egg whites here (head over to 15 Romolo if that's your thing), but they have a great selection of beers on tap and the attentive bartenders make stiff cocktails. It's a huge space, too, so generally you're not having to fight your way through a crowd on your way to the bar like every single bar on Polk St.  Tupelo's food is often overlooked in a neighborhood with so many restaurants, but is a really great  lunch/dinner option: the fried okra, burger, po boys, and even the Caesar/blackened chicken salad are all great.  Lastly, my friends and I have had a variety of private events here, ranging from entire buyouts for New Year's to simple birthdays. Teague and the staff have been incredible to work with every time and gone above and beyond to make the events great.", 
    "review_date": "2014-04-12"
  }, 
  "s1DSkbdFEuO3ODbMWQqSvw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Monika M.", 
    "review_text": "A southern dive in North Beach? I really wanted to love this place. The bar itself is a great space. The Saturday night clientele was a little strange. Lots of popped collars and caps twisted to the side. Server was really nice. I'm a big fan of the music they were playing, but couldn't find similar stuf on the jukebox. Would have expected more blues.  Onto the food: I know Chef Mark Danziger now specializes in southern food, but it's pretty obvious he doesn't really get it. The food was pretty good, but it fell short in quite a few places. We had: Chicken Wings: I didn't have any, but my fellow diners loved them Cornbread with honey butter: awesome and definitely traditional Grits: the grits themselves tasted good but were more runny than I've ever had them in the south, I had them with pork belly and brussel sprouts. The brussel sprouts were amazing and very traditional: almost overcooked but done just to the point that they don't get the sulphur taste. The pork belly was good, but tasted pretty bland next to the brussel sprouts.  Fried Okra: They were super bland, and the sauce they served them with was really strange. I LOVE okra southern style, so this was really disappointing.  Overall, it wasn't the comfort food I was looking for. If I'm going to indulge in the unhealthy stuff, I'd rather go somewhere where the taste is worth it.", 
    "review_date": "2012-01-29"
  }, 
  "WecuAsHBDZGj7Z6_sJcQAw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "Help wanted.  One man show trying to do it all. Take orders. Make drinks. Everything. If they weren't so popular maybe he could.  Must be the good food at great prices.  - Cornbread with apple butter (couldn't stop eating)  - Mixed green salad (apples and pecans yes please!)  - Build your own grits (tasty blend of broccoli and caramelized onions)  - Shrimp po' boy (delicious mess of sauce and crustacean with fries on the side)  All good.  Spending $50 between the two of us plus a drink was great.  Took a while to have our order taken. Food arrived quickly afterwards. Server couldn't have been nicer. You could tell he was trying. Hard.  Less restaurant and more bar so sports on TV and awkward drunk guys in oversized pleated khakis are the ambiance.  Bring your patience. They'll bring the worth it eats.", 
    "review_date": "2012-06-19"
  }, 
  "Bx1iLCgUyu4HPepkYut4Uw": {
    "user_rating": 4.0, 
    "user_location": "Austin, TX", 
    "user_name": "Alison B.", 
    "review_text": "Definitely more of a bar than a restaurant. When we came in for dinner, we had to keep going up to the bar when we wanted another beer and to order food... so don't come expecting the waiter service that you would normally get at a restaurant.   I got the grits with pork belly... the grits were not like any grits I've had before (my mom grew up in georgia and most of my family is in the south) but regardless they were pretty good. Pork belly was delicious, good flavor. Overall I enjoyed my dish. Price was appropriate.   I'm not dying to come back just for the food, but it was pretty good. I was deciding between three and four stars for this place, but went with four because I like the atmosphere and I like the take on southern food. Tupelo is a fun place, and worth trying.", 
    "review_date": "2012-03-26"
  }, 
  "Wq_xRCxRWpNQYXV0wYpA7Q": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Chris D.", 
    "review_text": "I'm into it but the live music is too loud sometimes", 
    "review_date": "2014-05-08"
  }, 
  "k6ktxdlR_3w-XHZo8GWGgA": {
    "user_rating": 5.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Allison I.", 
    "review_text": "DJ Purple is the best karaoke dj ever! He rocks out on the sax with every song. Truly a great touch. Fun crowd, nice bartenders, all ages just looking for a fun time on a random tuesday night.", 
    "review_date": "2014-01-14"
  }, 
  "cMoQqT_j_FD1gO6EEZzOIg": {
    "user_rating": 3.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Mitch E.", 
    "review_text": "What was that band's problem? Being so loud!  Came here as a meeting up point for the crew I was with over the weekend.   Maybe we should have met up somewhere else because while I did enjoy the band a bit, I couldn't hear anyone. So focused on the Warriors/Rockets game instead.  The bar was alright, they had a decent selection of beer. The music was good. They had a spot to catch the game.  The bar just didn't do anything special for me. Lots of space for everyone, but overall I just though it was OK.", 
    "review_date": "2014-02-24"
  }, 
  "i2KocsDcufoW5PNi_1LJnQ": {
    "user_rating": 1.0, 
    "user_location": "Hayward, CA", 
    "user_name": "Dan M.", 
    "review_text": "Died and went to heaven, as I left one loud bar only to come to one just as loud if not louder. I don't mind bands in bars, if the volume is reasonable, not eardrum bleeding loud. Nothing memorable, I had some Jameson shots to numb the pain and leaned in to talk/listen to people like I was trying to suck their blood. Won't be going out to this part of North Beach for a long time.", 
    "review_date": "2013-07-09"
  }, 
  "A-HI7Mcr_-SL60T3WvSjiQ": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Markus N.", 
    "review_text": "I'm a day late.  I so wanted to be FTR.  I'm TTR.  Word - Occupy Tupelo!  Barely a week old, a foundling.  But from stock that guarantees - Tupelo isn't just a town in Mississippi anymore.  The experience brought by Mark in the back and Teague pouring your libations by itself exceeds most similar pairings.    Southern cooking with San Francisco flair.  In North Beach.  Who'd have thunk it?  I was only able to stay for a short visit (this time), but while I did I had the good fortune to sample the shrimp and grits (grits so smooth, with just the right spicy balance.  shrimp perfect) and bites of the signature burger with waffle fries.  The menu isn't extensive, but covers pretty much whatever you might be craving whilst on a visit or a crawl through this cool part of town.  I hear there's going to be the coming out party next week.  Make your way there for that or after, when things will be really cooking.  We can occupy us a po boy.", 
    "review_date": "2011-11-12"
  }, 
  "HorQ90eiUPfnesQlIraaJA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy W.", 
    "review_text": "BRUNCH bad news, don't do it.  I had a $30 Groupon. Brunch hours start at 10am, we got there around 10:20, found AMAZING lucky parking less than 50 feet away (GO Norman!)  THE BRUNCH MENU has 5 items (only)  1) Breakfast cornmeal- seared shrimp, scallions, poached egg: $12 2) Pulled Pork Sandwich - slow braised pork, house slaw, french fries: $8 3) French Toast - Thick cut brioche, bacon, syrup: $11 4) Tupelo Hot wings - spicy wet wings, steak cut french fries: $9 5) American Breakfast- two eggs sunny side up, sausage, toast: $7  You seat yourself, Since we quickly realized we were gonna be hard-pressed to spend the $30 on food, we ordered a bloody mary for Norman ($8, and way too horse-radishy).  The waitress told us the only two things the kitchen could make right now (since it was prepping) was the wings or the American breakfast.  We decided to order the wings, and wait the 20 minutes until we could order something besides the American breakfast - AND to see how hungry we would be after the wings.  (Though knowing what was to transpire, I wish I had just sold the Groupon to another neighboring table and left)  Anyway - the table next to us orders and get their drinks.  we wait for the bloody, then finally have to remind our waitress about the cocktail, she takes a while to get it and comes back and says the kitchen won't be ready for ANOTHER 35 minutes.     We get the wings - the fries are under-done, and they were okay wings, nothing spectacular. But after we eat them we realize we are done with this place, that it might be another hour (or whoever knows how long until the kitchen is running, and if the wings were any indication of quality, why bother?)  We spied a couple of old acquaintances at the bar who were drinking and watching football, and we asked our waitress to just credit the $15 we didn't spend on our Groupon and have it applied against their tab. (She said she would), the waitress was in a tough spot , she said it was her first day -and really most of the problems were coming from the kitchen.  Now we will never know if the $15 credit got to our friends... but you win some, you lose some.  To add complete insult to injury I went to the ladies room before I left and they have those HUGE TP rolls inside the plastic, and once one roll ends you slide the bottom to get to the other roll.  Both rolls were full, but the only roll exposed was all wet, so impossible to get any quantity of paper off it other than in 1\" wet scraps.   All the other reviews about brunch are right. Sadly the dinner reviews looks good, but avoid at all costs for brunch!  I would have been MUCH happier with a couple slices of Golden boy pizza!", 
    "review_date": "2012-09-09"
  }, 
  "EjWOCA1kT3MpWofzjrVtfg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "alexandria n.", 
    "review_text": "The place is refreshing considering the area it's in.  It's laid back and divey which is a nice option in the north beach area. They also serve food late which is a plus.  However, the place is loud, the food is okay, and our waitress was so hammered by the time we got there (about 9:30pm) that she forgot half of our order... twice.  Come early.", 
    "review_date": "2012-09-27"
  }, 
  "slgeQi8lYc2NAinud5egGw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michelle R.", 
    "review_text": "Big changes have come to 1337 Grant Ave!  For those of you familiar with the former Mojitos space, you will be amazed with the transformations that have occurred.  The walls are now painted a warm orange, new lighting has been installed, and the bathrooms are beautiful!  There is something authentically welcoming and friendly about Tupelo.  I have been in twice since they opened last week to have drinks with friends and grab a bite to eat.  The staff are fantastic and openly proud to be working at such a great establishment.  The vibe is comfortable, the music volume is just right, and the bartenders are all seasoned professionals.   The food is also top-notch.  The head chef knows soul food and isn't afraid to make you drool.  I have tried several of the menu items so far and they were all delicious.    -The apple and candied walnut salad has the most amazing dressing I have ever tasted -The sweet potato soup was out of this world -The chicken wings have a great kick -The grits and brussel sprouts are so good, you'll forget that there was ever a time in your life when you didn't like brussel sprouts -The mac and cheese with brie is super creamy -The grit cakes and ham croquets are the perfect bar bites   I want to congratulate the owners for doing such an incredible job renovating this place. North Beach residents and visitors alike will love Tupelo!", 
    "review_date": "2011-11-12"
  }, 
  "1Z5jOkwQXaPTpioS3bLEtg": {
    "user_rating": 2.0, 
    "user_location": "Corvallis, OR", 
    "user_name": "Ben H.", 
    "review_text": "Ordered one drink, bartender brings two, then admonishes us both for not specifying to ONLY bring one drink when there are two people (she explained that they assume two beverages if there are two people).  I've been around and never heard this, anywhere. Barely got out of paying for two ..but not before being lectured in front of my date. Fun bar, really, but the customer isn't always right.", 
    "review_date": "2014-08-19"
  }, 
  "OYlSuykLYL8axSPcf5u-wQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Treassure G.", 
    "review_text": "I had the chicken n waffles &amp;baked Mac n cheese. The Mac n cheese was tasty. The waffles were fluffy n moist n the chicken was alright better wit the syrup. They gave fair portions I felt it was worth every cent.", 
    "review_date": "2014-09-08"
  }, 
  "fKN1WhWWuqlIKPL2NjAJ0A": {
    "user_rating": 4.0, 
    "user_location": "Fussa, Japan", 
    "user_name": "John H.", 
    "review_text": "I came here towards the end of last Saturday night, and I wished that I had come earlier. The crowd looked like it had died down a bit from before, but with the live Blues going on people were still partying it up! I'll have to try this place out again a little earlier in the night to see what the scene is REALLY like. But for now - 4 stars.", 
    "review_date": "2013-02-15"
  }, 
  "KofmcukQnRz9mjKOS0u66g": {
    "user_rating": 5.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Rose H.", 
    "review_text": "Ok, I should have updated this a long time ago, but I guess better late that never, eh?  Tupelo is the BEST, and has become one of our favorite NB spots to hit.  They have a great wait staff who do  a super job of keeping everyone's glass full, even during the games when they are packed.  The menu has some great food on there- I highly recommend the wings and the chicken and waffles, but really, you can't go wrong with anything that has a side of waffle fries.  Great spot in North Beach with a great staff to boot.", 
    "review_date": "2014-01-17"
  }, 
  "pgHCj7DSqI8NWx7WucnH3w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew S.", 
    "review_text": "I think of this place as North Beach's ultimate anytime bar.   To give you the quick run down, I've lived in the neighborhood for 5 years and Tupelo is without a doubt my go-to bar when I want to go somewhere that's simple, satisfying, and consistently delivers on a wide array of offerings.  First off, its a solid bar with well priced drinks and excellent southern food. The fried chicken, chicken and waffles, blackened catfish, meatloaf, po boys and burgers are all home-runs. Depending on if there's a band that night, it can be rockin like The Saloon (with a little less grunge), and if no band, its a great mellow place to catch a game with a friend, have some stellar food and catch up over drinks.  If this place isn't your cup of tea, you are drinking some prissy ass tea.   Go here.", 
    "review_date": "2013-09-08"
  }, 
  "F_5_UNX-wrAFCXuAkBZRDw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rodney H.", 
    "review_text": "This review is strictly based on Tupelo's Tuesday Night Dance Karaoke and it was a blast.  Definitely come by to check this out and watch DJ Purple do his thing as he provides instrumental back up on his Saxophone and Harmonica.  The guy is awesome because he can also provide backup vocals as well.  So even if you're a never newbie or if you're completely bombing up on the stage, he definitely has your back covered.    I could see why this was voted \"Best of the Bay\".  The regulars here are really good and the song choices here are very upbeat since this is Dance Karaoke after all.  And the song selection is pretty extensive.  if you're in North Beach, this is great spot to hangout after dinner for some great entertainment.", 
    "review_date": "2014-07-29"
  }, 
  "kVse5lPbrFuJD-BTKDUitA": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Lynn L.", 
    "review_text": "I wish I could give 1/2 stars on here, because this place is more like a 3 1/2 than just a three.  I'd come back here just for the live music.  It's easy to get to and the crowd and staff were laid back. We only had drinks, so I can't comment on the food. Good place to stop if you're doing a little bar hopping in the area.", 
    "review_date": "2013-06-02"
  }, 
  "D2b4DENpkezsw90fC2vWdw": {
    "user_rating": 3.0, 
    "user_location": "San Pablo, CA", 
    "user_name": "Kim-van T.", 
    "review_text": "I had a Bloomspot deal that was near expiration so I hurriedly recruited my sister and went to Tupelo for a post-work dinner.  It's a sit yourself situation with the menus already on the table. We were waiting for a server that never showed up and it turns out the bartender was doing double duty! Once we realized there was only one person doing all the service we were more patient.  We had to split $40 worth of stuff so we ordered the: - sauteed shrimp po'boy with tupelo fries (aka crisscut fries) - hamburger with pepper jack and egg that came with tupelo fries - garlic and brie mac n cheese - a duvel  I didn't get to try the po'boy because I was way too full but my sister said it was \"OK\". The hamburger was tasty - gooey runny egg everywhere - sign me up! It came with two huge slices of tomato but definitely not enough lettuce - more vegetables please! I like the bread/toast that the burger comes on though. The mac n cheese was eh - it wasn't mixed very well so there were pockets of blandness and pockets of extreme garlic flavor - also arrived at the table lukewarm.. meh. I wish the tupelo fries were seasoned a bit more.  Overall not bad but not sure I would return.", 
    "review_date": "2012-08-23"
  }, 
  "2Z0eNtcyAmbSp00yJUJrcA": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Nic T.", 
    "review_text": "Best all around bar in N Beach:  -Great drinks. -Consistently solid live music (Dave, Teague and Ben are da men). -Some of the best Bartenders (Wrecka, Jess, Anna, Paulina*, Janice**, Niles, T the Hippie Owner, etc.)  *Even when she tells me I'm bein a douche, I still love the scrappy little Bostonite, cause she's usually right. **AKA J-Nice cause she has a permanently positive attitude (almost annoyingly so but never quite enough to be so. Just enough to make her the cutest lil ball of asian bartender on earth) no matter how the days goin or what drunk asses she is having to put up with.  *&amp;** I feel like if I'm lucky enough to get a chick to stay over on a Friday night I am almost obligated to bring her in and get Janice and Paulina's approval (the nice and the hard ass combine to see through untold layers of bullshit) The Place also has: -A ton of space.  Really only gets crowded on Friday and Saturday nights, at which point it can be as hot and humid as Tupelo, MS.  But its usually poppin off to the point you don't give a crap. -Even the bouncers P &amp; G are great guys. -Great consistent food", 
    "review_date": "2014-06-16"
  }, 
  "OHkMbpKDbHYdEjNDoenCxw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen M.", 
    "review_text": "What a great time!! Last night I went to see The Bonedrivers, a local SF band that I don't see play around SF. They played mostly cover tunes but their originals rocked!! I would've loved to hear a few more of those. The crowd was really fun and the dance floor was packed most of the night. Unfortunately, I hurt my knee so was unable to join in the fun--this time. I'll be looking for these guys to play there again--hopefully soon!", 
    "review_date": "2014-01-12"
  }, 
  "bDdYz4QM4Eeq-P_j_nzJ5g": {
    "user_rating": 4.0, 
    "user_location": "Williamsburg, NY", 
    "user_name": "Stav K.", 
    "review_text": "Stumbled upon this place one night to a live jazz band which was awesome! The crowd was dancing and enjoying their drinks to the max. Will definitely be going back again.", 
    "review_date": "2014-08-30"
  }, 
  "FTaK1-DOKyUNXaRam_B3ug": {
    "user_rating": 2.0, 
    "user_location": "North Wales, PA", 
    "user_name": "Alex D.", 
    "review_text": "This place was nice. Good music, nice decor, and great food. I had the catfish po'boy and was very happy with the crispiness and texture of the roll.  I'd like to thank Tupelo: I've never had any sort of adverse reaction to food, so never really took people seriously when they begged off work, citing food poisoning. But after having chills and rapid shivering so bad that I could barely walk from my shower to my bed, and spending half the night either on the toilet or hugging a trash can, I'm now much better equipped to understand and sympathize.   Even as I type this out, there is a rumbling in my stomach...  ...Okay, back from my third bathroom trip of the day (for reference, it's 9:20 AM). That was my Tupelo experience.", 
    "review_date": "2014-04-07"
  }, 
  "rOfo4haBZazT2-uj2GdX2w": {
    "user_rating": 1.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Emily B.", 
    "review_text": "Went here for brunch on Sunday (9/16/12) to use my Bloomspot deal before it expired. The place was dead (except for people a the bar watching the Giants game). I should have known something was up. Turns out their head chef quit a few days before and they were in a tough spot. I guess whoever they got to cover the kitchen can only make 3 things: eggs, wings or a caprese sandwich :\\ We were hungry and I wanted to use my deal so we just got a few drinks, the eggs &amp; wings.  For now, the food at this place majorly sucks. I'm willing to try it again though once they've gotten their act together in the kitchen.", 
    "review_date": "2012-09-17"
  }, 
  "y4nmzXJbxcT5vsKltFPiRw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "AMY M.", 
    "review_text": "Terrible service, rude bartenders, sticky bar.", 
    "review_date": "2014-06-23"
  }, 
  "5XAXkk6WENi0OW_HSSXRWA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Chuck D.", 
    "review_text": "Pretty cool bar with live entertainment along one of the smaller back streets in North Beach. Was there on a recent Saturday night. Place was packed and there was some sort of big band ensemble performing. Classic San Francisco bar if you ask me. Diverse crowd, good times being had by all, live music performing, good drinks.... Quintessential North Beach... I liked it. Sadly, friends that were with me, did not. Hahah....  Drinks, If I remember correctly were pretty strong. I dont know the pricing because my friend bought us a round before we moved on to another bar. Check Tupelo out.. Might be your thing.", 
    "review_date": "2013-11-14"
  }, 
  "PJV_PhRe_gp8u8IfdmWc6Q": {
    "user_rating": 1.0, 
    "user_location": "Concord, CA", 
    "user_name": "Cynthia G.", 
    "review_text": "Absolutely the worst survive .., I have never had a meltdown Siri grab me and asked for my ID absolutely absurd ..... When asking for a manager I'm told that everybody in the place is a manager which is absolutely a joke... Don't go here it's a joke", 
    "review_date": "2014-10-26"
  }, 
  "ZvXz_4JPxCergjjjVFwVow": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Chad T.", 
    "review_text": "I came here to watch the Niners game and the experience was less than stellar.  Mediocre sound system, understaffed, and not a lot of team spirit. The only plus side was that it was pretty empty, so it was easy to get seats for our large group.", 
    "review_date": "2012-10-15"
  }, 
  "SPK6XrxnSFxbeY-YLW3Yyg": {
    "user_rating": 4.0, 
    "user_location": "San Antonio, TX", 
    "user_name": "Sean M.", 
    "review_text": "Went here for birthday brunch, and Janice did a rad job of taking care of us. We listened to Michael Jackson's greatest hits, and got to have a pretty good selection of soul food. The chicken and waffles were delicious, as well as the beer selection. Janice made a pretty rad toasted jalapeno shot that was stupid good.", 
    "review_date": "2014-08-10"
  }, 
  "0FjQTNMNl7hVK-Zc48X8tQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura C.", 
    "review_text": "Oh YESSSS.  Came on a Thursday night with some friends for dinner and drinks.  There was lots of open space as there were not too many tables...some improvements could be made on their furniture floor plan.  Our waitress was funny and peppy but not in an annoying way at all.  The food was reasonably priced, but the drinks took up a hefty chunk of the bill ($8 glasses of wine and I think $10-12 cocktails).  But now onto the goods:  Specialty  Cocktails : the \"Steve McQueen\" - super sweet, as it was a sweet tea vodka drink the \"Ray Charles\" - whiskey and bitters. mmm  Apps: Fried Pickles - I mean, how can you go wrong Brussel sprouts and bacon - gotta get your veggies somehow right? i'm sure if  my mother had cooked brussel sprouts like this when I was a kid I would have been so much more excited to eat them Roasted Garlic and Brie Mac and Cheese - if there is one thing you should get here, it is this. It is heavenly. It is glorious. I wish I could eat this for breakfast, lunch, and dinner.    Dinner: Candied bacon burger with pepper jack - It is everything you dreamt of and more. Candied bacon is the new black. Just do it.  Dessert: Apple crisp a la mode - I don't really like fruit-based desserts (I'm a chocoholic and damn proud of it) but oh. my. god. The four of us dove into this at lightning speed. It was gone before you could blink.   Overall this is a great new spot - a perfect place to start your night, especially in the heart of North Beach with so many other bars around to venture to after the meal.  I think they still have some things to work out  since they are so new so I can't give them a 5 yet.", 
    "review_date": "2011-12-03"
  }, 
  "yA7t1I5Z7-GcJX7NgkgwoA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stu S.", 
    "review_text": "This is a bases loaded home run, and one of the first in many a moon up there in beautiful North Beach.  Tupelo boasts a staff all with outstanding credentials in the booming business of good food here in Frisco by the Bay.  The place is just plain sexy, good looking doesn't describe how good looking, how inviting, how alluring and then how seductive Tupelo is.  Spacious, clean, lived in, warm and filled with visions and scents that make me want to spend some serious time here.  The menu is wonderful, southern with class and style, compelling and evocative and makes my mouth drool just reading it.  They've got small plates that are original and well thought out, and it's the best bar menu I've since since diner's originated.  I'm all about burgers and when you experiment with this sacred caw, you better have knowledge of what the burger  really is and how important the components are when creating a great dining experience.  I'm a true Chow devotee and the captain here at Tupelo is from Chow where they've served a great burger for many years and have not found it necessary to alter their perfect presentation.  But when I saw a cheeseburger with candied bacon and blue cheese which really caught my attention.  It sounds so terrible, yet I know it's addictive and intensely tasty if I give it a chance.  I tend to be against too much messing around with burgers, but all the versions here at Tupelo are intriguing and sound well conceived.  Fried pickles, Pork broth boiled peanuts (an acquired taste I imagine), Pork Belly Po Boy, roasted garlic and brie Mac 'n cheese, grits served in many ways inventive and ordinary,  salads and small plates that spark the imagination and are all pretty damned good.  But I'm your burger guru, and the burgers here at Tupelo are really top notch in ingredients, preparation, presentation and delivery, and I love their waffle fries too.  I have to add that the staff here are winners, charming, fun and committed to making everyone's Tupelo experience one they will remember and want to return for more, and more.  A great place that also has a great bar and bartenders.", 
    "review_date": "2011-11-17"
  }, 
  "vdDdSI3Cey4yJmmwY1JIHQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cake W.", 
    "review_text": "This place is a dive bar.   Bartender was friendly. Food was ... good....? Odd, we came on a Tuesday night and the food was actually flavorful and sauce was delicious. It was cooked right, so you can tell the kitchen knew what they were doing.   BUT HOLD ON! The pork belly was cold in the center. My boyfriend spit it out immediately and instead dug into the fried okra and mac and cheese (which were both good). My theory is that since the place was really slow the entree was cooked a day or two before and then reheated. The dish was still actually really flavorful and good, but it was really strange that it was cold in the center.... fully cooked.... it wasn't underdone at all....  My catfish was the same. It came out warm with a lukewarm center.... a blackened catfish....   You might think that maybe they left it out for a while. But that couldn't be true because it came out oddly quick..... like in ten minutes after we ordered. Also, if it was left out, then the center would be hot and the outside would be cold.  But both dishes were cold on the inside.   Bleh.", 
    "review_date": "2012-09-11"
  }, 
  "1I1Zr6yuTkyPRiqe8qD5Ow": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sabrina L.", 
    "review_text": "We headed to North Beach to go eat at \"Capp's Corner\" only to find out that they're closed on Tuesdays. We had parking so we decided to roam the neighborhood for a different place. North Beach was packed with tourists and so were he the restaurants. We walked by Tupelos and saw an open table so we went in. They have a full bar and sports on, so that was a big plus. We started with some apps, the chicken wings, fried pickles, ham hock croquettes and pulled pork sliders. All the apps were good but the sliders were my favorite. We enjoyed our mains, the pork belly po' boy was good but more tomatoes than pork belly. One friend got a green salad and the greens tasted smoky, which we all thought was a bit strange. The place got a bit busy and our waiter Darren was working alone, bartender, busser and waiter all in one. He handled it in stride and was very nice. I'll go back, though I don't go down to North Beach that often.", 
    "review_date": "2012-07-04"
  }, 
  "fOftdXPHJItSB7i-cbkThg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brooklyn R.", 
    "review_text": "Half of my family is from Alabama (shhh, don't tell anyone, I'm trying to look cool over here) so I've always been a big fan of Southern fare. San Francisco doesn't have enough places that serve soul food/Southern cuisine, so I was beyond excited when this place opened up in our new neighborhood a couple of weeks ago.   Tonight, Mr. Brooklyn and I dug into the following: baked mac 'n' cheese, mascarpone grits, shrimp po' boy, fried green tomatoes, and pecan pie for dessert. Truthfully, although the tomatoes were pretty good, the breading was a tad bit heavy for my taste; a lighter coating would have really allowed the tomato flavor to shine through. I washed my meal down with a cosmo, which fortunately featured a generous pour of vodka (shhh, don't tell anyone, I'm trying to look cool over here and avoid the perception that I'm some sort of Sex-and-the-City throwback from 1999). We emerged from Tupelo 500 pounds heavier and extremely satisfied with the meal, the standouts being the po' boy, the grits, and the over-the-top-amazing pie.   Other bonuses: friendly service, plenty of space in which to enjoy our meal (not too crowded yet!), and a fabulous jukebox that allowed me to savor my grits to the strains of The Jam, The Clash, and The Smiths. Looking forward to going back and enjoying the collard greens, cornbread, and Brussels sprouts next time around.", 
    "review_date": "2011-11-23"
  }, 
  "6KpxOoUnQyYGTd3Fuwk_lA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paige W.", 
    "review_text": "Bar with decent music guests and karaoke on Tuesdays (if karaoke's your thing).  Good liquor and beer available.  Nice stool seating by the windows!  Also, very good baked macaroni and cheese and buffalo wings.", 
    "review_date": "2014-07-05"
  }, 
  "Bw18f_vUTzL_GhI5YkkeSQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer P.", 
    "review_text": "Live music and fried pickles ftw!!!  The boyfriend and I love coming here to listen to live music. The drinks are nice and strong and not overpriced, the service is good and the fried pickles... oh the fried pickles!!! If you've never had them before, they are a must try. If you have eaten fried pickles before, these will be better than you have ever had!  Every time we have been to Tupelo, we have had a great time. The atmosphere is fun and inviting, but it never seems to get too crowded where it's stuffy and annoying. Definitely check it out if you are in the area!", 
    "review_date": "2013-08-07"
  }, 
  "IELpSxzHontqAxltwpnMxg": {
    "user_rating": 5.0, 
    "user_location": "San Anselmo, CA", 
    "user_name": "Lauren F.", 
    "review_text": "I love this place. Easy to get a drink, comfortable seats, and staff that is real but great. Knowing that this place can be crazy busy or not a seat taken in the house is fine by me so I know going into that any atmosphere is possible. I've been a number of times and have always enjoyed myself.   The music is perfect too! Good prices too for drinks", 
    "review_date": "2013-08-14"
  }, 
  "9MNumsdViMbqwH3LjGRCSw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Elease T.", 
    "review_text": "Tuesday night, 11 30 pm. This place was exciting. Karaoke! If you love karaoke, this is where you need to be. It's like non stop fast pace karaoke fun. It almost was like when you perform here, you are definitely someone on their way to stardom. All of the people had talent and not just with singing. These people were some for real performers. I say put a jar on the stage and let these people make some money I'll be back for real", 
    "review_date": "2014-09-03"
  }, 
  "-oHua9-DSzzIHRjI_WRQrg": {
    "user_rating": 2.0, 
    "user_location": "Santa Monica, CA", 
    "user_name": "Zahir A.", 
    "review_text": "Came here on a Thursday night for the promising soul food. I was met with average soul food  and horrible service - it took 45 minutes to get some meatloaf and a po' boy - which is ridiculous on a less-than-average night.  The food itself was good. I would give it about 3.5 stars. Soul food is hard to find in SF and this place can fill that craving. It's good, but I'm not going to waste precious time waiting in a lousy bar for that kind of food.", 
    "review_date": "2013-05-03"
  }, 
  "NVndhVfffw7ScRKviRdRYw": {
    "user_rating": 1.0, 
    "user_location": "Woodland Hills, CA", 
    "user_name": "Sam L.", 
    "review_text": "Yuck. I'm typically not one who goes out and will not finish eating my food. I try to finish and eat my food even if I don't like it, but I just couldn't finish this at all.  Had I not eaten all day and had we not just walked up a huge hill, (and I was tired!) I would have gone somewhere else.  The inside is... well, I guess there's just no other way to put it... seedy. We came here for food and it's more of a bar...and not even a nice one. It's not a gastropub by any means of the imagination...and I really don't understand Southern soul food coming from a grungy bar. I guess I should have realized this.  On their website, they mention something about a southern fried chicken dinner special on Wednesday. This sounded good. When we got there and saw the menu, it's non-existent. We asked our waitress who didn't seem to really know what that was. Okay...  The bar seating - uncomfortable. We then moved down to a couple tables in the front and ate there. Not to mention that the seats were really dirty. Yuck. If these are dirty, I can only imagine what the kitchen must look like.  The food was horrible.  I had the chicken dinner (since they \"didn't have the chicken and waffles yet\") and I was so disappointed. The fried chicken was burnt. The breading didn't have a terrible taste but it was overwhelmed with a burnt taste. I will admit that the inside of the chicken was moist but as I said, the burnt breading overwhelmed the dish. I didn't like it.   The southern slaw that it came with was off. It was sour and peppery? and just didn't taste right to me. I only had a few bites and that was it. Ick.  It also came with a rosemary herb biscuit which was atrocious. It tasted like a salt brick and was dry as a bone. Definitely either old or wasn't baked properly. For a second, I thought I was back as a prisoner in Alcatraz (since we had just come from there) since where else would I be able to get a salt biscuit like that?!   The mashed potatoes were the only saving grace. They were okay. Could have easily been from a box but at least they were edible.  My boyfriend had the ribs which I tasted the mirapoix which was on the ribs. They definitely did not reduce the red wine out of that sauce. Yuck! I'm not sure how he ate it.   Lastly, the restaurant is not sealed properly. The smell of people smoking outside wafts through all the cracks in the windows. Yuck.  Terrible food. Lousy atmosphere. I will never go back.", 
    "review_date": "2013-05-21"
  }, 
  "qH05mGW_t7q59ipCMgFQpQ": {
    "user_rating": 1.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Nacho B.", 
    "review_text": "I would give this place a higher rating if it wasn't for the bouncer that sexually harassed me. Ladies watch out for the big guy that works on the weekends. He just might try to stick his finger up the front of your skirt. My friends and i will never go back to this place.", 
    "review_date": "2012-03-23"
  }, 
  "qIZ7Vki3PO2931muG4N_8A": {
    "user_rating": 2.0, 
    "user_location": "Newport Beach, CA", 
    "user_name": "Ally M.", 
    "review_text": "Good food but terrible service. The servers spent more time talking to each other than helping us. Napkins and silverware would have been awesome but were not at our table and were never offered. Unfortunately, though the food was good I will not come again.", 
    "review_date": "2012-04-28"
  }, 
  "7gh0Sy2fM31LobXYoPp3tA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susan C.", 
    "review_text": "Good place to go for a drink (or three) and hang out: wide selection of beers on tap and fun atmosphere.   Ate there twice, once for brunch and once for dinner.   For  Southern \"comfort food\" their portions are a bit small for dinner, but their brunch is a better deal.  Waitstaff are a bit frazzled but nice.  All told, it's probably best to treat this as a bar that serves some food on the side, rather than as a destination restaurant per se.", 
    "review_date": "2012-06-30"
  }, 
  "gxf8fSYqMVfgvKs50AKerA": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Nhung T.", 
    "review_text": "We were in SF one day with my cousin and my boyfriend really needed a beer.  We had already been walking up three hills when we decided to go to this place for some booze and food.  I was already cranky when I came in and immediately sat down at the first table I saw.  This place has the nicest waitresses!  I could sense that she saw my crankiness from afar and offered us some water right away.  We drank it all.  She then came back with a bottle of bourbon...that was filled with water.  Coolest thing ever and I from then on I was smitten.    We each ordered a burger and fries and it was really good.  The meat was tender with juices flowing, just the way I like it.  Though the interior might be a little intimidating, it is worth a try.", 
    "review_date": "2013-08-02"
  }, 
  "tRe5Xy5P5-QH79FuiGAIyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christian C.", 
    "review_text": "Great chicken and waffle fries, strong drinks and friendly service.  This is one of my favorite neighborhood haunts.  One caveat is that the live music during dinner time tends to be loud and often mediocre.", 
    "review_date": "2013-09-06"
  }, 
  "Gi_QuNrhFI_q82ZY-ezzGw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Belinda w.", 
    "review_text": "The food in this place - SUCKS.....Tried the mac and cheese/ mascarpone grits/ shrimp grits, The mascarpone grits sweet with a burnt smell... yuck, mac and cheese overcooked and tasteless in spite of oodles of cheese, shrimp like rubber, potatoes overdone. It's hard to find a restaurant in San Francisco with really bad food but I guess this is an example of a chef who does not eat his own food. The service - slow and poor despite all the empty tables! Tupelo - best to avoid, try Brenda's Soul food. that place is awesome", 
    "review_date": "2012-06-12"
  }, 
  "TX9rMdLU0wlw4qF6s3l1YA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "o. c.", 
    "review_text": "Went there last Friday before a show at the Grant and Green. Can I just say, I have had a lot of so-so Southern food in SF and some really shitty bar food and I can categorically say that the food at Tupelo was above board on all accounts. Mark Danzinger's take on Southern inspired bar food was superb. The smoked tomato jam with the vegan grit cakes left me wanting more, OH and the ham hock fritters were AMAZING. Speaking of pork, I got a po'boy with blackened shrimp AND pork belly (mouth is starting to water) and needless to say I walked out, well needing to be rolled out more like it. Full, happy and with a bag of leftovers I proceeded to commence the rest of my evening... definitely worth a trip if you are out in North Beach", 
    "review_date": "2012-01-19"
  }, 
  "P4AaLUwn9Eie4NraWE1LbQ": {
    "user_rating": 5.0, 
    "user_location": "Chico, CA", 
    "user_name": "Eve H.", 
    "review_text": "Really a great place for many reasons.  A. Great menu of southern food to tickle your fried fancy B. Live music C. Sports D. Cute bartenders E. Cool old building in North Beach F. Oh, of course, FULL BAR! Last time I was there Jessica served us. My friends from LA were visiting and they LOVED the chicken and waffles. Jessica was sweet as pie. The service was fast and prompt. She's a pretty great bartender too and makes a delicious margarita! Five stars for Tupelo and their southern smorgasbord! Check it out if you're ever in North Beach.", 
    "review_date": "2014-02-27"
  }, 
  "eyDH5tUe7Hl7rZX9vAYV-g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth L.", 
    "review_text": "This has been a fun little neighborhood bar in the past, but...  Last time I was there I asked the bartender for a Jameson and ginger ale.  I watched her pour something from an orange/clear colored bottle.  Jameson is always in a green bottle.  When i mentioned this to her, she just said \"taste it.\"  It wouldn't really matter.  You can't pour Jameson from a non-Jameson bottle- and Jameson is green.  She remade it, but it was a pretty short pour.  All ginger ale.  I was not amused.", 
    "review_date": "2014-04-27"
  }, 
  "aZ6j5wyq4oda4h4IiLJwcw": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Yeelo N.", 
    "review_text": "Live music at this place is a definite plus...especially if you like the band.  Overall, I wasn't super impressed with the 2 bartenders (ONLY) on staff during a very busy Saturday night.  Getting drinks took about 15+ minutes.  Time can be much better spent enjoying the venue, the band, and your company.", 
    "review_date": "2013-09-11"
  }, 
  "KheemzNvPqrxDtOqdrOQ5g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meredith M.", 
    "review_text": "Cool bar. I stumbled upon. Nice staff, super friendly. They have trivia on Wednesdays. I also saw a friends band play here, which was great because there are also TVs for my boyfriend to watch the game. Good bar food (I had sliders, they were pretty tasty) and a decent selection of beers on tap.", 
    "review_date": "2013-05-01"
  }, 
  "bMeJaRAxQwuwYt0Cnfxksw": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jee C.", 
    "review_text": "might be the chillaxing spot for night but don't go for brunch.  my server was friendly but she had to take care of the entire hall by herself.  slow service, kinda dark atmosphere... and parking was challenging.", 
    "review_date": "2012-04-10"
  }, 
  "dYbIkLXPSXDpq8ZhKSmNeg": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Stephen C.", 
    "review_text": "Ana the manager/bartender is an old friend and a great chick.  She's there almost every night of the week, she loves what she does and it shows in her service.  The southern style comfort food here is legit.  Fried pickles, pork belly, hot wings (that have a very unique smoky flavor), and mac and cheese!  Perfect food to fill the cracks between the shots.  They are starting a new karaoke night with DJ Purple soon with live instruments accompanying your sweet drunken pipes.  It's going to be awesome.  If sports are your thing, there's a number of flat screens and a large projector pumping out all the ESPNs you could hope for.", 
    "review_date": "2012-08-19"
  }, 
  "POmyqedLjt06Gfajf1of5Q": {
    "user_rating": 3.0, 
    "user_location": "Hoboken, NJ", 
    "user_name": "Nicole S.", 
    "review_text": "Came here on as Sunday for some football and southern food. It was about 1pm so prime lunch time. Otnce we sat down we were told they didnt actualy have much food available so all the deliciou s things listed on the menu were not there :( they were able to scrounge up some wings and burger but I am confused if this place is  bar or a restaurant. I would go back but probably just to drink.", 
    "review_date": "2012-09-26"
  }, 
  "4eyi_rOSkcyjktKDI-C0Qg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Jennifer A.", 
    "review_text": "This bar is a blast!  The crowd is fun, late 20s-late 30s, the energy is great and the drinks are great. On the night we went, there was an awesome classic rock band that got tons of people onto the dance floor. Grant Street is a great location, there are lots of bars to go to around the area. This bar was better later in the night, and got crowded around 11:30 or so. We stayed until it closed and there were people there all the way through last call.", 
    "review_date": "2013-05-31"
  }, 
  "Pv0sWLqu65LMV9uyXGlFYg": {
    "user_rating": 4.0, 
    "user_location": "Hialeah, FL", 
    "user_name": "Julian C.", 
    "review_text": "During my stay in San Francisco we found this little bar while trying to find a place to watch a basketball game. THANK THE LORD this is the place we found. The place had a nice dimness and was pretty spacious. The service was nice and fast and it turned out to be a great place to watch the game.  We ordered the wings and as soon as you take a bite, heaven in your mouth. they were amazing and are probably one of my favorite wings.  I could have made my dinner off them wings!", 
    "review_date": "2012-06-27"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "Wow this bar becomes quite rowdy on a Saturday night!   With a live band, full bar and a good crowd, you would want to check this place out when roaming around in North Beach!   Located next to many other bars within the same street and its vicinity, this one stands out because it's placed right in the middle of them all!  They offer beer, cocktails and fast food kind-of-food!  Don't expect to hold a conversation when chilling, however, because it gets extremely loud and you'll be stressing your throat!  When you're wanting to bar hop in North Beach, mind as well go with the flow and hit up this one as well!", 
    "review_date": "2013-02-13"
  }, 
  "nM1Ldn0n4zdv8kl0K8sXDQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin B.", 
    "review_text": "This place was just...okay.  Luckily we got some half-priced drinks for Yelp Drinks week, or else the bill would have been absurd.  I ordered the Creole Shrimp with Mac and Cheese side, which was $15... okay, a little steep, but hey I thought, it's seafood...    ...But when my food came, there were only 6 measly shrimp and a pretty tasty but over-cheesed (is that possible??) mac and cheese side.  For the price and the calories I would have definitely expected better flavor.  The drinks were also okay.  Probably won't be returning.", 
    "review_date": "2012-03-02"
  }, 
  "09T1oyi6c-9lvyt7gQCD2w": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Peter L.", 
    "review_text": "My kind of place as it is dance karaoke so the songs are more upbeat!  Both times been here were on a weeknight; a Yelper brought us here after a YEE so I brought other yelpers again. Half full on weeknights is a good thing if you don't want crowds. However, it was still pretty popping fun! And, the wait for drinks or to get your karaoke song in is pretty quick. I can imagine this place being packed on the weekend considering its location.  Inside the place looks like a larger and brighter dive bar except with a stage for singing and a live karaoke DJ. The DJ sings along if needed, and even plays a music instrument if it is in the song! How fun is that?!  There are a bunch of song folders but the list is not extensive - nor overwhelming - with popular songs and somewhat up to date. There is a large projection screen and  TVs all around to help you with the words. You choose a song, write it down and deposit into a small bin container by the DJ set. Then, you wait until the DJ announces it's your turn to sing. There is no payment required but donations are accepted.  Note I've noticed a higher number of rap and hip-hop songs performed here but the singers are definitely not urban (have you ever seen a middle-aged/retiree rapping before?) which makes it fun for everybody.", 
    "review_date": "2014-07-28"
  }, 
  "VlVx6clfF7iZfO_idvuMfA": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Amanda G.", 
    "review_text": "Stopped in here for drinks on New Year's Day.  We were waiting for a table at Tony's, so we had some time to kill, and the nearby bars were closed.  We found this place, and the lovely bartender, Janice.  Drinks were well made, prices were about what I expected, and the bartender was friendly and pleasant..  Would definitely come back if I was in the neighborhood, or wanted to see some live music.", 
    "review_date": "2014-01-02"
  }, 
  "GCuDiPUKYxhgFHP5LqJa2Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gloria H.", 
    "review_text": "Came in to support an event helping out a local homeless person, who is basically brain dead from a hit and run.  We had 2 drafts each at $5 (Boddington and Sam Adams) Grit cakes - $5 - very good blackened catfish w/ collard greens - $15 - very small portion but it was tasty  We bought raffle tickets too.  Many local businesses contributed with gift certificates and gifts - we didn't win but it's ok, all for a good cause.", 
    "review_date": "2012-06-29"
  }, 
  "plwsnim_4M5sNCfeQM7qEg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Jeremie F.", 
    "review_text": "Super fun and friendly staff. Even helped me load my gear out when I had to leave the private party.   The buffet food was good and the beer list was up to my standards.", 
    "review_date": "2013-01-06"
  }, 
  "UzAzou8Xxv3bP8RVUBGGcA": {
    "user_rating": 2.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "AJ D.", 
    "review_text": "Went for brunch today.  Apparently Tupelos is now a Patriots bar.  I went several times last year and never noticed this, maybe I just got lucky. But avoid this place if a Patriots game is on and you don't want to watch the game. We couldn't even get them to change the channel to a different game on a TV that no one was watching.  Then at some point they decided that everyone in the bar needed to listen to the commentary at full blast. Conversation at our table became hopeless and we finished our food as quickly as possible so that we could leave.   Patriots football at a southern inspired bar is weird to me.  Particularly when you refuse to show games for teams that are actually from the south.  Also, they have drastically cut down their brunch menu.  They now have a 5 item menu, and only 2 of the items were actually available today... The only reason they get 2 stars is that the \"American breakfast\" was decent.  I was looking forward to watching some football at this place this season as I did last year, but the experience today, and the message it sent, was terrible. I won't be back.", 
    "review_date": "2012-09-09"
  }, 
  "r4x-GaFyzvTIPT1NrVe3oA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ruth C.", 
    "review_text": "The dance floor is great! Outlandish and outstanding dancers make it easy to just do your own thing. The musicianship of the bands is top notch. Inspiring, energetic bands have been playing every time I've been there. People dance where they stand too. Wooden floor boards throughout the bar so if you get the urge - go for it!", 
    "review_date": "2013-12-07"
  }, 
  "Tm7FLeltftguSertjPJiqg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jimi S.", 
    "review_text": "Good Grub and Friendly Bartenders. I hope they make it fly cause we need some more Southern Cooking in this city... Yes, the portions could have been a little bigger for the price but all in all a good meal...", 
    "review_date": "2012-07-09"
  }, 
  "Hx4dpQ_QkF5_md6NOtkN3Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Numa R.", 
    "review_text": "Wings,Wings,and Wings. I don't know how everything else is but the wings are the best in the city. Service as good as it gets for the staff that they run with.", 
    "review_date": "2012-06-25"
  }, 
  "Zm9A2hOZ9y1VaJgJBSL51A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mandy A.", 
    "review_text": "This is one of my favorite bars in the city. It is one of the first places I ever went when I moved here and I find myself coming back all the time. The service is friendly, the live music on the weekends is always awesome (lots of classic rock and good jamming music) and the crowd is always fun! There is not much more I can say but that it is a must go! Good draft beer selection too :)", 
    "review_date": "2014-11-20"
  }, 
  "TjiTwu58ITP6yFPeSTpc_A": {
    "user_rating": 4.0, 
    "user_location": "San Ramon, CA", 
    "user_name": "Florence M.", 
    "review_text": "This place is not what I would call a dive bar.. maybe a bar trying to be a dive bar? Either way I liked it, super relaxed atmosphere and great oldies music playing and a black and white film noir playing on the screend made this a fun place to chill. I didn't eat here just had drinks for a little bit. My friends and I were actually dancing across the street at TOPE when some of our group decided that it was just too crowded for them! ( not to say that I blame them it was insanely crowded) so we went across the street and ordered some beers and sat down at one of the tables. The nice thing was that the boys stayed there and the girls went back to Tope and continued our dancing, perfect setup for groups with non dancing members who just want to sit and drink! I do wish they had dancing here though because I love to shake it to Elvis as much as Lady Gaga!", 
    "review_date": "2012-04-29"
  }, 
  "tj6FMFRvTHhJ_84yPJParA": {
    "user_rating": 5.0, 
    "user_location": "North Beach/Telegraph Hill, San Francisco, CA", 
    "user_name": "Christopher L.", 
    "review_text": "This place has the best food! Their Mac &amp; Cheese is amazing! Bartenders are friendly and amazing. Karaoke is the best in town!!!", 
    "review_date": "2012-09-11"
  }, 
  "o2hGEscmGLeZhUatcseEyg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Barbi T.", 
    "review_text": "Best fried chicken EVER!  Can't afford a trip to New Orleans? Just stop by Tupelo. The moment I walked in I felt like I was drinkin in The Big Easy. Paulina &amp; Erica will get you wasted, so be warned. Did I mention the fried chicken?", 
    "review_date": "2014-01-17"
  }, 
  "I-E1pOirEiw7-X-mFbxmIA": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Erin P.", 
    "review_text": "I've been here three times, all on Thursday and Friday nights, and every time there was loud live music (albeit not bad), but it's a little prohibitive for conversations--so check ahead of time to see if they're having live music before taking someone there on a first date or to catch up with an old friend!  Bartenders are a little slow, but not abysmal.  The Southern style cuisine (hence the name Tupelo) is really good; I highly recommend the baked macaroni and cheese.  Prices are pretty moderate for San Francisco.", 
    "review_date": "2013-01-04"
  }, 
  "pfIv1WLD3ED_K-JDr2hT6A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kate B.", 
    "review_text": "We were lured into Tupelo on a Saturday night by the blues music coming from inside. The band was fantastic, and I wish I knew who they were!   The place was lively, but not too crowded. Bar tender was not friendly and took my boyfriend's credit card and then came back 5 minutes later saying that they had a credit card minimum... then she forgot which credit card she had and it took a while for her to find the correct card to return. We didn't eat anything, so I can't comment on the food, but the service was mediocre, beer was good, atmosphere was laid back yet lively and the music fantastic. I'd love to go back!", 
    "review_date": "2013-04-08"
  }, 
  "qHmLQQZF1GKrU6HFZqZqGA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela D.", 
    "review_text": "Came here and waited about 15 minutes at the bar for the bartender to serve us. He looked very drunk and was talking to his friends that were already seated. He did not acknowledge me or my friend and obviously did not want our business. We got fed up and went to Maggie's instead. They ended up trying to chase us back into their establishment but seriously, they need to learn some customer service here.", 
    "review_date": "2011-12-27"
  }, 
  "3bPPhMoWH6AD5A5Im5u3WA": {
    "user_rating": 3.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Mike B.", 
    "review_text": "was hear on New Years Day with a group. It was surprisingly not crowded, especially considering that neighboring bars were closed.  We had a few drinks and only got the waffle fries to share.  Those were good.  We sat at one of the low tables which was kind of awkward both to eat at and to mingle.  Fun crowd, cool servers. Would definitely go back.", 
    "review_date": "2012-01-04"
  }, 
  "SuHt70nQ8uGVAWXPO26hUg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa S.", 
    "review_text": "Just get the fried pickles:)", 
    "review_date": "2012-11-11"
  }, 
  "AqwTAjoyG5HfhQi2-ab4cw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alice W.", 
    "review_text": "Came here on trivia Wednesday and the place was pretty empty. This was the only trivia place that we've been to that wasn't packed. Our waitress was very nice and we got our food/drinks promptly.   We shared the short ribs and the burger. The short ribs were on a dry side, and a bit too salty for my taste, also. The burger was good, though -- huge juicy patty and the potato chips were most excellent.   The place is more 3.5 star than 4, but I'm rounding up :).", 
    "review_date": "2012-10-19"
  }, 
  "VgtcRwMPiAEeuPsayXB4kA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maximillian M.", 
    "review_text": "Cozy little watering hole with TV, live music, decent tap selection, and deep fried eats.", 
    "review_date": "2013-05-23"
  }, 
  "TLJZzsqtDW-loSGsuvTcwg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adele A.", 
    "review_text": "Its a bar with bar food, nothing amazing nothing terrible. EXCEPT for the fact that the server overcharged me $122.61!!!! When I called to correct the situation, the \"manager\" who sounded super young and not invested in Tupelo (she said she had to call me back b/c she had to go to her 2nd job) was not even apologetic and flippant about what had happened. One hundred twenty-two bucks is not exactly chump change here! At least apologize for screwing up and train your servers to know how to handle people's hard earned skrilla. I won't be coming back.", 
    "review_date": "2012-03-28"
  }, 
  "sTWlQeq2XUIEp6V6G2YONg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen H.", 
    "review_text": "This place sucks is about right.  The food is nasty  and they want to be The Saloon. Save yourself the hassle, eat somewhere else and go to the Saloon. DOn't waste your time here.", 
    "review_date": "2013-08-04"
  }, 
  "qV_gG-uT3inPQOnbYDgEQA": {
    "user_rating": 4.0, 
    "user_location": "Redwood City, CA", 
    "user_name": "Justine S.", 
    "review_text": "One of the best bloody marys I have had in SF.  Spicy with all the fixins.  Havent tried the food but the menu looks good.  Bartender was friendly and gave great service :)", 
    "review_date": "2013-02-11"
  }, 
  "wqWgY6avVU-RdQLzVZIxLQ": {
    "user_rating": 5.0, 
    "user_location": "Kentfield, CA", 
    "user_name": "Cordelia P.", 
    "review_text": "Best bar staff in SF! Great burger, good music, awesome night. Would recommend to anyone looking to have a good time.", 
    "review_date": "2014-12-04"
  }, 
  "_FXVdsXTr567hMmgR0M7PQ": {
    "user_rating": 5.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Anthony L.", 
    "review_text": "Music music music I can not express enough how awesome and lively the bands are that get booked here. Teague is a great performer and musician and a decent bartender. I love the whole staff there. They have amazing burgers that come with fries pork slider and I still need to try their shrimp and grits. It's definitely not like the grits you get served in Jail. But really come check out the free live bands or root on the Giants here at my favorite hot spot in North beach and the city", 
    "review_date": "2014-08-06"
  }, 
  "WF9A2oRNIOntssNoeBqHsQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tam A.", 
    "review_text": "This place has been through some changes since the last time I've been there &amp; they are AWESOME changes.   The food: great selection of southern classics &amp; the options to build your own burgers or girts is perfect for the picky eaters!!! &amp; it came to the table from the back a lot faster than I thought it would. The back staff did an amazing job preparing everything!  The atmosphere: went on a wednesday night for girls night &amp; they had cartoons playing! It wasn't too crowded &amp; we were met my Erica right after we took our sea ts. It was perfect we didn't have to yell at each other but there was enough noise to keep our conversations fairly private.  Overall: I can't wait to go back &amp; hope to venture out to North Beach more often to this SF Gem! Go Team Tupelo!!!", 
    "review_date": "2012-07-20"
  }, 
  "y5z9m-H9T-Rk64RoaA8DvQ": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Sheana A.", 
    "review_text": "What a great place!  After walking around North Beach and rejecting one touristy-looking Italian restaurant after the other, we found Tupelo.  It was JUST what I never knew I was looking for: fun atmosphere, great classic rock playing, and great food.  We both ordered the chicken and waffles.  It was to die for!  THe chicken was crispy and perfectly savory and the waffle was crisp and browned.  Top it all off with savory slaw, sweet maple syrup, and butter, and make every bite a little bit of heaven.  And all this for $12!  I'll be back again.", 
    "review_date": "2013-10-18"
  }, 
  "sKXaBdtNtRlWWh67deBf7w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "autumn t.", 
    "review_text": "Tupelo does have a lot of potential - but there are a number of things to work on as well. However, for being in their first week, Everyone was very friendly and interested and I think they are doing a pretty good job and I look forward to what they do in the future.  Here's what we had:  Fried Pickles - awesome. though I'd like a bit more for the money.  Pork Broth Boiled Peanuts - good, a little weird if you're not used to them. hard to eat!  Friend Green Tomato Salad - very good but tomatoes need a bit less breading.  Pork Belly Po'Boy with Tupelo Fries - Too much bread. I honestly could not taste the pork at all. The fries were average.  Roasted garlice and brie mac n cheese - super tasty. don't change a thing about it!  Other thoughts:  I didn't expect it to be so .. Bar-ey. When you walk in, you really have no idea that it is a restaurant. AND - they need a better creaft beer selection to round it out. Their food would taste great with some great craft beer.", 
    "review_date": "2011-11-15"
  }, 
  "jVaiCNmWOjoI0led5LZuyA": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Danny C.", 
    "review_text": "This place plays the best music. Tupac, Biggie, anything that might be dance-able gets playtime, and the live dj's always know how to bump it. The drinks aren't too expensive, and there's a decent-sized dance floor to get down, but the only problem is the sheer amount of other people who grind a little too close to you or spill their drinks all over you.", 
    "review_date": "2013-02-19"
  }, 
  "RNykyhuDMH24mO29b2iyxQ": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Jim R.", 
    "review_text": "Love the soul food here, especially the mac &amp; cheese. It's also a huge bar with plenty of space to move around.", 
    "review_date": "2013-04-05"
  }, 
  "Sz600UsLJJaw9XDBpa_4ZQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Renae K.", 
    "review_text": "So excited that North Beach has another unique location to frequent!  I've been to the bar a few times, typical North Beach bar. But what I'm really reviewing is the food.  I've eaten at Tupelo twice now - once for brunch &amp; once for dinner, and each time has been pretty good... but dinner here definitely wins our vote.  Brunch - We had some sort of pepper pancake (unique &amp; tasty), eggs &amp; grits (OK), and the tupelo fries (ie regular waffle fries).  Everything was good, but nothing to shout about.  Dinner - Now dinner was a MUCH tastier experience for us (or maybe it was just the foods we chose). We had the Tupelo burger (delicious but greasy), Garlic Mac&amp;Chz (overpriced for the size but good flavor), &amp; the Mixed Green Salad (really tasty &amp; smoky).  As other reviewers mention, the burger IS really tasty, but my date and I both thought it was fairly greasy, and our stomachs definitely agreed.    Overall the dinner was a pleasant surprise for a bar, and so unique to San Francisco. Tupelo has now entered into our North Beach dining rotation!", 
    "review_date": "2012-01-17"
  }, 
  "4T2uVlRjkl0eogswfL2bTA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julie J.", 
    "review_text": "This is a large bar that is a bit dingy.   We went of trivia night, which was fun but difficult! We probably only got 1/4 of the questions right.   They have a decent beer selection on tap and a food menu. I didn't order any food but it seemed like standard bar grub.   I would go back for the trivia!", 
    "review_date": "2014-01-15"
  }, 
  "_0WAdWO7wNr19wqYYgDfIg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Amy P.", 
    "review_text": "Service = 2 Atmosphere = 3 Comfort Cuisine = 5  Tupelo, the only soul food restaurant in San Francisco's North Beach district, is a beyond satisfying find on Grant's one-way alley-like street. Do not let the service and atmosphere sway you because what is served on piping hot plates from a small kitchen behind wooden cafe doors is hands-down delicious. Chef, Mark Danziger, serves rich flavors, authentic recipes, and enough pork to make any meat lover proud. Your decision to check out Tupelo should be easy as pecan pie.  Menu highlights: Iceberg Wedge, Roasted Garlic Brie Mac &amp; Cheese, Collard Greens w/ Pork Belly, Tupelo Burger w/ your choice of additions, Crispy Pickles, Pecan Pie.", 
    "review_date": "2012-02-12"
  }, 
  "k6zYbMle3LI9jhMuY4Tc4w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alison Z.", 
    "review_text": "We came here for lunch on a weekend. Nice place to get away from the crowds on Columbus and the other brunch spots with lines out the door. The fried pickles were excellent, coated in a beer batter (much better than breading!).  Mac and cheese and pulled pork were just fine, but nothing special. We'll certainly come back for other food (there were many things we wanted on the menu), and mark this down as a good place to watch sports (where you can actually hear the commentary!) .", 
    "review_date": "2012-07-22"
  }, 
  "yzrukGWpdm6KGIHRAYo_rg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lei H.", 
    "review_text": "I was pleasantly surprised by our dinner here.  The menu didn't seem that impressive but my hubby really wanted to try it.  We had creole shrimp with grits, mustard green and cornbread and a burger.  The creole shrimp grits were awesome.  Great presentation.  Mustard green was decadent with bacon.  The burger was huge and delicious.  Only $10.  We will be back.", 
    "review_date": "2012-10-13"
  }, 
  "z1Is1jRbQYFy7cr3620hzA": {
    "user_rating": 4.0, 
    "user_location": "Concord, CA", 
    "user_name": "Leslie C.", 
    "review_text": "Alas, the Niners may have lost the Super Bowl this year, but Tupelo won as a nice, mellow bar with just enough hipster flair to make me feel cool, but not too much to make me feel really self conscious about liking pop music. I was expecting complete craziness for the game, but the bartenders performed admirably and with a smile on their faces :)  Yummy chicken wings, delicious Big Daddy IPA on tap and nice people. Thanks for a good time Tupelo.", 
    "review_date": "2013-02-04"
  }
}