{
  "_Ns0FHLoO6S03PqmQ1XjtA": {
    "user_rating": 5.0, 
    "user_location": "Goleta, CA", 
    "user_name": "Stephen T.", 
    "review_text": "Good drinks, didn't get to try the food.", 
    "review_date": "2014-12-08"
  }, 
  "L6mI1A5ozbtlkuX4lZuEig": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer W.", 
    "review_text": "Wonderful owners!  Beautiful food and drinks. Mellow and fabulous! A must go in Hayes Valley.", 
    "review_date": "2015-01-21"
  }, 
  "Oqd-imxmJo-wI5Rif36vEg": {
    "user_rating": 3.0, 
    "user_location": "Coto de Caza, CA", 
    "user_name": "B L.", 
    "review_text": "If the village bookshop that Belle visited had also sold hand-crafted cocktails, we'd know it was Two Sisters. Stopped in here for drinks just as one of their small tables was opening up, and had a great time. You definitely feel like you're in a private home, since the space is intimate (read: tiny!) and the light levels are inviting (read: dim but not dark).  My friend and I had two rounds there, and both had different bevvs each time, and loved what we selected. We were killing time before a show, so we didn't have time enough to stick around and try their plated items.  Three stars (charming atmosphere, friendly staff behind the bar, and good value for expertly crafted cocktails) until I can return and try more of their offerings.", 
    "review_date": "2013-11-07"
  }, 
  "L1px4LQVX-zO8qw0grD1Ug": {
    "user_rating": 4.0, 
    "user_location": "Castro Valley, CA", 
    "user_name": "Dawne L.", 
    "review_text": "This bar really evokes a neighborhood Parisian cafe feel -- the dark and intimate (yes, small) space, the quaint wallpaper, the small library by the entrance... It's a great little spot to cozy up with a book in 1 hand and a drink in another -- if it's not busy, of course, which is probably rare seeing how popular this place can be on the weekends.  We came on one of those rare occasions -- lots of available seats, so we were really able to appreciate the ambiance.  The servers were friendly and accommodating. The menu was limited and a bit on the pricey side for the portion size, but the food, while not spectacular, was good.  What we had: Braised pork meatballs  Scrambled eggs with asparagus and spring onions (brunch item) Grilled cheese sandwich and tomato soup (the kids loved dipping the sandwich in the creamy soup)  They serve brunch from 11-3 on the weekends. Also, weekend happy hour is 1-4p -- loved their Salty Dog cocktail!", 
    "review_date": "2014-04-06"
  }, 
  "jiJzsDbf5vLRYiLU_5rLnQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas R.", 
    "review_text": "Very cute little bar with solid food offerings. Met up with a friend on a Saturday evening- was a little worried it was going to be crowded, but we got a table without too much difficulty. It's just a scramble system, though, so you might want to get there early if you don't want to be standing at a bookshelf. Saw some earlier reviews that noted it was beer/wine-only at the beginning, but they do have cocktails now (although it didn't look like they really had a full bar, for those who want to order their own off-menu cocktail). Nice vibe and decor.", 
    "review_date": "2012-01-16"
  }, 
  "HzBX7ToMsp-GDu_Wb2N44w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "David C.", 
    "review_text": "Five stars for the drinks and love their deviled eggs, but I just wanted to get the chef's attention that the bread pudding is unacceptable. Dry,dense, tasteless and definitely overpriced. Try again or have another veg option on the menu except for your $12 grilled cheese (which I should have ordered). Other that, i do like this place (even though the bartenders act like cyborgs with no personality or niceness).", 
    "review_date": "2014-10-08"
  }, 
  "4IjzfbO7XKFNWWVufHNhww": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Natalie N.", 
    "review_text": "Ambiance and cocktails were 5 stars all the way. Two of us came here on a weeknight at 6pm, the perfect time to actually snag a table! By 6:30 it was jam packed with people already. I ordered the chamomile old fashioned and it was made very well. That was the best thing I ordered, and at $10 a pop I am glad I liked it. The bartender was really friendly and made sure everyone was helped.   Now, onto the food. I was really disappointed in what we got. Maybe we ordered the wrong things and should have gone with the classic grilled cheese. We split the bean salad, which was nice but over dressed. In my opinion the short ribs were just not very good. For $15 the portion was very small because the ribs had barely any meat on them and tons of fat. I know they should have some fat, but I think they should be trimmed back a bit.  I would come back for the cocktails and the really nice dim ambiance, but probably not for a meal.", 
    "review_date": "2013-02-06"
  }, 
  "qINMdy3-ng2ZYyCu4TjkHg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevi L.", 
    "review_text": "I went here after awhile at Biergarten nearby.   My friend and I loved the drinks we ordered. The bartender was friendly, helpful, and seemed genuinely appreciative when I complimented the drink she made. I definitely recommend the Stout n' Spice, it was a very creamy, old school flavor. Reminded me of the whiskey drink my grandpa likes to drink :). The only thing I was bummed about was that I missed happy hour! I'll definitely be coming back with a date.", 
    "review_date": "2013-09-15"
  }, 
  "irFk4niiXe5iR-C7mgjy_w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tasha D.", 
    "review_text": "This place is so fun, with books, delicious cocktails, interesting food. I love stopping by here when I'm wandering through Hayes.", 
    "review_date": "2013-03-15"
  }, 
  "IxQrE6BuM_QKnjSq6kVglg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lois W.", 
    "review_text": "Stumbled across this little bar in the Hayes on a rainny night, totally in love with this place! I consider it a perfect place to grab a drink and do some reading in an afternoon, or grab a drink and have a conversation with good company any evening.  Have yet to try the food raved by Yelpers, but I'm sure a fan of their cork screw with housemade tabasco sauce!", 
    "review_date": "2012-12-26"
  }, 
  "7LaFixn8n2VyDAbPLUPTlQ": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Madelein M.", 
    "review_text": "Exactly what I was looking for that evening. Romantic and intimate, it was perfect for a glass of red wine and good friends. Looking forward to going back and trying some other items on the menu.", 
    "review_date": "2012-07-09"
  }, 
  "S98-Rqdlb9axhYcVW1tNYQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn F.", 
    "review_text": "Really want to love this place, because it has a cute story, quaint &amp; cozy vibe, and friendly staff. But I've had disappointing dishes here on two occasions.   The first time, I got a really amazing pickle plate, and a-okay deviled eggs, followed by overly bread-y/grainy and sorta dry meatballs.   The second time around was for brunch, and I thought the place was surprisingly empty on a Saturday around noon. I got the $13 duck cassoulet with 2 poached eggs. Eggs were poached perfectly but the rest of the cassoulet was kinda of a soupy slop with minimal threads of duck and some white beans. I expected a richer stew. This was served with 2 slices of baguette. My friend got a grilled cheese, which came with a small bowl of tomato soup. I sampled the grilled cheese and it was delicious and gooey and very very buttery. Also,  did not care for the house red, which tasted slightly sour.  So, hits and misses every time.   Now accepts credit cards.", 
    "review_date": "2013-03-11"
  }, 
  "gYdx3POVviEoVSFXgIYElg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Eva C.", 
    "review_text": "I loved the atmosphere in this bar and the wallpaper too :-) They have a good list of specialty cocktails- interesting combos...chamomile old fashioned is one of them. Its a great find to grab a drink with a friend or a pre-dinner cocktail. Try it out", 
    "review_date": "2013-12-26"
  }, 
  "YKgrNyT29bfbMKMvQnhxVQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vanessa L.", 
    "review_text": "A bar + a library = amazingness!", 
    "review_date": "2013-01-24"
  }, 
  "-buDVsBHSP--elVc92vIxw": {
    "user_rating": 5.0, 
    "user_location": "Fresno, CA", 
    "user_name": "m t.", 
    "review_text": "this is one of those places you find in SF and always want to go back.  I've been several times.  It's small and sometimes crowded but you always seem to get good service no matter the size of the crowd.  The specialty cocktails are some of the best i've had in SF.  Great spot to start your night with some tasty food and cocktails, spend your night, or end it.", 
    "review_date": "2014-01-09"
  }, 
  "Rx7DNBmPPShVjlcQidGuTw": {
    "user_rating": 5.0, 
    "user_location": "Mountain View, CA", 
    "user_name": "helen t.", 
    "review_text": "get the spring's arrow drink.  w/ a sugar/salt/black pepper rimmed glass, this drink is refreshing and delicious!  the only thing i don't like about this place is that it's cash only.", 
    "review_date": "2012-06-10"
  }, 
  "wfrwo-D7Ax4iBhMsE2_k8Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anya Z.", 
    "review_text": "I am very particular about my cocktails, there is always something not quite right: too sweet, to watery, too much liquor, needs more lime... I am hard to please. But the girl (one of the sisters?) was able to make me something I really enjoyed based on the vague description of what I imaging it should taste like.  My favorite cocktail place in the city so far.", 
    "review_date": "2012-10-15"
  }, 
  "tUgKLP5lYOZT9pduudsl7g": {
    "user_rating": 5.0, 
    "user_location": "Pacific Heights, San Francisco, CA", 
    "user_name": "Nick R.", 
    "review_text": "Stimulating atmosphere, knowledgeable staff, amazing food and drink. Small plates, good feels.", 
    "review_date": "2014-10-18"
  }, 
  "11XoIrUVyolyZFoni-KdLg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tia B.", 
    "review_text": "What a gem!  I wish I knew about this place sooner.  Great cocktails.  Good food.  And it is the sort of place that I would happily spend chatting with a friend drinking a coffee, or by myself reading a book.", 
    "review_date": "2012-09-11"
  }, 
  "4J1JxLSPODFiZOfxTg21dQ": {
    "user_rating": 4.0, 
    "user_location": "Garrison, NY", 
    "user_name": "Gary W.", 
    "review_text": "This review is long overdue. I visit San Francisco occasionally, but I'm mainly in the East Bay. However when I visit, I always recommend a trip to Two Sisters. My first time here was on a whim when a restaurant up the road was backlogged and our reservation was going to be an hour behind. Good thing for us. We landed here and had an awesome time. First of all, one of the best Manhattan Bars in town!!! Hands down. The bartender is awesome, and knows his stuff. Don't ask him whatever he would get, tell him what your' favorite tastes are. The Duke was great! Also, the fresh snacks and cheeses were a nice touch. The only thing keeping this from a 5 is the size of the place. It's narrow, and I'm a big guy, so I do like my space, but I make due each trip. I'll bet after another visit or two my care for the size of the place may get pushed aside and this becomes a 5.", 
    "review_date": "2012-12-04"
  }, 
  "698eySbPg2NX92Ctmvue9w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurel M.", 
    "review_text": "Oh, the tunnel vision in here is intense. It is, however, the best place for inventive, tasty cocktails. Their small savory dishes are really fun to share with a girlfriend. Simple, but great ingredients, and well timed in the service. Finding a suitable place to eat them can be a challenge. Well worth the trip and time invested, though.   Lovely, Two Sisters. Thank you.", 
    "review_date": "2014-05-20"
  }, 
  "AboDsr79uxgp4XxAJYcwDA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ms Firecracker X.", 
    "review_text": "HOLIDAY DRINKS: 12.20.12 @ 4:30 PM  A place the size of a postage stamp. <a href=\"http://www.yelp.com/biz_photos/two-sisters-bar-and-books-san-francisco?select=gDTreoiP9WKw1sME1FYmjQ#9uWgC1Gy0vfkb_NjtToQkA\">yelp.com/biz_photos/two-…</a>  Once the door closes, once you adjust your sight to this very dark gastropub, after your first sip of the strong but well-crafted manhattan, you will be embraced by the warmth and coziness of the Two Sisters Bar and Books.  Two Sisters is a very tiny space that has more length than width.  A display window holds vintage-looking books. Aside from the tea lights on the bistro tables,  the only lights are coming from the festive holiday street lights and the sign at the bar.   <a href=\"http://www.yelp.com/biz_photos/two-sisters-bar-and-books-san-francisco?select=gDTreoiP9WKw1sME1FYmjQ#7cs_wKkc_Qom1CTNjUkXLg\">yelp.com/biz_photos/two-…</a>  Bars usually intimidate me but Two Sisters made me feel right at home with its  cozy Victorian-esque ambiance-- old books, candlelights, a display window. The jazz completed the scene without being played too loud.  The bartender is probably the friendliest and most relaxed one I have met.  Patrons that evening included a group of middle-aged folks in business attires, a girl reading a book, and a couple on a date.  IMBIBE: Two Sister provided a comfortable venue for me and my gf to catch up.  She took advantage of the HAPPY HOUR $3 DRAFT BEER while I ordered HARVEST MANHATTAN (a delicious concoction of rye, pumpkin liqueur, vermouth, bitters) $10 from the regular menu. Whew, so strong and so tasty!!!!!! 5 hours  later and I was still buzzed over this one drink!  EATS:  My gf (The Cute Yoga Queen) refused to eat prior to her session but I ordered a plate of CRATER LAKE BLUE $7. It came with a wedge of semi-firm blue cheese, crusty bread, marmalade and head of too raw garlic. Delightful! (I skipped the garlic.)<a href=\"http://www.yelp.com/biz_photos/two-sisters-bar-and-books-san-francisco?select=gDTreoiP9WKw1sME1FYmjQ#IrspdiLR2adlfwp7Bc7DUg\">yelp.com/biz_photos/two-…</a>  VERDICT: A great find! A darling little bar! It is now my new secret place on Hayes whenever I need a little respite from the crazy world. I will be back to try more the long list of wines and cocktails. A great place either for a FULL DINNER, CHARCUTERIE/CHEESE $7  or LITTLE SNACKS$5 of potato chips or deviled eggs to go with your drinks.   FUTURE EATS: Nex time I will try a plate or two of the following big plates:  salad, fish, braised ribs and duck cassoulet.  TAB: $18 before tip (1 beer, 1 manhattan &amp; 1 cheese plate)  HAPPY HOUR Tues.-Fri. 4p - 6p/Sat.-Sun. 1p - 4p $5 cocktails and $3 beers  CASH ONLY.  A PERFECT VENUE FOR HOLIDAY DRINKS! (But I hope to be back every season!)", 
    "review_date": "2012-12-28"
  }, 
  "WPBrjBbk76ZtZQ8QpG09cQ": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Henry L.", 
    "review_text": "Small vintage-ish bar in Hayes  Ran into this little store while walking around the parks nearby. From the outside, this place looks like small library, with books on the entrance, small wooden tables and chairs etc. Once you go in, you'll see this place is actually pretty quaint inside, with a bright bar and bookshelves etc. The place is kind of small so I'd imagine they'd have limited seats at night when there would be more people out drinking  In terms of the drink, I got an chamomile old fashioned, which didn't taste that great to me. It was quite strong--the strong dose of alcohol and orange masked the taste of everything else, so it basically tasted like drinking pure alcohol with an orange in it, as opposed to, well, an old fashioned.  Overall, a pretty nice vibe and decor inside. Pretty cool place to hang out once in a while.", 
    "review_date": "2015-01-18"
  }, 
  "sHwBXS0trP0CC_f5K_11VA": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Tai F.", 
    "review_text": "We dropped in here for happy hour. It's really a bar with a bunch of books in it. I enjoyed a delicious gin gimlet. CP had a beer. We shared the deviled eggs. The gimlet was delicious (though not as strong as I would like). It was a happy hour drink so it was only $6. No need to order the eggs. They were only okay. Nothing really stood out about them. I think CP would have really preferred to stay longer and get his read on. If you want to drink and read try to allot enough time for both. The happy hour prices are nice. This is a cute little bar with some good energy for all those bookish, alcoholic types (Bukowski like).", 
    "review_date": "2012-07-16"
  }, 
  "1RER0eZqfK7DabrBDN_xSw": {
    "user_rating": 5.0, 
    "user_location": "Sydney, Australia", 
    "user_name": "Lital K.", 
    "review_text": "Was so looking forward to this place opening and finally I feel as though I have found another reason to go to Hayes Valley.  This place is the bomb!  Apart from the delicious food &amp; inventive cocktails the staff were just so attentive &amp; friendly I can't wait to return.  Good work guys- exactly what Hayes Valley needed!", 
    "review_date": "2011-12-02"
  }, 
  "LjjqjneBuvp94-v4l0wnNQ": {
    "user_rating": 4.0, 
    "user_location": "Union City, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "This is a really quaint place to have a bite and a couple drinks with friends. Not a lot of seating but the food they have here is priced well and delicious. My friends ordered their fish of the day and bread pudding and I got the grilled cheese with tomato soup. One of the best grilled cheeses I've ever had!   The cocktails here are also good. I ordered the Smitty. Gin, aperol, grapefruit, and house-made grenadine. Loved it! Great place to start the night.", 
    "review_date": "2013-12-03"
  }, 
  "LsfNeGnvI0oopb5tAnWq9g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Loralyn S.", 
    "review_text": "walked by this place on my way down the street, turned around and walked by again to figure out what the new place was, then wandered on in to a cute cozy atmosphere and stacks of books everywhere. i grabbed a glass of wine and sat in the window and forgot all about the errands i was on.  love this place, what a great wine nook!", 
    "review_date": "2011-11-23"
  }, 
  "YsAODKVrUMZg9OR_3RKL6A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah H.", 
    "review_text": "This is one of my favorite Lazy Saturday spots. It's dimly lit, small, usually not very crowded, and very (obviously) book/homework friendly.   They have a good happy hour and their beer choices are great. On a street that mostly has beer and wine bars only, this place serves hard liquor as well, often in imaginative combinations.   Love it here!", 
    "review_date": "2013-09-11"
  }, 
  "oHgs4Sf5HBtipchKZTe82A": {
    "user_rating": 4.0, 
    "user_location": "Alameda, CA", 
    "user_name": "Maggie T.", 
    "review_text": "This place is an amazing find! It is a little bit dark inside, but I like that it's small and intimate. I wouldn't recommend this place if you're claustrophobic. Their brunch menu is small, but the items that we had ordered were amazing! My egg was poached perfectly, and the flavors just came together so well. My bf got the peach salad and it was delish! The drinks looked really interesting and yummy but it was way too early on a sunday to be having a cocktail. Will definitely be back again!", 
    "review_date": "2013-10-18"
  }, 
  "-fXW5GBiW1vZMYKuQi2eGg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby M.", 
    "review_text": "I'm so torn about this review. I wanted so much to like this place. But with a name like Two Sisters Bar and Books, I was expected more of a library-ish ambiance. I suppose this place might have that ambiance during slower hours -- which is apparently not Wednesdays around 6pm. Overall, it was surprisingly dark for a place with a bookshelf full of reading material, super loud, and poorly laid out.   Regarding the layout: you have to go up to the bar to order, so if the line is more than two people deep, you're right on top of the tables next to the bar. (We made the mistake of sitting at one of these tables, and had lots of behinds, elbows, and purses in our personal space while we were eating.)  The food and drink were total five-star, though, which adds to my conflicted opinion -- I had the grilled cheese and the chamomile old fashioned, which were absolute perfection. My date had the Dark Matter, which I tasted and also loved. But I honestly had a hard time enjoying my food because I kept having to scrunch myself against the wall as people pushed past my table.  Really, if this place doubled in size and added some kind of sound-absorbing material, and maybe added a few extra lightbulbs, it would be just what I hoped it would be ... but alas, definitely not the case. It just wasn't the quiet drink 'n' bite over a cozy table I was hoping for.", 
    "review_date": "2013-01-31"
  }, 
  "8vPdAs4R7BP0xUmBGv8Llg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily B.", 
    "review_text": "Two Sisters is my favorite brunch spot. The food they serve is always made well and per order.  My personal favorites are the deviled eggs, New Mexico Cassoulet, and an Irish coffee.  Ive come for the bar scene as well, the chamomile old fashioned is amazing!", 
    "review_date": "2014-01-13"
  }, 
  "LEG1iL9N17Mi0eO4-ZQZYA": {
    "user_rating": 4.0, 
    "user_location": "Chicago, IL", 
    "user_name": "Zsiberian N.", 
    "review_text": "An experience worth having especially if you're into small &amp; intimate types setting vs. large and loud establishments.   Grilled cheese &amp; soup - unexpected, trustworthy, pretty good.  Try dark matter :)", 
    "review_date": "2012-12-07"
  }, 
  "VLa_NB-g7lAHAkp8oGr2Aw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tadeek P.", 
    "review_text": "Great place to go for a drink with a friend - delicious cocktails, cute place. Pretty tiny though, so wouldn't go with more than 2 other people.", 
    "review_date": "2012-04-01"
  }, 
  "rmjuUY08Ecb8Rm2i_Uuj8Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vandana N.", 
    "review_text": "Great newer bar in the Hayes Valley scene.  Generous wine pours, very nice bartender (speaking of the lady behind the bar during happy hour), great walnut pate &amp; salami.  Cute space, too... the fact that they have nice bathrooms in the back now (anyone remember the bathrooms when this was Fritz way back when?) I think the cheese menu could be expanded a wee bit (and maybe the size of the serving a little bit, given the price), but in general, I like the mix-n-match options that the menu provides.  We'll be back!", 
    "review_date": "2012-03-09"
  }, 
  "HCtEYgABFgwGhHB3rPQeQQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Coraly S.", 
    "review_text": "I love this little place. It's small, dark,  mysterious and just makes me feel good!!!! They have decent food too.  If you want a very greasy grilled cheese on a day when you need some comfort food, don't hesitate to order one here.", 
    "review_date": "2014-07-07"
  }, 
  "4ObdanERzpWLiOeJ4Q_VrQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie R.", 
    "review_text": "Fantastic atmosphere, talented bartender and incredible food - what more could you ask for?  My favorite neighborhood place for eats...", 
    "review_date": "2012-08-26"
  }, 
  "BPer81yL-_bEWRvkiASa5A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle B.", 
    "review_text": "My absolute favorite bar in San Francisco. Enough said :)", 
    "review_date": "2013-11-27"
  }, 
  "cCPjASKs5YpMB4BmN2oSZg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike H.", 
    "review_text": "Two Sisters is a great spot for drinks in a small group. Even four feels like a lot in a place of this size on the weekend. The great drinks here, ordered from a small bar, will help make your night (or afternoon) even better.   My girlfriend and I came here on what happened to be their 1st birthday party. $1 bourbon and $2 cava! These specials are good once year, though perhaps not next year. Since our previous visit in the winter, Two Sisters now accepts credit cards. Yea! Typically drinks here are on the pricey side, but in line with what I now expect in Hayes Valley. Often there will be 2-3 small plate options for nibbling, and perhaps a sandwich as well.", 
    "review_date": "2012-11-05"
  }, 
  "14arke6X9GW90wmnWD74eQ": {
    "user_rating": 4.0, 
    "user_location": "San Fernando, CA", 
    "user_name": "Daniele D.", 
    "review_text": "Cute and cozy spot to grab a drink and a snack. I love their decor and book theme, although no one was actually browsing through any books. They have happy hour from 4-6PM with $3 beers and $5 wines. I had the Magnolia beer and it was refreshing and smooth. I also ordered the deviled eggs and the potato chips. Both dishes had a citrus element to it that made it taste very fresh and delicious! The potato chips were thick and cooked perfectly with a sauce that was creamy and yummy!", 
    "review_date": "2014-05-07"
  }, 
  "BFNVTFyGZZ_IzzWCRpPrbg": {
    "user_rating": 3.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Benjamin L.", 
    "review_text": "This place has yet to get a liquor license so it's just beer and wine to start. But it was a very interesting atmosphere, just a very interesting place to drink, not so sure why it is 4.5 stars, probably because of the food which i did not have. But a very nice local bar in the area. Cocktails is probably not the word to describe this place but more so, mixed wines.   just A-OK will have to come back again to try food.", 
    "review_date": "2011-12-05"
  }, 
  "BB1pO1aL7VWPOmRQvNM7Lg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Caroline K.", 
    "review_text": "I just adore Two Sisters.  The drinks are delicious (hooray for that liquor license so that they now have a full bar), the bites are so tasty and the staff is a delight.  Great spot to while away an afternoon talking to friends, or the staff and other patrons.  Everything here is heaven.", 
    "review_date": "2012-07-27"
  }, 
  "4lpAu8nFqMv1nXz5NLfcXw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shirley L.", 
    "review_text": "Really cute spot! My favorite drinks (I'm a fan of light and smooth cocktails) was the Back 40. Also really enjoyed their chips and creme Fraiche and deviled eggs. Highly recommend coming on a weekend afternoon to beat the crowds/grab one of the four tables.", 
    "review_date": "2013-01-13"
  }, 
  "ixAzWY0pBHd-1P0gUPFcTw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenn D.", 
    "review_text": "What a cute little hole in the wall.  I love having a better option on this block than the dodgey bar nearby.  It is warm, inviting and serves some tastey food.", 
    "review_date": "2012-08-09"
  }, 
  "0utAyzOIttwTcOGVY_838g": {
    "user_rating": 5.0, 
    "user_location": "Vancouver, Canada", 
    "user_name": "Matthew F.", 
    "review_text": "The best of the best", 
    "review_date": "2012-03-14"
  }, 
  "sXKmP90GCdF0oM0AzYRhaQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rika P.", 
    "review_text": "AWESOME cocktails. I tried their Breakfast Martini and my friend had their Bloody Mary - This is where we gladly ended up after our unfortunate, regretful Bloody Marys at Stacks we had that morning. I love their cute decor inside. Really pairs well with the chic Hayes Valley neighborhood. The number of seating is limited, and the space is tiny. But we didn't feel that we were being rushed, and in fact, the service is remarkably attentive. I love everything about this place!   :-D", 
    "review_date": "2012-04-02"
  }, 
  "p73oYdisgLldZDSjNMLefQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin F.", 
    "review_text": "The atmosphere is wonderful, as is the food. But really, I haven't had such good food in a while, especially at such a reasonable price. I'll definitely be heading back.", 
    "review_date": "2011-10-17"
  }, 
  "i3F3mF-nHBsovh8Soxds6g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa M.", 
    "review_text": "Such a gem of a place. The cocktails are Ah-mazing and they really have pride in their drinks. They're very knowledgeable and helpful.", 
    "review_date": "2012-06-08"
  }, 
  "FN9GBf0qq5Bd2kDnIBh90w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carleen W.", 
    "review_text": "I adore this place. nothing beats the mood of it. seems like a perfect date bar with someone else or even all alone. books everywhere, super super dark. cute little nook tables.  oh right and the cocktails. i'm not a super cocktail gal, but i'll have some. interesting drink choices.", 
    "review_date": "2014-01-02"
  }, 
  "a1qsUE9lmV47pRkTK3p7VA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aiko S.", 
    "review_text": "Girly friendships and musty old books. So nineteenth century. I love it when I'm walking by during the day and looking in. But at night, it is sooo nineteenth century, as in, pre Edison, and you can barely make out the person in front of you even if you're lucky enough to have a teensy candle that's half dying on your table. The decor is charming. I just wanted to actually be able to see it.", 
    "review_date": "2013-05-18"
  }, 
  "LzmC0SDuCp4Tps-k9fc0sQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Belinda C.", 
    "review_text": "i came here last night with my friends because i wanted to hear what all the buzz was about. And the yelpers did not disappoint me. This place is super cute! The have very classy chandeliers hanging from the ceiling , it makes you feel like you walked into an fancy french cafe.  However, their wall paper was an ancient Chinese themed that had dim sum and fried rice. The drinks were reasonably priced and all my friend and i loved our drinks, i think out of all of our drinks the best one was the Port of SF, I don't remember what was in it.  We shared their bread pudding. Make a note that their bread pudding is savory. It had roasted garlic, fennel, and tomatoes,  with black trufflle oil. It tasted like a pizza!   My friend also told me they do brunch here on Sundays and it's a 20.00 tasting menu. I need to come back here and give them a try. However, the only down side to this place is that it's Cash only.  I recommend this place for a date night.", 
    "review_date": "2011-11-13"
  }, 
  "70-IB6n4W11mqJM2JEYrSg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bess Y.", 
    "review_text": "The menu is refreshingly small, boasting only drinks and dishes that the owners \"truly believe in\". As someone who is easily overwhelmed by too many options, I was immediately at ease.  Two Sisters is like being at a bar and at home at the same time. It's cozy, romantic, and even a bit whimsical. The drinks are inventive, and the wine is impossibly good. We ordered the cobb salad, chipotle chicken sandwich, and the bread pudding. While it's the atmosphere, bar, and personnel that make the experience, the food is fresh and doesn't disappoint. Will certainly be going back.", 
    "review_date": "2012-07-18"
  }, 
  "pZZw7NqDFUxIg0YT0vls8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine A.", 
    "review_text": "I wandered in looking for brunch place in Hayes Valley- and Stacks down the street had a wait that would take me way into lunch. I wanted a relaxed, quieter place for the morning and Two Sisters Bar and Books was perfect! They had the most delicious egg sandwiches I've ever had! All the ingredients were fresh and high quality- I was really happy with my choice. I perched right near the window so I could read and eat and it was a perfect morning. All the workers were friendly, as well as all the patrons that came in that morning too- pretty impressive!  Gotta come back for drinks sometime soon!", 
    "review_date": "2012-11-21"
  }, 
  "zIjAnlO8_MqXXNTI_LvdOg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephen Y.", 
    "review_text": "Six words for Two Sisters Bar and Books: Friendly. Cocktails will make you smile.", 
    "review_date": "2013-03-03"
  }, 
  "b0lXNnfnZpKPv7xNwpG3Ig": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Jen C.", 
    "review_text": "I love love love the chill vibe of this place.  It was surprisingly busy for a drizzly Tuesday night and the staff here were all super sweet.  Really loved the Port of SF cocktail, the savory bread pudding and the pate.  Nice touch stopping to check if we needed more bread for the pate without us having to say anything.  The consistency and the flavor of the deviled eggs though was a bit weird.  Lots of small plates and bites to share while sitting around catching up with friends.  Minor complaint is that the small round tables are pretty tiny so if you plan on ordering a bunch of food it gets cramped fast.  Also, not sure if this is because they just opened but it's cash only and you have to order everything at the bar.", 
    "review_date": "2011-10-19"
  }, 
  "_don8EWxNsvRdjDJqWbw0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christine E.", 
    "review_text": "T-i-n-y!  Dim lighting, little room, small bar and cute decor. I didn't actually see any of the books but was assured that they were there. The drinks were good and strong, service  was interesting and a mixed crowd. Want to come back when they are serving food and to check out some of the books.", 
    "review_date": "2014-06-30"
  }, 
  "Suw8tiW7EHWpt7HhuB7SDw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alissa A.", 
    "review_text": "What's not to love?  Charm. Coziness. Bourbon. Bites. a 'Dark Knight'. (because we haven't all found the one in shining armor yet) Chamomile old fashioneds. The fact that the guy that last poured my drink was definitely *not* a sister. Background music sound check. Could've fooled me and told me a pianist was hidden behind the curtain. Any given night can swing from quiet romance to bustling, but not overly boozy. Bring your date and leave your fan club at home. There's room for two. Nothing more. Nothing less.", 
    "review_date": "2013-01-08"
  }, 
  "YhmZwGl0QLDZ5x0MDUhIFQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Louise V.", 
    "review_text": "Fantastic bartenders, great drinks, wonderful ambiance. This is one of my favorite bars in the city. Can't wait to go back.", 
    "review_date": "2014-01-04"
  }, 
  "UkrneyVGUwv3t9P7rVXGZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angela K.", 
    "review_text": "They get four stars because everything that displeased me about this place is due to the crowds that flock to this tiny little spot, even on a rainy Tuesday evening.   I ordered the house red wine, which was surprisingly excellent. I've only tried the deviled eggs, but they were divine. So great product, and great service.   The only problem(s) is that it was crowded: super noisy and squished and the lighting was dim and the door was open. Just uncomfortable.   It's ironic that it's titling itself as a book bar because the last thing you would ever be able to do in there is read. Me and my boyfriend were both charmed by the place... but then we had to get the hell out of there!   My advice: Go there, but avoid the rush.", 
    "review_date": "2013-03-20"
  }, 
  "Vgk1wh9ZqVF14jc0Eu4Irw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Missy D.", 
    "review_text": "delicious food, great vibe and perfect cocktails. I always get the chamomile old fashioned. so so good. their brunch is lovely as well. good place to meet a friend or have a pre-dinner drink with your date. very san francisco and best bar in hayes valley.", 
    "review_date": "2013-07-03"
  }, 
  "Sp-S4y8rx1xIX3d5VOK0bQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christy L.", 
    "review_text": "Awesome Happy Hour...at least from what I can remember of it ;)  I have been hearing good things about Two Sisters, so a co-worker and I decided to check it out.  Their space is small and intimate...you really feel at home. They have a good happy hour menu, with nice-priced bites and excellent cocktail specials.  I lost track of how many bourbon specials I consumed, but darnit...they were good!  Also loved the harvest manhattan.  Excellent selection of bourbon, rye, whiskey and scotch - I love my drinks like my men...dark and strong!  The food was also delicious - we sampled a few items: potato chips, charcuterie and cheese, meatballs and grilled cheese (served with tomato soup!!). All were made with top-notch ingredients and with love.  Really glad these lovely ladies are around...will be back again to share the love!", 
    "review_date": "2013-12-05"
  }, 
  "s8HajSM_n68caTegammHvw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "KT C.", 
    "review_text": "The minute we walked in we were treated extremely warmly. My friend and I got signature cocktails and they were amazing! I'll definitely be going back to try the food and have another cocktail :)", 
    "review_date": "2012-05-28"
  }, 
  "ApTTIn2xHV5bg0rM_R4zRQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Avital S.", 
    "review_text": "I love this little spot. The staff is friendly and helpful and even remember my multiple visits. It's a great place to get a carafe (or two) of wine and just sit. The food is always good and the place feels like sitting in the living room of your most sensational friend. It is cash only so bring the green or use the atm in the back, but definitely Go!", 
    "review_date": "2012-04-17"
  }, 
  "-Q5rD1LXsBlHqgZDgnBv6w": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Meghan E.", 
    "review_text": "This is brief because I was drunk, but they make the best deviled eggs I have ever tasted. And it was pleasantly dark and pretty inside.", 
    "review_date": "2015-01-19"
  }, 
  "PgN2-n_CNPVld9pmWBCgYA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sportsgal X.", 
    "review_text": "Came on a Saturday night after a night at the opera and there was maybe one other person in here.  Its a great space (super chill and really cute--definitely a girl's bar with great drinks) and the bartender (probably the owner?) is one of the sweetest bartenders I have ever met.  I'm so happy to have it right around the corner from me.  Nice to finally have a place in Hayes Valley to have a drink, read,  and its not a party party party place.", 
    "review_date": "2011-10-30"
  }, 
  "HAv257_IVJnQT0ZIL8Nn-Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Greg G.", 
    "review_text": "I really have come to like this place. Sure it's a small place but it's one of the few cocktail bars in the neighborhood. They have pretty good food with a kitchen open until 10. Mac and cheese is pretty good. They add pretzels to give it a little bit of crunch and flavor. Drinks are decent too. The service is really great as well. My fave thing here so far is brunch though. So you can get an egg sandwich with bacon, a breakfast cocktail (bloody mary preferred by me, although the one here is a little citrusy), coffee, and something for desert for roughly 20 bucks. Now that's a decent deal for all that in the city.  I really like the look of this place too. Books line the wall on the side of the bar, there is a little booth by the window, and then tables line the other wall. All with super dim lighting and just this really old decor in a narrow room that cannot be more than 7 feet wide. It sort of makes this just seem like some classy back alley bar.", 
    "review_date": "2012-07-27"
  }, 
  "ZqsPaSa6ks-T5R2H6dSPQA": {
    "user_rating": 3.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Joseph D.", 
    "review_text": "This review is based on brunch. We've also come a number of times just for drinks which we'd rate much higher.  For brunch we had the cobb salad, the summer squash sandwich, coffee, and one of their coffee +bourbon cocktails. The salad was by far the most disappointing thing- the bleu cheese dressing was watery/runnny, not very pungent or bleu cheese-y, and muted any other flavors in the salad. The salad also had a disproportionate amount of lettuce to egg, bacon, or avocado. As the bacon was more like ham, and not very salty, the whole combination with the watery dressing just tasted like a wet mess without much flavor.  The summer squash sandwich (which we added an egg to) was much better. Still a bit under seasoned through and we had to add ketchup to each bite. An okay sandwich but not solid by any means. The potatoes that came with the sandwich were also under seasoned and really had no flavor on their own. On the plus side, the ketchup seemed homemade which we appreciated.  The coffee here is excellent and our coffee cocktail quite yummy as well. Overall we would have rated the food 2.5-3 stars but given our experience with the place and their delicious cocktails, we rounded up to the 3.", 
    "review_date": "2012-08-26"
  }, 
  "BRh5hZvTU-xYXux5WnjBMQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy S.", 
    "review_text": "Not crowded.  Cool design.  Small plates. Easy drinks. I wrote a haiku about it.    I like bars and books. I go again and again. Two Sisters?  Sounds Hot.  --  Andy Savage  Thank you.", 
    "review_date": "2012-01-30"
  }, 
  "nZ6fZPcOSYEFEdqB-aBgUw": {
    "user_rating": 5.0, 
    "user_location": "West Hartford, CT", 
    "user_name": "Sofia H.", 
    "review_text": "I was really impressed when I stumbled upon this place....it seems like the kind of place you would find in a small town (the warm hospitality mirrored that).  The decor is super cute and the food was really really good.  The brunch was well priced at $20 (including tax).  It was served with two drinks (one w booze and the other w o) and a main plate...and while I didn't get to try any of their famous deviled eggs the experience was really awesome.  The staff are genuinely kind people and you could tell they were really happy you were a guest of the place.  I highly recommend a stop in!  P.S. - I love the concept of trading a book...although I wouldn't feel right trading one of my books for their lovely bound ones.  :-)", 
    "review_date": "2012-01-10"
  }, 
  "QBXAIu1Vm-nKXUwBqZ5H7Q": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Jessica P.", 
    "review_text": "A little cramped, a little busy for a Friday, but this is SF...Amazingly enough, unpretentious bartenders, decent happy hour prices and deee-licious cocktails. I love the atmosphere, as others have mentioned. My friends and I met here for drinks before dinner, so we didn't taste any foodie bits. I had several whiskey concoctions and all were impressive. I would only suggest a different color pen for the mirrored menu behind the bar - certain angles make it impossible to read what tempting cocktails they have to offer from your chair! I like knowing what I want before I saddle up to the bar, so I don't burden anyone with my deer in the headlight stare of the booze wall. They are good at what they do and the patrons all seem to enjoy themselves. I'd go back for sure.", 
    "review_date": "2013-10-09"
  }, 
  "8-YmSSIyE37D54dgq-3m9Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tammy R.", 
    "review_text": "The first couple of times I went here, I thought it was going to be a regular haunt.  The place is super cute, and the idea even better-a bar and books, what more could you ask for?  The food was great - the flavors spot-on and wonderfully presented.  It was obvious that some serious love went into my meals.  Unfortunately, I must report that something has changed.  The last time I went in, the menu was the same but the food was not as good at all.  A salad of brussel leaves that on my first visit was to die for, seemed to be hastily thrown together.  The tomatoes  not succulent and sweet but mealy, and the dressing far too oily.  My favorite thing on past visits was the meatballs and the bread pudding, but they too have changed for the worse.  The bread pudding was too dry, and the meatballs didn't have the same texture or flavor that I remembered.  Given my previous love affair with the place, I tried it one more time for Saturday brunch, only to be told by the woman behind the counter that \"brunch happens on Sunday\".  I think she's the owner of the place, and here's where I don't have much hope.  I've always felt that the place was outstanding, but the affect of the woman who worked there kind of grated on me-too cute, too fake, too much.  Won't be going back, but hoping they'll get the magic of their food back on track.", 
    "review_date": "2011-12-08"
  }, 
  "Rdesw9ekWdVNbvHfLYjQdQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jacob K.", 
    "review_text": "I went away to Tokyo 7 1/2 months ago and just got back two weeks ago.  Shortly before I left, I wrote my 99th review, and I vowed that I wouldn't write my 100th until I found a real 5-star establishment.  It took a while, but I found it...2 blocks away from my apartment, at that!  What a nice new surprise to come home to (it opened two weeks after I arrived in Japan).  I love living in Hayes Valley, but it bothers me that this neighborhood doesn't really have any good neighborhood bars or cheap eateries.  I wanted Two Sisters Bar and Books to be at least one of those, but really, it is neither.  Instead, it's a cute little over-priced super-yuppie date spot, with that perfect hint of San Francisco pretension (one word: \"gastropub\").    There's great beer on tap (I got a Brekle's Brown Ale), a decent wine list, and a bunch of sexy cocktails.  At the bar sitting next to me was this adorable gay couple in their fifties, and one of the guys ordered, \"Two left hands, not to be confused with two left feet!\" in a way that was so adorable, but only because a gay man in his fifties said it.  Behind me there was a couple on a first date (it sounded like they met on the internet).  They were both really nervous and it was just so darned cute.   The bartender, noticing that I was the only person in the place without a date or a friend, chatted with me a bit about Japan (my favorite topic of conversation).  That was a cute touch too.  Have I mentioned that this place is just terminally cute?  I ordered the lamb sandwich, which is served in a lake of olive oil, as all food should be served.  Virgin oil.  EXTRA virgin olive oil.  Deliciosso.  My one complaint is that the bartender poured his drinks using a jigger.  This has become more and more prevalent in American bars recently, I think.  What happened to bartenders who eyeball their pours?  It's a dying art.  Come on people, this isn't the UK--we're not required to pour drinks using measuring cups.  This isn't some bullshit nanny state where the government tells us how to get drunk, dammit!  U-S-A!  U-S-A!    But I digress.  I am totally going back to Two Sisters Bar and Books on a date.  She'll be hella impressed.", 
    "review_date": "2012-05-22"
  }, 
  "pYWGJdGfo3i2Bcrn-M6N3g": {
    "user_rating": 1.0, 
    "user_location": "Bayswater, London, United Kingdom", 
    "user_name": "Kevin L.", 
    "review_text": "Dropped in for a casual drink on a Saturday afternoon - it didn't look too busy and we found a seat at the end of the bar. Service was a bit slow to start, probably took about 10 minutes to get a couple of drinks... but hey we're keeping it casual here. Anyway, last round was something else. Clearly signalling that we would like another round (empty glasses on bar, that hopeful look of wanting a drink....) really wasn't getting us too far, until my friend decides to be a bit more vocal (not aggressive just attention seeking). Result: one very snotty bar lady who feels we've insulted the entire bar keeping industry. Well, if you didn't want us back, you should have just said so...Anyway, no good being in the service industry if you can't deal with your customers in a polite way. Oh well, plenty of other places to go.", 
    "review_date": "2012-09-17"
  }, 
  "dym7k3h_wqBiJcXVu6WKuw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ramon S.", 
    "review_text": "This is a great, intimate, dark, little corner to meet up for drinks in Hayes Valley. One of my go to bars in the neighborhood for entertaining people after the sun goes down. Just beware, it's really small and you might have to wait a while to get a seat.", 
    "review_date": "2012-12-17"
  }, 
  "FysDiqCS1fxxwC9PLHNqNg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victoria E.", 
    "review_text": "An hour before show time. Tired of nearly almost all of the Hayes Valley restaurants, as I've eaten my way through it, very much like the Mission or the Financial District or the SoMa. Tried very hard to think what else and it dawned on me that I've read somewhere that this place could be good. Once I came here with colleagues and we couldn't get in because it was too busy.   Secured two counter seats. Score! One of us went to order: charcuterie for me, naturally, and pickle jar, also very me. My companion got a pulled pork dish and a cocktail. I stick to my water.  We caught up on things as I just landed. We talked about the rising food scene else where and our beloved New York has not changed at all. Though to our surprise, Daniel lost it's 3 star Michelin rating.   The wall paper is very chinoiserie. I loved the design. Old 1920s music was playing. Very moody and intimate. It's laid back and unpretentious. It's a bit of a book reader's dream. A drink, a small table, something light to eat, and then just read.  I had been on the go for a long time. Returning back to the new season of City Arts and Lectures down the street just seemed perfect when we got to eat here first.   Adding now to my-\"Oh I'm in Hayes and I should go to Chez Maman / Rich Table / Plaj / Suppenkuche / Monsieur Benjamin this time\", is Two Sisters.  Way better than Grove down the street near the Nourse. So worth the walk on heels.", 
    "review_date": "2014-10-02"
  }, 
  "SsC1ClEoE6l81R0jeYkKUg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Sebastian F.", 
    "review_text": "Awesome places: intimate and cozy. I've been a here for a drink and will go back soon to try there food. Super friendly staff and great drinks. Could become one of my new favorite places in Hayes Valley!", 
    "review_date": "2014-12-01"
  }, 
  "x6Ovhm9vHlFI_WYXttaBww": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E L.", 
    "review_text": "Simple.  Nice crowd.  Good place for a pint or glass of wine.", 
    "review_date": "2012-02-04"
  }, 
  "MbEV-LcSKSGcIevJJXw1zg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Oliver Z.", 
    "review_text": "Good drinks and reasonable(for SF) prices with a long wait. We stopped by early on a Saturday night (~9PM). Although this may be expected, but be prepared to wait 20~30 minutes for your chance to place a drink order, the bar is very narrow and was staffed by only one bartender the night we went. The cocktails are very labor intensive, and take a long time to make, which lead them to take awhile, but it leaves a long impatient line of people cramped along the seating area. If I had time to come even earlier in the night before anyone shows up, I may have to revise my view, but for now, the wait prohibits full enjoyment of the time you spend here.", 
    "review_date": "2014-03-01"
  }, 
  "ToCWp-ytDHANEb43HNy8mg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Moira D.", 
    "review_text": "Delightful spot for excellent cocktails, served by nice, friendly folks.  Downsides are minor - it's a smallish bar so this is more of a place for a pair of friends to catch up.  Parties larger than that and... well, it's a bit cramped.  If you're beer-centric, you'd do better at Place Pigalle across the street but if it's an excellent cocktail made with love, this is your place.", 
    "review_date": "2013-10-04"
  }, 
  "5qgJTus1l35A6bqW2fFk0w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raina D.", 
    "review_text": "This place is a hidden GEM! We wandered in one night on a whim and the bartender saw us and immediately waved a menu over to us. I was so pleasantly surprised that he noticed us right away and was even more pleasantly surprised at the extennnnsive menu, cocktail list and wine list that they had.  I was NOT expecting that at all.  We ordered a half-carafe of wine and took a seat by the front window.  The server came over ~15 minutes before they were closing the kitchen and made sure to check with us that we did not want to place an order before it was closed. Even though we weren't ordering food, it was SO nice to receive that sort of attention and consideration.  I wish I still lived closer because this would 100% become my go-to bar.    Tip-it is a very small place, so a large group is probably not ideal and during peak times it may be a bit crowded-but like everywhere in San Francisco, you make it work for you. LOVE IT!", 
    "review_date": "2014-05-15"
  }, 
  "ICN0ImMK55xlP3R4xMZcgw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "slow c.", 
    "review_text": "love this place. . . . but don't go there because one of these parts about it is the mellow small crowd.  Loud people go nextstore to the place with tvs.   The bartender is amazing. . . . he always seems to be in a good mood and makes me really happy to be there and to drink his fine mixtures.   my only issue - will someone please shut the front door and fix the thing that makes it keep opening?", 
    "review_date": "2013-08-17"
  }, 
  "Pv4i7H7gk9atcDoO34Jj_w": {
    "user_rating": 5.0, 
    "user_location": "Paris, France", 
    "user_name": "Lisa P.", 
    "review_text": "Hooray! Liquor license!  I love Two Sisters. This is going to be my local haunt, if it doesn't qualify as that already. I've received absolutely exceptional service from the lovely woman with the short hair on multiple occasions (I really need to get her name next time) and even the staff in the back of house will give you a friendly hello when you wind back there to hit up the ATM. The food is also delicious but for the most part I've partaken in their carafes of wine and cheese plates, that is before the good news came through that they're stocking booze now too. Last night was the first night that they had the license, I was told, and the aforementioned bartender and a tall bearded gentleman were handcrafting some enormously delicious cocktails complete with burnt orange rind rubbed rims and swirly spoon stirrers and all that good stuff.   It's so great to see that Two Sisters really put thought into what their establishment was going to be. They're not slinging vodka sodas from the well (though I'm sure they would if you asked), rather they're going a thoughtful and upscale route with cocktails that already rival Orbit Room's. I highly recommend the Two Sisters cocktail but it's not for amateurs!  It's definitely on my list for brunch next. Two Sisters is a welcome addition to Hayes Valley, hope they stay a while!", 
    "review_date": "2012-01-14"
  }, 
  "ra3OzaxpILytSjHRRKoT8g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laurel B.", 
    "review_text": "The word \"books\" makes everything much better.  I thought the small plates were nicely done, and the atmosphere was intimate.  The happy hour specials (food, drink) make for a fun outing.  It is a holiday escape in one's own city.", 
    "review_date": "2012-10-12"
  }, 
  "TYoxQecUV8FsS9VjmoZ14Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "A.J. T.", 
    "review_text": "Shhh! This is our secret spot.  Two Sisters is one of the best new bars in the city. Every time I visit this place I have higher expectations, and every time I leave I'm super-impressed.   This is a small neighborhood joint, but I expect it to become a destination spot soon. Its owner operated, by a wonderful group of people. They make great conversation, and you really feel welcome here.   The cocktails are very creative. Their use of bitters, vermouth, and liquor is off the charts. I've never had a bad drink here, and I've been very impressed with some of them. I love the food. The thing is that they don't try to do too much. They have a limited kitchen and they use it to make stuff that works great with what they're trying to do at the place. You don't really need to go here for a big dinner. Its a place to grab a drink and a snack.  The only knock I'd give this place is that its a little small. It works great for a neighborhood spot, but I can see it starting to get a little crowded during peak hours. I suppose I also don't like that they close pretty early. I wish they'd offer a late-night Happy Hour to drag us back in.    I hated the old Marinos restaurant that used to be here, and think this is a much better use of the space. I'll be back again and again. You should come visit too. Just don't tell anyone. Its our secret.", 
    "review_date": "2012-02-21"
  }, 
  "itUsdiDxJOdhViplJNwF6w": {
    "user_rating": 5.0, 
    "user_location": "Torrance, CA", 
    "user_name": "Elise N.", 
    "review_text": "The \"Turn of the Screw,\" which includes tabasco, is delightfully tart and sweet at first then leaves a lingering burning trail in your throat - in a nice way.The ambience is cozy and intimate, though can get crowded and loud easily. The restroom is located in the back behind a heavy curtain.", 
    "review_date": "2012-12-30"
  }, 
  "PXEzQzh_LPasirXCesaCsQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robert P.", 
    "review_text": "Really good cocktails, in a quaint Charming room. Service was great, and the cocktails well balanced, and imaginative.  All around a wonderful low key spot for a drink, and a perfect date spot.", 
    "review_date": "2012-07-11"
  }, 
  "LejL9OOZ3pcWD8cg2Y5RjQ": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Stephanie L.", 
    "review_text": "I giggled a little bit when my sister asked me to go to Two Sisters Bar.. you know, us being two sisters and all, and not including our third and younger sister who was also in the chat.  What we ordered: Savory pumpkin bread pudding w/ two poached eggs $15 It tasted a lot better than when I expected, I would recommend this! The bread pudding was the perfectly moist and flavored.  Chamomile old fashioned $10 My sister likes old fashions and she enjoyed this beverage. I, still, am not a fan of this particular drink.  Weekend happy hour is from 1-4pm. $3 draft beer $5 house wine and $5 for cocktail of the week.  Menu is pretty cool, explains the two sisters history of how this bar came about. Order at the bar. This is a good place to go to if you're going there with one other person. There's about 25 seats inside, good luck finding a seat during prime time!", 
    "review_date": "2014-11-24"
  }, 
  "TzD4IkLN2MWb3hA7gO2GOQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cindi C.", 
    "review_text": "Great place for laid back Sunday afternoon drinks.  Great food, service and drinks. Love that it's in my hood.", 
    "review_date": "2013-04-11"
  }, 
  "c65gXSyZlP0kCqttoTpHNw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SL N.", 
    "review_text": "This could very well be my favorite new spot. It's everything I like in a wine bar/cafe. You truly have the feeling that you are sitting in a Parisian cafe, hidden away in a small alley somewhere.  It has reasonably priced wines. It has food. It has books. It has style. What more can you ask for in a neighborhood wine bar?", 
    "review_date": "2011-11-21"
  }, 
  "exygIMUwWiMg8HU4L_lNIw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jordan C.", 
    "review_text": "Met a friend here on a Thursday. It was pleasantly busy but not slammed and I was able to secure two bar seats. The service was friendly, the atmosphere dark and they were playing really good music. I enjoyed my time there and will return to try the food.", 
    "review_date": "2014-11-07"
  }, 
  "l-zgWG-brcQ4iRev-pfrsg": {
    "user_rating": 5.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Peg S.", 
    "review_text": "Match made in heaven:  Comestibles:  divinely creamy and charming deviled eggs topped with capers + house chips with addicting sour cream and carmelized onion dip.  Paired together:  Libations:  A dark knight + a chamomile old fashioned.  (This review dedicated to my husband:  Happy Anniversary!)", 
    "review_date": "2014-07-28"
  }, 
  "OnhM-m4MHhgWGiBWd9apYg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nobody M.", 
    "review_text": "When you've had too much whiskey (or started the night with Sauzeracs at Absinthe), and need to calm your palate, here's my recommendation: Dark Matter + Low Gap Libre (substituting the vanilla and clove infused rum from the DM with the cola and lime of the Libre). Be prepared for some attitude from the bartender, who offendedly exclaimed, \"if it's not good, I'm holding you accountable.\"  Errr, doesn't take a mixologist to figure out that cloves, rum, vanilla, cola and lime would be pretty fucking good when swirled around on the tongue. And there's no reason to get all lawyerly over ten bucks. If no one combined ingredients in new or inventive ways, we'd all be drinking alcohol made from fermented bee larvae and saliva.   Once made, it was definitely the best drink of the night, which explains why it might have been a problem. Sorry to one up ya, but not all customers with requests are morons. Oh yes, and sometimes you have no idea who the people you're serving are or what they may or may not be capable of, so relax.", 
    "review_date": "2013-06-14"
  }, 
  "gji92ao5NAIrb3akKyqTZQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elizabeth T.", 
    "review_text": "I'm impressed. Fantastic cocktails, the menu is changing in February so I need to get my booty back in there soon to assure that I am able to try every concoction. I had the Chamomile Old Fashioned to start, the Bourbon and honey were delicious, the finish was long, sweet and perfect. My husband had the Slowest Buffalo, which I didn't love (I think it was the molasses + lime) but would likely enjoy w/ a stew or maybe a slice of cheesecake. My next and final drink , Harvest Manhatten....yum!! Go and get it now. If you like pumpkin pie you will absolutely love this. It was seriously a mouthful of pie heaven. Can't wait to try out more and grab a bite too.", 
    "review_date": "2013-12-22"
  }, 
  "D-p_7WVdlyGUE3XFsTt8YQ": {
    "user_rating": 5.0, 
    "user_location": "Philadelphia, PA", 
    "user_name": "Candice H.", 
    "review_text": "Can't wait to go back!  I have tried few other wine bars in SF and nothing comes cleaner and cuter than this.  This is a little tucked away gem in Hayes with comfortable and cute seating at the bar and cocktail tables.  Their menu is fairly limited, but perfect because I'm pretty sure they are all excellent selections!  It also helps me make a faster descision with my indecisiveness.    The bartender new his gig!  I first asked for dessert wine, only had port.  He recommended the Zin per my taste buds at the moment, and he knew that was the one I would like.  Indeed he was correct!  Haven't been more satisfied on the first glass of wine that easily, even in nicer restuarants.  Specialty cocktail drinks seemed great too.  I can't wait to try some of their cheeses and food items.  Limited, but a really nice all around selection.    Plus - service (*****)  I stepped up to use the bathroom, the bartender opened the curtain for me to go through.  You don't find that at many places nowadays!  The bartender then walked around to every single table nicely stating a last call for a hard stop.  More people should do that, especially since all of the restaurants in SF are fairly small!     Can't wait to go back for some more wine and cheese.  Can't wait.  I'm just bummed it took me so long to try this place out, especially since I live 2 blocks away!", 
    "review_date": "2012-04-30"
  }, 
  "5DLLn0HL0KgXhmzQKO-7Dw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer B.", 
    "review_text": "Go here for the mellow vibe and old-world charm, as well as the lovely staff. What an awesome place. I went there for their opening and loved my cocktails, the Goat Road NYC and Port of SF. I would go there to drink/read, have an intimate meeting with a friend, and (once they're serving) have brunch there!", 
    "review_date": "2011-10-17"
  }, 
  "4W1D-dUW7bC_CJYgslzUqA": {
    "user_rating": 4.0, 
    "user_location": "Ann Arbor, MI", 
    "user_name": "Guillermo K.", 
    "review_text": "The deviled eggs are yummy, and the beer is well priced.", 
    "review_date": "2012-02-26"
  }, 
  "BdcNkjxcse8y48YISk6low": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael D.", 
    "review_text": "Two Sisters Bar &amp; Books is the business.  Its got low-lit, hole-in-the-wall, pseudo-library charm, and it's the perfect place for a date night.  Their seasonally inspired cocktails are a welcome alternative to pricey wine bars--rustic, full of flavor, and a great way to \"spend the night together\" with someone special.", 
    "review_date": "2013-04-11"
  }, 
  "MDmNN2laCuXHrfc04COMCQ": {
    "user_rating": 4.0, 
    "user_location": "San Lorenzo, CA", 
    "user_name": "Charlene P.", 
    "review_text": "Finally got to try this place last Saturday night. I had passed by it numerous times and read about it as well. I thought that the idea of books in a bar was intriguing. I am a fan of both. When we walked in, it wasn't very full at all. We had arrived just at the right time. I looked at the menu and tried the Smitty first - gin, aperol, grapefruit, housemade grenadine. Very tasty. As I was finishing my first drink, more and more people came in. The second drink I had was the Bee's Knee's. I don't remember exactly what was in it, but it was quite good too. While we were here, Soul II Soul came on! I hadn't heard that song in forever. I feel like I could stay here a while.", 
    "review_date": "2014-01-20"
  }, 
  "TSdV_lsddT4F3TJvmdmXag": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennie K.", 
    "review_text": "Everything I said in my previous review, but now with 100% more thanks for being so accommodating to the Forever Young Adult book club!  We were just saying that it would be a sad day if we outgrew Two Sisters.    The deviled eggs with capers and truffle oil are a group favorite, but the cheese plates (usually with a jam or marmalade, roasted garlic, nuts, and bread) are excellent, too.  I've tried a good selection of cocktails now, which are always flavorful, strong, and drool-worthy.  The beers on tap rotate, and the house wines never disappoint.  Why don't I live closer?", 
    "review_date": "2012-06-17"
  }, 
  "FSDj4JOrZxd5Z-ax15Klgg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Reyz A.", 
    "review_text": "It's a small, narrow and dark place to have a cocktail. I like it. I just don't get it. Supposedly Two Sister and Books started between Krakow and Warsaw on a train inspired by an English language book store. I get the cocktails and food part, but I doubt I could read my iPod here let alone a book...hell, I came here to imbibe and not read Cervantes.   Try their two sisters Cobb salad of petite romaine hearts, some eggs, tomato, guac and some chicken. There's also some braised pork meatballs (with , yum, caramelized onions) for about 11 bucks.  There also some some charcuterie and fromage...and dare I say it, BREAD PUDDING!!! Yeah, I found another place that has bread pudding...weeep all you Bread Pudding haters you!!!! Sorry, I love the stuff.  What I really came here for, after umpappa music at nearby Biergarten, was some brut cava, vino blanc from espana. Then again, there's albarino, hendry 2010 from Napa...no, but wait, there's some sauvignon blanc portalupi 2010...je suis desolee, mais prefere vin espanol,  pero en este momento yo habia bebiando Belgian Blonde...OK not, the big French speaking hoochie mama from Belgique, but a tall beer Tiburon blonde, draft from Marin Brewing.  What the hell, I'm in the city. I'll drink them all, crash at my friend's place and drive back to Man Hozer er San Hoe when I'm good 'n sober.  (Oh yeah, there also house red...garnach, lechuza 2010, un vino de espana, muy sabroso).", 
    "review_date": "2012-09-18"
  }, 
  "9p4ADjrTJ5COqdLZvutTuw": {
    "user_rating": 5.0, 
    "user_location": "Fresno, CA", 
    "user_name": "Dan V.", 
    "review_text": "This place has a cool vibe going on, a nice place to sit and chill and talk over drinks.  I waited 5 seconds to order my drink which was amazing.  I'll come back here for sure", 
    "review_date": "2014-01-25"
  }, 
  "91K7itpdtx2g4dtShoHi2g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ramya G.", 
    "review_text": "Perfect little spot to catch up with old friends or make new ones. The wine list is great. The rose even better. I didn't get to try the food but it smelled amazing and was perfectly portioned for a happy hr snack-a-roo.", 
    "review_date": "2013-06-18"
  }, 
  "Psfb6E5bJroE94DGHgpRmQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Michael B.", 
    "review_text": "Really nice little bar for a relaxing drink/afternoon bite.  The food was simple but quite good as was the beer.", 
    "review_date": "2012-09-15"
  }, 
  "t4o8mWvFo5Q7vwT94h1zaw": {
    "user_rating": 2.0, 
    "user_location": "Victoria, Canada", 
    "user_name": "J T.", 
    "review_text": "This is cute for a neighborhood place, but it's nothing to write home about.  The drinks are good.  The space is small.  The food is \"meh\" and overpriced.  Don't sit by the door. The heavy door doesn't have a self-closing mechanism, and customers (unintentionally) walk in without shutting it properly. It didn't seem like a huge deal until I realized I was spending more time watching the door and making sure the cold air didn't blow through than actually talking to my friend.  Verdict: there are some other small, cute places in Hayes Valley I'd rather go to.", 
    "review_date": "2014-02-27"
  }, 
  "6eLdCBGGUNWUOzQBwbfhPg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt W.", 
    "review_text": "So i have to agree with the ambiance comments.  Its a good place for drinks.  I will say 5 stars on that.  For the food its only gets a 2 though unfortunately.  We had both the \"sea\" fish of the day dish with ratatouille and the \"land\"pulled pork.  Pulled pork had a nice spice to it but was otherwise \"just ok\" in our experience.  The fish was very good, but the bell peppers they used in the side dish where un-edible.  No really...the skin of the pepper was like plastic.  I saw several other diner's plates with the red skin left behind as well, so you think they would have got the hint on that one.  Maybe a one time batch understandably.  But also, the portions are very small in my opinion.  Be aware for you hungry people.  I joked with my friend after we finished our food and drinks, \"so where should we eat for dinner?\"  Overall i would return for drinks, but pass on the dinner option.  A-ok, rating for me.", 
    "review_date": "2014-10-10"
  }, 
  "e8IgW8sy1tTe503JsnpWiA": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Kobe L.", 
    "review_text": "After seeing lots of good reviews on yelp, my girlfriend asked me to take her there for an afternoon of reading and sipping some delicious cocktails. However, we decided to leave within 5 minutes for reasons I'll go into in a bit, and therefore my rating is solely judging on its decor and our experience.  Staffs: 3-4 stars since the bartender was reasonably nice. Decor: 1-2 stars mainly because the website and other yelp pictures portray this place as a mixture of a hipster bookstore and a classy bar. The venue turns out to be a tiny bar too dimmed to read anything and with a only handful of tables. The single book shelf there was small and purely for decorative purpose only. A major letdown for my gf and me.", 
    "review_date": "2012-05-27"
  }, 
  "ma3r4D8KZ0Ksjpv-sU0QJw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie G.", 
    "review_text": "Cute and cozy bar in Hayes Valley. Wasn't that much seating on Friday night, but we luckily got 3 seats at the bar. They have interesting cocktails on their menu largely displayed behind the bar, which are $10 each. Not bad; they are pretty strong. I wish they had more cocktails with clear liquor though; almost all of them were made with either bourbon or whiskey. The bartender was super nice and it was cool being at the bar watching him make the drinks. We also ordered the mushroom pate, one of the salamis, and goat gouda, which came with honey-covered almonds and bread. They weren't amazing, but they were good. If I come back, I'll try the deviled eggs. This wouldn't be a regular spot for me, but I enjoyed my visit here and wouldn't mind coming back for a drink if I'm in the area.", 
    "review_date": "2013-06-10"
  }, 
  "MgAgvJwlt8ujtE4Pr0r9uQ": {
    "user_rating": 4.0, 
    "user_location": "Paris, France", 
    "user_name": "Cat N.", 
    "review_text": "This place is adorable, and basically all I ever want in life: alcohol, food, coffee, and books. It's a shame that it's so small, and confusing to order and get food. There was only one person working in the kitchen, and one person behind the bar, so service was slow. It's also inconveniently cash only. I wish that there were more creative vegetarian entree options, but I was impressed they had house-made pickles, walnut pate, and a variety of other unusual charcuterie/cheese plate items. I forget the drink I had, but the majority of them seem to be gin-based, and sounded great.", 
    "review_date": "2012-08-06"
  }, 
  "Z88N6qly3Dp5C06XbZ9IMQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice C.", 
    "review_text": "This cozy nook in Hayes Valley is perfect for catch up with close friends or a sweet date with your lover.   Cocktails are tasty, not burningly stiff, but a good value for money. Their chamomile old fashioned is a standout and always check the happy hour specials on the board.  It can be a tight s-q-u-e-e-z-e when the place gets packed because of the narrow set-up. So spring for that bar stool when it opens up!  Have a sip of your cocktail and if you feel so inclined, turn the page of one of their books. To Kill A Mockingbird, anyone?", 
    "review_date": "2014-07-08"
  }, 
  "yYoRMIukgJb7-BQtXYqBuw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ryan W.", 
    "review_text": "After hearing some positive reviews, I took a date to this place a few years ago, shortly after it opened. (I recently returned, and was prompted to recall and write about this place.) I expected something vaguely 1920's Paris, given the literary implications in the title, and I wasn't disappointed. It's a great little spot with a nice atmosphere in which to while away a languid afternoon getting soused, and it's cozy enough for intimate conversations with one or two friends (don't bring a party). The bartender was friendly but almost aggressively helpful, and he was certainly hipsterrific, novelty mustache and all.   The books are more for show than for reading, which was a disappointment, but the thing that got me about this place, and the reason I can't give it more than three stars despite the cozy atmosphere and friendly service, was the wallpaper. I'm surprised no one has mentioned it. It's racist, depicting the pastoral stereotypes into which certain Westerners like to place Asians, such as women wearing conical hats near an elderly man practicing acupuncture underneath a sign that reads \"Chow Mein\". Quaint, right?Wrong. It's offensive. What this wallpaper has to do with sisterhood and the love of literature and alcohol I'll never know. It has more to do with ignorant whites exploiting a stereotype in an effort to create an aesthetic that will encourage you to spend your money.", 
    "review_date": "2014-09-29"
  }, 
  "eIa4QJXp5ZNmuFORnuPvDA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ziyan C.", 
    "review_text": "REALLY cute spot. Tiny, tiny. Bookshelves all around. Antique-looking wallpaper. I felt like I could live in a walk-up studio like this and have a happy little life writing acoustic guitar songs, reading old memoirs, and eating vegan meals with my cat (although am neither a guitar-player, singer, memoir-reader, vegan, nor cat-owner).   There magically always seems to be enough space for everyone, as tiny as this bar is. After standing on the side for a bit, we sat ourselves on the bay window (equipped with pillows, books, and even a curtain), and found the table next to us empty within 10 minutes. We quickly moved over to secure our new spot.   All the drinks sounded delicious. Seriously. I couldn't choose. Between my friends and I, we ended up trying a few and were overall let down, besides the first drink below.  * back 40 - 5 stars (tennessee whiskey, lemon, lime, maple, bitters) Amazing! Delicious, refreshing, citrus-y and tart with a hint of sweet. We all loved this.  * harvest manhattan - 2.5 stars (rye, pumpkin liqueur, vermouth, bitters) I love autumn flavors and once had this amazing pumpkin cocktail that basically tasted like pumpkin-flavored eggnog. However, this was much more heavy on the liquors and was not a thick nor sweet drink. I definitely did not taste the pumpkin as much as I would have liked, and just found this drink to be way too strong.  * the dark knight - 3.5 stars (gin, cherry/balsamc vermouth, campari, sperol) I thought this was not bad - this had kind of a black lickerish flavor, but both my buddies absolutely hated it.  Full drinks menu: <a href=\"http://www.yelp.com/biz_photos/two-sisters-bar-and-books-san-francisco?select=IlvkYYMg9QtDgEf61NNBcg#IlvkYYMg9QtDgEf61NNBcg\">yelp.com/biz_photos/two-…</a>", 
    "review_date": "2012-10-23"
  }, 
  "U13tLFucJNz1fNv_Xgdj0g": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Mel G.", 
    "review_text": "Shh. Best lil bar in SF. Really good dainty stiff drinks, e.g. chamomile infused bourbon, honey, and bitters. Has an old-time feel to it. Great place.", 
    "review_date": "2013-04-08"
  }, 
  "YG5EroFMYByZODecz3U_kQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany W.", 
    "review_text": "Didn't expect to love this bar so much, but I did.  It's one of the cutest bars I've ever seen. Its bookish crowd, candlelight ambiance and vintage wallpaper are charming. And there are small, inviting nooks for settling into with a book (or a date).  I stopped by here with a couple friends when Patxi's told us we had a 45-minute wait for a table. The cocktails at $10 aren't cheap, but they're made with care and precision. I had the Chamomile Old-Fashioned -- such an interesting spin on the typical Old-Fashioned, with a pleasant herbal aftertaste. My friend ordered the Two Sisters, which was a bit sweet/syrupy for my taste. He enjoyed it though.  I was also eying the food menu -- they have a grilled cheese sandwich on there that I know I'll be back for.", 
    "review_date": "2013-12-31"
  }, 
  "jspO-3tsTB0aP1YXzXDdJw": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Tiffany H.", 
    "review_text": "If you like bourbon and your Old Fashioned's like I do, I HIGHLY recommend...no, actually, I'd require that you take a trip down to Two Sisters Bar and Books solely for their Chamomile Old Fashioned. It is the only place I know in SF that makes this drink and you'd think it might be sweet/the chamomile might be too overwhelming, but NO! It's like freaking Fourth of July for your tastebuds. I swear, you will love me after you've had it, and going back to your traditional Old Fashioned drink will not be an easy transition. The other cocktails here are also pretty good, too. But that Chamomile, though!  I've been here on quite a few occasions and know that this place can get crowded and busy -- however, finding a place to sit/stand is never impossible (which is great!). Great date spot and super cozy, intimate  atmosphere! You can get bites to eat here as well, but I've personally never gotten anything, but will try it next time around. Parking around the Hayes Valley can be somewhat challenging, but just look on Gough Street and you'll be sure to find something.", 
    "review_date": "2014-04-07"
  }, 
  "e12hl2RuJik8Ww94TxCaXA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jim T.", 
    "review_text": "A cash only wine bar? Seriously? With 3 reds and 3 whites to choose from? Limited selection, as expensive as any other wine bar, and inconsiderate/cheap owners who won't do credit cards. Fail. There's so many great wine bars in the city, many with similar prices, there's no need to go here. Didn't really care for the dark, hole in the wall ambiance either. Admittedly, two stars is a little harsh, but the limited selection really knocks them below average.", 
    "review_date": "2012-05-03"
  }, 
  "4Qq0NK-Ytp47_aOEdcTQCw": {
    "user_rating": 2.0, 
    "user_location": "Jersey City, NJ", 
    "user_name": "Daniel R.", 
    "review_text": "Little table on the sidewalk was nice. Service was very friendly. Bar is very charming. The the cocktails are pretty bad though. I ordered a gin sour and they used lemon juice from concentrate and too much sugar syrup, I sent two back ordered beer instead. Nice location!", 
    "review_date": "2014-05-13"
  }, 
  "SErz3Fh7x2TWiww47LmERQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tricia K.", 
    "review_text": "I absolutely love this place. The happy hour specials are a great value, the cocktails and food are terrific, and the staff is so friendly. A wonderful place to have brunch with friends or to savor a book over a cocktail and house-made potato chips during happy hour.", 
    "review_date": "2013-04-02"
  }, 
  "r_R8byPN0yRZG44M-sDD7g": {
    "user_rating": 4.0, 
    "user_location": "Redondo Beach, CA", 
    "user_name": "K T.", 
    "review_text": "Food: grilled cheese with tomato soup  Grilled cheese was okay. A little salty, and the bread was hard to chew. The tomato soup that came with the grilled cheese was okay, too. Tasted watered down.  Basically, I wouldn't come here for the food. Come for the atmosphere and the drinks. I had a couple of drinks here, one of my faves is the smitty. It's a tiny place so it's not good for big groups.", 
    "review_date": "2013-12-08"
  }, 
  "fitXjNnwVB_HzqaBSrIGXQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victor W.", 
    "review_text": "Cool setting, great drinks, and cheap (For SF) prices. Their old fashion is done expertly. The chips and deviled eggs are also fantastic.", 
    "review_date": "2013-07-15"
  }, 
  "sRVGewx--HgwwlKwAfCO9Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Liz S.", 
    "review_text": "I stumbled upon the quaint Two Sisters Bar while shopping in Hayes Valley with my cousin, and walked in to check it out.  They were not open yet, but the chef was oven-roasting some tomatoes and gave us the lowdown on the place.  Looking around and the book-filled shelves, patterned wallpaper, and old-world atmosphere, I knew I would be back.  I came back a month later with some girlfriends for a chill girls-evening-out.  The place seems even more tiny when filled with people, and we were worried about not getting a seat all night.  Soon, however, a couple of tables opened up and we settled in for what turned out to be a delightful experience.  The old-world feeling definitely prevails.  It's a wine and beer establishment, so don't go expecting hard alcohol.  They do have some delicious cocktails, so if you want a mixed drink, you will find something to wet your whistle.  But what really stands out is the food.  From delectable deviled eggs to chicken meatballs to perfectly cooked salmon - all under $10 and just enough to share and have a good sized taste of each.    We stayed for several hours and enjoyed every minute.  The staff could not have been nicer and we left feeling like old friends.  It's the kind of place where time seems to stop, and you are suddenly transported to a far-away land where good food, good drink, and good conversation are the priorities of the day.    Don't forget the \"and Books\" part too - they have many great titles in house, and you can bring one of your old books to exchange.   Eat, drink, read, and be merry!", 
    "review_date": "2011-12-28"
  }, 
  "dXdXagdSU6od-w6TjBFKbg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bri R.", 
    "review_text": "This is my new favorite place to relax and have a glass of wine. It really is the cutest wine bar I have ever seen and the owners are just sweet as pie. Their house red is fantastic and my go to after a long Yoga session next door.   Haven't tried their bites but next time I will because I hear they are wonderful. Only downside is it is very small so seating is limited. Ideal time would be 5pm, nice and quiet.", 
    "review_date": "2011-12-08"
  }, 
  "rm0tLspD8g9lmPglpRUQ3A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "SF I.", 
    "review_text": "Great drinks. Food sucks and is overpriced. Always busy Thursday-Sunday. Only a block from my apartment. How can I complain.", 
    "review_date": "2014-02-17"
  }, 
  "44QJFy-EUL18Z5xcwPP6pQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dilly M.", 
    "review_text": "Really cool little bar on Hayes. Nice comfortable setting, good selections of beer, wine, and cocktails.  Happy hour till 6pm.", 
    "review_date": "2013-01-24"
  }, 
  "4aOupTk-DN2FbvTyHzLltw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adriana F.", 
    "review_text": "read about this place in the Chronicle and was so happy to stumble in after leaving Hardly Strictly Bluegrass.  My sister and I (two sisters at two sisters!) waited by the library/bar until a table opened up since this rather narrow venue really fills up in the evenings.  Love the ambiance...low lighting, cozy quarters, and books that smell and feel like the real thing.  The cocktails were top-notch: I ordered the rye &amp; pumpkin flavored \"Harvest Manhattan\" and my sis the cucumber-infused rum \"the sun never sets\" ...fiestas on the palate for sure!  Who needs Bourbon&amp;Branch when you have this lovely nook in Hayes Valley?", 
    "review_date": "2012-10-08"
  }, 
  "DMwp6ZDmshHRPeQVrYGoqQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy B.", 
    "review_text": "I've been here a couple times now and am not quite as impressed as my fellow yelpers. Two Sisters is definitely a cute place, but it's not designed well, in my opinion. It's long and dark and a bit claustrophobic. The drinks are unique and priced well, and the food is decent, although a bit overpriced. I was excited at first, thinking this would be a great, cozy place to hang out, have a drink, read, people watch. But it's not really any of the above. It's certainly not a bad place to try, but don't buy into the hype.", 
    "review_date": "2013-09-05"
  }, 
  "UcO4fiAVS44XRr9Lzmz34Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel K.", 
    "review_text": "The atmosphere was busy but not overwhelming and the bartenders were great! They didn't ignore anyone at or near the bar. When I tried a seasonal martini and didn't love it, she took my unfinished drink and replaced it with a new one of my choice. I will certainly go back!", 
    "review_date": "2012-12-09"
  }, 
  "GkGRnqa9NUZK-913K3WIvw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "becca w.", 
    "review_text": "Very cute little spot to catch up with girlfriends or sit out in the sun when that is available. The seats are always out there, just SF sun doesn't always cooperate.  They have a great happy hour till 6p. Cocktails are very good and the winelist is decent. I haven't tried the food, so I don't know, but looks decent for wine pairing etc...  It is small neighborhood spot so I wouldn't bring a large party here. But if you are looking to get a glass of wine or beer by yourself just because it's sunny and you can, this is a great spot to do it. Or bring a few girlfriends for happy hour  tete a tete.   It is also a romantic spot for those who are looking for quiet little ambiance date spots.", 
    "review_date": "2014-03-17"
  }, 
  "AxJNQAe5DVEIcSdOSOo3Yg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jo S.", 
    "review_text": "Absolutely wonderful.  I enjoyed their deviled eggs and fresh-squeezed oj while reading poetry from one of the books next to the bar and jotting down a few words of my own.  Can't wait to go back!", 
    "review_date": "2011-10-30"
  }, 
  "TEtzbpgA2BFBrC0y0sCbfw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keane L.", 
    "review_text": "Wallpaper with old Chinese decor cover one end of the bar while a row of books settle against the other. I can only hope that, while I imbibe, osmosis occurs between myself and said books in that I might leave feeling a little more knowledgeable.   Two Sisters Bar and Books exemplifies everything I want my life to be: a little bohemian and plenty refined. The focus is on wine, beer and food, and everything is offered with a smile at affordable prices.   Have you ever seen a cocktail made with Madeira and IPA? I watched the \"Port of SF\" in action, a unique cocktail topped off by Bear Republic Rebellion. The other cocktails looked no less interesting and I can't wait to come back and try a few.  Two weeks new at the time of this review, they'll be serving up weekend brunch in another few weeks. Take this time to visit this place for a casual drink while the space is nicely free.   There's my \"knowledgeable\" tip to you, also evidence that intra-bar osmosis is real. Take, THAT, science.", 
    "review_date": "2011-10-24"
  }, 
  "ZnUM2QzC3egyge0D818-Vw": {
    "user_rating": 2.0, 
    "user_location": "Fairfax, VA", 
    "user_name": "Holly H.", 
    "review_text": "I wasn't happy with this place at all. We stopped in to grab a quick drink. The drink was OK. The service was bizarre. They didn't talk to us. Just handed us a menu and looked at us like we didn't belong. It's super small and sitting at the bar is painful on the knees. The salt and pepper chips were good however. The moment we finished our drink we left. I did not feel comfortable there at all.", 
    "review_date": "2014-04-06"
  }, 
  "4pGtYsATyWiA6lRxmmLYdA": {
    "user_rating": 5.0, 
    "user_location": "Pleasanton, CA", 
    "user_name": "Nastaran A.", 
    "review_text": "We have been here a few times and it has been exactly what we've wanted: cozy, warm, modern, tasty, and the food was great too. It was so nice that we didn't want to give up our table and we ended up staying longer than we should have. We love  it and will definitely be back :)", 
    "review_date": "2014-09-27"
  }, 
  "NEg9ZNGCpgECaJk7Fq5fjg": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Rachel A.", 
    "review_text": "Such a good place with amazing food. Try the cream cheese dip with the homemade chips!", 
    "review_date": "2012-08-13"
  }, 
  "xBGjsbNYyv2TZu_uoXQjpA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Morgan H.", 
    "review_text": "Great music, cool ambiance, and a nice food and drink selection. Would make a great date spot!", 
    "review_date": "2014-12-28"
  }, 
  "CeDwcu6O2fyuR0t9cH6_9A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marc S.", 
    "review_text": "Cute little bar, nice cocktails.", 
    "review_date": "2013-02-27"
  }, 
  "JqHQMojDCOsLWSAtVkIJiQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brian J.", 
    "review_text": "While visiting San Francisco recently, we were looking for a place to get a glass of wine and a small bite to eat. We discovered this hidden gem on Hayes Street. The red wine was delicious and only $5.00/glass. We had a meat and cheese plate that came with roasted garlic and a generous helping of thin sliced french bread. This is a relaxing atmosphere and we never felt rushed even though the place was full. It appeared that this was a place the locals gathered in the evening. The menu is limited, but what we had was very good. I would go back.", 
    "review_date": "2014-05-07"
  }, 
  "iwINZwygog3Oaib3uXnJbQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott W.", 
    "review_text": "I've only been here once and loved it.  It has an interesting and well thought out style and wasn't terribly loud despite being busy.  The music was kept at a reasonable level and they were not trying to crank it up over the crowd noise.  My only complaint is that the fish they serve is rather pungent and stinks up the place every time they make it.", 
    "review_date": "2012-05-23"
  }, 
  "0DnK-KP7MlYOlkT-Ioh9mQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rae B.", 
    "review_text": "Update: I'm upping the stars. (1) Compared with many places I've been in SF, Two Sisters is definitely a spot I will frequent. It has a great vibe, a great location, and great cocktails. (2) My original post also forgot to include the deviled eggs. (3) The staff and management go above-and-beyond to deliver high quality service. Kudos. --- What a great neighborhood brunch spot. If you're looking for an artsy, bohemian vibe with creative cocktails and a bit of food, this is your place.   Small, dim, and cozy, we enjoyed brunch at a table in the front of the bar. My 10 year old daughter found a comfy reading nook in the window seat, and my spouse, mom, and I clustered around the small cafe table.   We tried a variety of the cocktails, and none disappointed. Each offered a luscious nose but delivered surprising, almost shockingly different tastes. Dry on the tongue but fragrant and sweet smelling, we indulged in a few.   I don't think Two Sisters really positions itself for its food; some dishes hit the mark while others missed it. All of the dishes were beautifully portioned -- not too large. Just enough to make you satisfied but not stuffed. I prefer smaller portions, as I subscribe to the clean plate club too often. Two Sisters did the portions just right.   As other reviewers point out, the deviled eggs are fantastic. In fact, we came to Two Sisters after seeing a review in the Chronicle for this dish. A definite must-have.  The tomato soup and grilled cheese sandwich was by far the best dish flavor-wise. The English cheddar was strong, and the sandwich a bit greasy (not surprisingly, given the cheese). However, the sandwich was very good. The bread was firm but thinly sliced, which made eating it actually enjoyable. It didn't tear my mouth apart. The tomato soup with drizzled olive oil was fantastic. I'd order this dish again.   The savory roasted veggie bread pudding was a decent portion for brunch -- not too much, but just enough. Paired with a tart salad, it was creamy if not a little bland. The salad was mostly sprouts, which were a bit clumsy to eat. A more substantial lettuce, especially for the flavor of the dressing, would have worked well.   The seared tuna was OK taste-wise. Again, a perfect portion, but the execution was a little meager. It was overcooked, served with a zingy sauce, and rather unremarkable. However, I applaud the offering.  The delicious cocktails are nicely priced -- $10-$11, far below what other bars charge for similar drinks. In the end, the food is priced fairly.   For a funky, relaxed bar-cafe, Two Sisters ranks high. I'll definitely go back for the cocktails, and I will give the food another try. Great vibe, great staff, great place.", 
    "review_date": "2014-08-13"
  }, 
  "9NPiCqusdnh8tqW2Can2Zg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "MP M.", 
    "review_text": "Interesting concept.  I'll definitely give it another go.  We were 5 people who happened upon it on a rainy Sunday night.  I was worried that we wouldn't be able to sit, but space became available quickly.  Owners/managers were totally receptive to our needs.  In a city overwhelmed by restaurants, I really appreciated the quaint, small menu, theme, good cocktails of this place.", 
    "review_date": "2012-12-17"
  }, 
  "sbgQVK0ObJtxJ5BZOceHfg": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Priya G.", 
    "review_text": "Super cute place, great for happy hour. Came here on a Tuesday with a friend around 5pm, and the menu is super cheap and awesome. I got two glasses of the house white wine, and she got the peach drink and then a glass of the house white wine too. Everything was about $5 each, great steal.  The atmosphere is really cute too- it's a small and narrow bar. I probably wouldn't come here at night, as it looks like it would get packed. It has dim lighting and there are bookshelves everywhere with actual books. It's super cute and cozy and these are the kinds of places I love about SF!", 
    "review_date": "2013-08-30"
  }, 
  "pI15RINDqpXIk5492xx7PA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel R.", 
    "review_text": "Five stars just for the ridiculously fun bartender who served us.  Drinks here were good, I enjoyed the house wine, a tasty little treat. Atmosphere was great, definitely a nice date spot and not so packed you can't enjoy the other person's company.  I'm really curious to come back and try out the food!", 
    "review_date": "2012-02-11"
  }, 
  "Pc2k8AK0EjvL_qJjs72sgw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susie T.", 
    "review_text": "We have been here 3 times and have loved the atmosphere and food. The ladies behind the counter seem to really have a passion for what they are doing here. Less so for the male bartender. The previous times we visited he has been odd and smug but took our order no less. This last time he was just plain rude, or one could call him enthusiastically sarcastic. While asking a question, in mid conversation walked away for no apparent reason. Then he lingered inches behind me and my table as I was leaving as if to count the cash on the spot. It was all very weird. Wish they would get a themselves a new bartender. So sad because we really do love this place. I wonder if I can find out what night he is not working. I'm hoping it isn't Two Sisters and a Brother.", 
    "review_date": "2012-02-09"
  }, 
  "C469FeAyiATdaNmgXjZYWQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christophe C.", 
    "review_text": "Meh too crowded and difficult to get drinks. Go to brass tacks instead -- similarly crowded but more open air and easier to get a drink.  To get a sense of the space, you could literally clear this space with a shotgun. Elbow to elbow before you get your first drunk.", 
    "review_date": "2014-04-01"
  }, 
  "txWlo8BVyal4iOTUWDcq3A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Morgan B.", 
    "review_text": "This is one of those places where I'm hesitant to write a review because I don't want everyone to start flocking to this neighborhood gem.  But, in the spirit of supporting small businesses that rock here we go...  Two Sisters is awesome.  I don't know what kept me from popping in here the past couple of months, but now that I know how spectacular the food &amp; drink is it may become my new favorite spot.  It doesn't look like much from the outside, and given how dark it is inside you just might walk by and think it's closed.  But the dim lighting is all part of the calming experience, one that could just as easily be happening in a Parisian alley as on a busy street in Hayes Valley.    Come in for a drink - I recommend the Two Sisters - and stay for the nibbles.  The cheese platters come with sliced baguette, a roasted garlic head (delicious), grapefruit jam and honey soaked almonds.  All for just $7.  Get two cheeses and a side of prosciutto and you just about have yourself a meal.  We also tried the Lamb Sandwich which was equally mouth watering - thin, tender slices of lamb with fried onions on a baguette.   They have a decent happy hour 4-6PM, $3 beers, $5 wines and a couple of discounted cocktails.  This is the kind of place where you come expecting to have one drink, and two hours later you're licking your fingers from the good eats and ordering your third cocktail.    It's cozy inside and great for couples but not so good for large groups.  Most seating is at bistro tables, plus maybe 8 additional seats at the bar and a wee bit of standing room.  Highly recommended.  Oh, it's CASH ONLY so make sure you come prepared (though there is an ATM in the back of the restaurant).", 
    "review_date": "2012-04-16"
  }, 
  "6QN6BdpcDKXNS9Xq_7pECQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "E M.", 
    "review_text": "Michael and his dark knight drink is dope! Awesome foodie bar. Rice and BBQ sauce for everyone!", 
    "review_date": "2012-07-05"
  }, 
  "PZqcNCRKu0VeFGp9sxu2HQ": {
    "user_rating": 4.0, 
    "user_location": "Greenwich, CT", 
    "user_name": "Christopher w.", 
    "review_text": "Awesome spot! The place where everyone could know your name; If you frequent the place. Friendly locals, personable and intuitive barkeep, cozy atmosphere. The food was good, but leaves you wondering hat else is out there. Basically traditionally-creative gastropub cuisine. Missing finesse and imagination but solid category staple.   Disclaimer: review based upon first and only visit. Like what they are going for and will support them again. Encourage other to try and review.", 
    "review_date": "2014-10-21"
  }, 
  "Jttbzh-88m_9mly4mNLBlA": {
    "user_rating": 3.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Monica A.", 
    "review_text": "I really really like the ambiance here. And the bartender is super friendly and talks about the drinks he makes, and takes his time to make them. The reason for the three stars is that he made me a drink, and when I told him I did not like it, he didn't offer to make another drink. For the price, he should have done that. But overall cute place and is nice for a date!", 
    "review_date": "2013-06-12"
  }, 
  "eQJtcM6rK0-x2F2UlZaNJg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Corey V.", 
    "review_text": "I was only able to come in for a quick drink made with madeira, ginger beer and pilsner.  Very good, but I swigged it down too fast.  I'll have to come back and check out the bites.  The place has a very nice vibe to it.", 
    "review_date": "2011-11-30"
  }, 
  "tNJ3voAW1HTA5B4eo6o7rA": {
    "user_rating": 3.0, 
    "user_location": "New York, NY", 
    "user_name": "Jasmine S.", 
    "review_text": "Pros: It's as cute as I had expected on the inside. Really intimate and quiet. The bartender was pretty animated and friendly. Gave good wine recommendations.   Cons: The food was extremely disappointing. I've never met a deviled egg I didn't like. Some are better than others for sure, but these were offensive. An overpowering lemon-oil taste, but otherwise not much flavor. Really bad. The lamb sandwich was extremely gamey and even the chips were disappointing. We left the majority of both dishes and walked down the street to find food after we'd finished our wine.  Cash only. I understand. But it sucks.  I recommend for a drink but not for dinner or even nibbles really.", 
    "review_date": "2012-02-24"
  }, 
  "04JttCeiTpGmy-7XJtn2Gw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Justin O.", 
    "review_text": "If you're looking for a cocktail in Hayes Valley, THIS IS THE PLACE TO GO!  2 sisters is definitely a small and quant place, but the atmosphere is fantastic and the drinks are even better.  My favorite is the Chamomile Old Fashioned and any other bourbon drink.  Additionally, the food menu is pretty good, especially for cocktail snacks and other gastro pub type fare.  GO HERE!", 
    "review_date": "2012-09-10"
  }, 
  "BdYPc-MOmkwYjjersFiTIQ": {
    "user_rating": 3.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Zeni B.", 
    "review_text": "This place is quintessential SF, very cozy and intimate with a feeling of uniqueness and quaintness. It is a nice place to relax after a hectic day. The cocktails were delicious.  The reason for 3 stars had to do with 2 things. The food was just ok. I think if i was only there for drinks I would have like the place much more. Lastly, the service was also just ok. They were nice but it took more time than necessary to get attention.", 
    "review_date": "2014-12-07"
  }, 
  "Fzsv_S4bUYcq88R0oX1otA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Miriam H.", 
    "review_text": "Pretty crowded on a Friday after work, but in a cozy way. Good happy hour specials. I had a $5 gimlet, which was delicious! I was expecting more books, but cute nonetheless.", 
    "review_date": "2013-01-27"
  }, 
  "hBO5MfShTa1RtekvgXuezQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Erin M.", 
    "review_text": "i really like this place. our party of 3 came in around 5pm and all the tables were empty. i'm totally enamored with the decor (wouldn't mind having my apt looking like this). the round little tables are quite small. it comfortably seats two or three, but with food and drinks it can get quite cramped.   although the food was good, i wasn't blown away. the ambiance and decor made more of an impression on me. this is probably the first time i've ever given 4-stars on yelp because of how \"cute\" a place is. i like food, i like books, so this is my haven.", 
    "review_date": "2012-01-26"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "Narrow bar place, but drinks and ambiance as well as the food, is worthy to drop in to taste and test try!  Since this place is super small, seatings may be scarce for some down time to chit chatter - especially during the peak night times.  You can always stand and wait for a table or just stand to talk.  However, it is pleasant to sit to have a pleasant conversation, nonetheless.   I really like their drinks!  I got their Chamomile Old Fashioned and it was a nice drink to whine down with!   I would say this place is best enjoyed during the non-busy hours or for bar hopping purposes during the busy hours!  Cheers!", 
    "review_date": "2014-06-27"
  }, 
  "XkYpsndFoD6G096omtvguw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Betty T.", 
    "review_text": "Good drinks if you like whiskey and bourbon. They also have a selection of wine. The food is decent. I like their cheese plate and fried chicken. The downside is the space is really narrow and doesn't have a lot of seating available.", 
    "review_date": "2014-05-08"
  }, 
  "3NzXUSrMS2vAIfAGiSvq4Q": {
    "user_rating": 2.0, 
    "user_location": "Financial District, San Francisco, CA", 
    "user_name": "Bettina S.", 
    "review_text": "I don't get all the positive reviews this place gets. The staff is nice, but that's about it. It's a dark hole with uncomfortable chairs and mini-tables and it does not have at all the library-like cosy atmosphere the name suggests. There is nearly no choice of food and the food itself is uninspired and bad and expensive. They dare charging you 12$ for 2 eggs, 5 asparagus and a little bread. No sauce, no breakfast potatoes, no meat, nothing. A side of bacon is 5$. That's then 17$ to get to a half decent breakfast. There are places with great views and ambiance where you pay less for eggs Benedict with even salmon and breakfast potatoes and hollandaise sauce! No idea how they survive. They will never see me again. The get the star just for the staff.", 
    "review_date": "2013-05-05"
  }, 
  "swqPgaC_wLtmVbCYxIpOqw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lina L.", 
    "review_text": "This place is great! Cute, intimate, whimsical, rustic atmosphere with friendly staff, great mixologists, and good snacks. Deviled eggs were yummy and so was the grilled cheese with tomato soup. The drinks were GREAT and the bartender was super friendly, accommodating, and engaging. Especially recommend the Bee's Knees drink!", 
    "review_date": "2013-03-11"
  }, 
  "VFxrLIlgApHIdOCrkAYIGA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tatyana K.", 
    "review_text": "Cute atmosphere An odd sensation having to wave down staff to order anything No bourbon.  I'm curious to see them again in a few months.", 
    "review_date": "2011-10-25"
  }, 
  "5wlHRbDGQ8shSqiaQK9NrQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Katie S.", 
    "review_text": "Super small - came here with three others and it was tight, but so are we, so it was good.  It was crowded on a Saturday at the tail end of Happy Hour but then cleared out for a while before filling up again.  A nice ebb and flow to the experience. GREAT drinks. The Bartender/Mixologist was on his game and knows how to craft the perfect whisky drink. Easy on the eyes doesn't hurt either.  Love the ambiance of this place: small, quaint, dark wood, books, what more could a nerdy girl ask for?  I must come back and order some food next time.", 
    "review_date": "2014-10-05"
  }, 
  "NP-675YVy9URhNmdQdnWsQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa K.", 
    "review_text": "My expectations were a little off. This seemed more like an intimate restaurant to me than a bar. When we went around 5:00 it seemed too dark to read and everything besides the bar was oriented around small tables, so I'm not sure how one would really sit alone to read or lounge. I guess I was just expecting something more like a loungey/coffeeshop vibe with a bar than a normal/bar restaurant. Setting aside these expectations, I would come back for a light meal - the menu looked fantastic - or drink + snack. Everyone there did seem quite friendly, although it also looks pretty popular and verging on crowded, so I wouldn't plan to come if you're in a rush (but it also seems like the type of place to sit &amp; savor rather than hurry along).", 
    "review_date": "2012-02-12"
  }, 
  "a4r7b9qJI_1HwfVul-ns5A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leana L.", 
    "review_text": "Cool place for late night drinks. Quiet and intimate, this would be a great date night spot for good conversation.  Strong drinks. I got the dark knight and was quite satisfied.", 
    "review_date": "2014-09-09"
  }, 
  "G6F1ink5CWAUtYPjf-JBzQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gori V.", 
    "review_text": "Lovely place and even love the meat and the enviroment. The only wrong thing I can say is that the place is very small and always have to wait to tame a place.  But \"merece la pena la espera\"!", 
    "review_date": "2013-04-22"
  }, 
  "aFz2L-VdKWanLUOPfDqvdg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "bill w.", 
    "review_text": "My wife and I checked out Two Sisters Bar and Books.  We are hooked.  This place is affordable and fun.  We love the coffee and bar concept.  My wife is a coffee-aholic and I love......my wife!  Really you need to try it.  Read all the other reviews on this place and you'll see what I mean.", 
    "review_date": "2011-11-18"
  }, 
  "LAwptwS7nJwPkV5Niy9jkg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff H.", 
    "review_text": "There is a lot to reflect on in life these days, and yesterday was a strange day with much reflection.  It was a major milestone birthday and we attended a funeral of a friend a colleague who passed way too young.  So after an appointment on Hayes street in the late afternoon I passed by Two Sisters.  It looked like the ideal place to relax and contemplate life for a bit.  And being a gentleman who likes to read and also enjoys an occasional adult beverage, it seemed like a good place for me.  The setting is casual, slightly dark, somewhat occupied but not too crowded, and has a nice selection of music playing in the background. I seated myself at a table towards the back, across from the small bar.  The crowd was friendly, ranging from late 20's to late 40's and consisted of several couples and a group of three women at the table by the front window.  The décor is well done and there are plenty of books to pick from if you want to relax and read for a bit.  Service was friendly and prompt.  I ordered their signature Two Sisters - a twist on the classic Manhattan - and the snack special - spicy kale crustini with goat cheese.  Both were tasty - though the drink was a tad bit sweeter than I prefer.  As I sat there thinking of the recent life events the crowd slowly changed.  First, two women came in at the same time, but not together - they each sat at their own table along the wall.  Then as the couple started leaving, one by one, additional women came in.  Each of the earlier women had another woman join them at each of their tables, another two women came in and sat at the bar, and one more pair of friends met up and sat at yet another table.  During all this, on of the women at the front table left, leaving two.  So as I sat there finishing the last bite of spicy kale and enjoying the last sip of my Two Sisters, I realized that all the other patrons were pairs of women.  So here I sat at Two Sisters, drinking a Two Sisters, surrounded by 5 pairs of two women/sisters.  Just one more thing to reflect on.", 
    "review_date": "2012-10-04"
  }, 
  "5XLvD41yZAIjCzo1a1ZjlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adam R.", 
    "review_text": "Great food and staff. Cocktail selection is incredible and it's especially a great place for a manhattan lover who wants a little something extra. Plus they have a $5 manhattan happy hour!", 
    "review_date": "2013-12-26"
  }, 
  "qqKddLtLxbPnTf6c7yqS3g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "around town e.", 
    "review_text": "small  cash only neighborhood bar.", 
    "review_date": "2012-04-08"
  }, 
  "x9Jj7iepr2n59Rs2zCxnXg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Leuwam T.", 
    "review_text": "Small bar along the Hayes Valley strip. You could miss it if you aren't paying attention!  Seating is very limited but they have done a good job of creating as much standing room to enjoy cocktails and a bite as possible in the small place. The first time I visited Two Sisters I came with 3 others but I haven't returned with more than a single person. Definitely not the place to go in a group.  The space is nice for an intimate conversation and the cocktails are solid. They also offer some interesting small plates.  I have enjoyed a craft beer, aperitifs and cocktails here. The Two Sisters (a rye and cynar based cocktail) stands out. Their liquor selection is not as extensive as you  see at other cocktail bars but it is well curated with some of the best in every category.  I look forward to trying the walnut pate next time I am there. I got the mac and cheese which was interesting with the pretzel topping. I prefer a cheesier mac and cheese but theirs is inventive.  All of the staff were friendly and accommodating. I appreciated it. Cash only but there is an ATM in back if you don't mind the service fee.", 
    "review_date": "2012-06-04"
  }, 
  "xnlVxgrLP5HgaKZobRuHZA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jennifer C.", 
    "review_text": "They got a credit card machine! Whiskey drinks are still amazing, I hope they never take the chipotle chicken sandwich off the menu, and the house red is the best red on the menu, IMO!", 
    "review_date": "2012-08-25"
  }, 
  "se4L5nMtPV3pqeY13f4icg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elliot H.", 
    "review_text": "Cocktails: Old fashioned and the Back 40 are great Food: Charcuterie plate - good but very light portions of prosciutto  Ambiance: good date spot. the bartender was very attentive and made sure my friend and I were comfortable and had a place to enjoy our drinks.  Ill definitely be back", 
    "review_date": "2014-06-06"
  }, 
  "EODe5C2DKlp2UprlC0TfsA": {
    "user_rating": 4.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Leilani Q.", 
    "review_text": "Just happened to stroll into this small sized bar/restaurant during happy hour. Had a $3 beer, deviled eggs, homemade potato chips with caramelized onion dip, and the savory bread pudding.  And OH MY GOSH, am I a sucker for onion dip. I could have ate the dip with a spoon. I recommend getting the chips and dip! Great cozy place overall.", 
    "review_date": "2014-07-28"
  }, 
  "WwmWdDCJREohcxQqfnOL-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Semuteh F.", 
    "review_text": "Loved this place!  Quiet and cute little bar. Love that I can actually carry on a conversation w/o having to yell over loud music.  I had some tea and shared the house chips and charcuterie (prosciutto and blue cheese) plate with a friend.  Great place for a date or to meet up with a friend for catching up. Not good for groups since tables are for 2-3 and other seating is at the bar. Order at the bar and food items are brought to you. Very gracious service.   One of the gems of Hayes Valley for sure!", 
    "review_date": "2015-01-14"
  }, 
  "L9bfjN1dwA7S53CVnSH9mA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "kirti p.", 
    "review_text": "Two Sisters Bar and Books has all my favorite things under one roof. It's a nice addition to Hayes Valley. Aside from having monthly book clubs, this place has the best pumpkin manchego bread pudding. Can't wait to become a regular here.", 
    "review_date": "2011-12-06"
  }, 
  "BiRLsPNxF7Do5H6j9NYPdg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Mike And Theresa C.", 
    "review_text": "An interesting spot in Hayes Valley. Old school cocktails in a vintage themed bar. It's VERY tight in there, so you'll be standing awkwardly against the wall waiting for your drink while people shimmy past you. Not a big deal but the place is very narrow. It's also quite dark inside.  The drinks are strong, and I tried something that wasn't so great but the bartender was really friendly and replaced it with something better. Didn't try the food. Overall, a cool place to have a drink at, but not a place that makes you want to stay for an extended period of time.", 
    "review_date": "2013-03-13"
  }, 
  "vcOtDqQ2Cc731kFjklFeBg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany V.", 
    "review_text": "My friend and I totally thought this was a lesbian bar when we first walked in. There were so many women!!! We were walking around Hayes looking for a bar after spending 30 minutes driving around Haight looking for parking and epically failing. I had been meaning to try this place out so I was pretty psyched when we walked past it.   Service here is awesome!!! Our water was always filled, they brought out chairs for us when we could only stand at this weird table section next to the bar and they were super friendly. Space is super tight here! The food looked amazing! I didn't even know they served food here but I'm definitely coming back to try it. My friend said the bathroom was really cool too and had books and everything in it haha.   Minus one star because they ran out of the ginger beer my friend wanted and then when I wanted to try their Dark Matter cocktail we realized they couldn't make it because it uses the ginger beer! Grrrrr.", 
    "review_date": "2013-03-16"
  }, 
  "L8Om2473wuZK4LTxLL6RUg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Christina R.", 
    "review_text": "After a blissful night at Two Sisters, I'm singing lyrics from that beloved '90s sitcom:  \"Sister, sister/Never knew how much I missed ya.\" (Eat your hearts out, Tia and Tamara.)  Every moment I'm away from this place, I miss it. Went here for dinner last week and was blown away. Pumpkin bread pudding? Camembert with delightful berry preserves? A dark wood bar, book-lined shelves, and beautiful printed wallpaper? Custom gin cocktails that got me oh-so delightfully fucked up? All these components does a happy Xtina make.   One helpful hint: This place keeps things a bit café style in that the seating is first-come-first-serve. There is no list for a table, you just have to hover. It was fine for us, since we weren't in a rush, but I could see how some people might get all crotchety about it. Lighten up! Everyone's always in a hurry these days. Chill out, you monkeys!   One million stars.", 
    "review_date": "2012-02-21"
  }, 
  "ipleTHGh9KR8hO5U1yxzXw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay H.", 
    "review_text": "Lovely...just lovely. Great happy hour prices and though they have a small bar and therefore a careful selection of drink choices, they have picked solidly.   $3 beers during happy hour and I picked Arrogant Bastard. With my beer and a book in hand picked from their shelf I sat down to read and kill an hour and a half. Perfect afternoon.   Its a small yet long seating area and the bar has a handful of stools but go with a couple friends anyway and cozy up to each other! Or go alone...either way is a great way to enjoy this unique and cute little bar.", 
    "review_date": "2013-05-22"
  }, 
  "2_cvh63d0CM33n1cP-3YZA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren D.", 
    "review_text": "Visited this bar on Saturday after dinner nearby. It is a very small venue, and it was super crowded, but the bartenders greeted us right away and our drinks were ordered and made immediately. Everyone was very friendly, and we were able to find a spot at the bar near the door even though it was so crowded.   I've heard a lot about their food, but it was too busy and too late to try any. I'm looking forward to going back when its less packed to try it out.", 
    "review_date": "2013-03-04"
  }, 
  "tvwR-a-KTbdXqZBJCjdbNQ": {
    "user_rating": 4.0, 
    "user_location": "Novato, CA", 
    "user_name": "Alison R.", 
    "review_text": "Adorable - love it!  Great drinks, tasty food, good crowd, service is always pleasant.  What more can you ask for from a neighborhood bar?  It's small however so best for parties of 2-4 max imo.", 
    "review_date": "2012-11-16"
  }, 
  "WzgTJg1cWYsFMCZKLHd8-w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa L.", 
    "review_text": "Cocktail review only.   It's a hip spot.  That's all I can say.  The drinks aren't too impressive, the crowd is a little too cool for my taste and the seating arrangement is awkward.  For example, why is the bookshelf SO MUCH taller than the chairs that are put out for people to sit on?   I'm sure brunch is a lot better - but I'm not sure I'll be back.  And if you do come here, wear a fedora.", 
    "review_date": "2013-01-03"
  }, 
  "YApQEXLtWePvONPHXVSsVA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drew Z.", 
    "review_text": "We cruised by Two Sisters on a pub crawl in Hayes Valley.   I agree with others who say the crowd was a bit 'too cool'; drinks were good and the bartender was prompt.  I like little bars but could see this one getting obnoxiously crowded.", 
    "review_date": "2013-01-27"
  }, 
  "r8Trb1164K98yHiOimj5Tw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison P.", 
    "review_text": "Adorable little bar with a great drink &amp; food menu.  Happy hour prices from 4-6pm on weekdays, and from 1-4pm on weekends.  Five stars if they added one extra hour to the weekday happy hour.. it's just so hard to get off work by 6pm!  Still, this will likely become one of my go-to spots in the neighborhood.", 
    "review_date": "2015-01-29"
  }, 
  "QocP49nZ7Fo-4Rp_QxPuDQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura F.", 
    "review_text": "It is very dark in here and the seating is terribly uncomfortable and squished. I do like the cocktails here, they are all a bit fanciful and stiff. Next time, I am bringing my own cushion to sit on.", 
    "review_date": "2013-05-08"
  }, 
  "7YI8M_18t-mmPzsw5kt9qw": {
    "user_rating": 2.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Rona Y.", 
    "review_text": "The $20 brunch deal isn't that great 1. because you normally wouldn't get a drink AND coffee/tea etc. 2. because the irish coffee and breakfast martini were subpar. No one in my group got the bloody mary so I can't say... but if it is anything like the food, it will probably be pretty bland. The tea was also oversteeped.   The bread pudding seemed to be the highlight of all the dishes - mainly because it is basically a dessert.   Our actual waitress was fine, but the busboy came over, grabbed too many cups at once and spilled martini juice on me. It was only a little bit, the last drops that someone hadn't finished, but still super annoying. More annoying was that he didn't even notice, probably because he looked like he hated his life and was still hung over from the night before.", 
    "review_date": "2012-03-19"
  }, 
  "O9iVmgS_hPtNd887LDBctw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Saminda W.", 
    "review_text": "This place is quite a gem, we checked it out when they first opened for brunch and have been meaning to make it back ever since.    Just like the space itself, their menu is is small but charming, lots of richness and creativity littering the 1 page of offerings.  Their menu has since changed but when we went, we loved their deviled eggs with lemon zest, thyme, cream, black truffle and fried capers and an amazing egg, bacon, and cheese breakfast sandwich with potato chips and a tangy onion dip.    There was also the most delicious and refreshing cocktail with watermelon and basil, it still lingers on the palette.   Really recommend you check this little place out, it's a great option for a small meal or cocktail (or both).", 
    "review_date": "2013-09-21"
  }, 
  "li85I9BtJme3KAmN02CzEQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jai D.", 
    "review_text": "Got a hot date with someone you care about or you want to impress, then this is the place for you. With great ambiance, amazing and eclectic food, and a world class bartender who I only assume followed me from my favorite bar from NYC to give me G&amp;Ts that would make the Queen of England curtsy.  Best: the Happy Hour cocktail, chicken &amp; waffles, homemade pickled things and sitting in the bay window with my toddler son watching the world go by  Not so Best: Parking, Friday and Saturday nights, and sadly no chocolate soufflé", 
    "review_date": "2014-07-12"
  }, 
  "OZKGUWiQtE2CPIKpRVgVig": {
    "user_rating": 5.0, 
    "user_location": "New York, NY", 
    "user_name": "Jillian G.", 
    "review_text": "No matter where we go out at night, we keep ending up back at Two Sisters.  The bar tender and owner are super friendly, and add to cozy decor.    They have a finely edited selection of food and drink, so you really can not go wrong.  This is a reflection of an owner/chef/bar tender who are committed to sourcing good ingredients, and making something a truly great experience.    I hesitate to publish this.  I love this place, and will be sad if I cant get my usual seat at the bar.", 
    "review_date": "2012-03-11"
  }, 
  "MtV_ehFusGwykpvlaKD-uQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meg G.", 
    "review_text": "First let me say that I have never stiffed a waiter before, I have had bad service but never have been treated so rudely after taking so long to even acknowledge me that I could not help myself.  I have been here a few times and really wanted to love it.  The cocktails are great but the food is very hit and miss.  The service has never been stellar but this time was the last time.  They used to be cash only, they now except credit cards and require you to start a tab.  Understandable, however when I ordered, my irritated waitress/bartender that really did not want to interact with me was so rude about it.  below is the recap Waitress: Did you want to see a menu Me: Yes Waitress: Here Me: Can I have a Bloody Mary please Waitress: Do you want anything else Me: Yes I am going to get food Waitress: What do you want Me: What was that artichoke special Waitress: No words, points to a board Me: I will have the Bean Salad and the artichoke special Waitress: Is that all Me: I have no idea Waitress: I need a credit card to start a tab Me: I thought you were cash only Waitress: we are not anymore Me: I only brought cash Waitress: well we need to start a tab or pay in full Me: Are you kidding me Waitress: fine  She never interacted with me again and then the owner took over, I and another table returned the artichoke that was under cooked, it was returned later at the same state.  Did not finish my overly lemon salad nor the artichoke and when asked if I would like to take it home and I said no, nothing else was said.  Food is inessential for repeat business, but service is just as important.  Good luck ladies but you lost one customer that could have been a great regular.", 
    "review_date": "2012-10-07"
  }, 
  "wyob7airQM-DG7V8aPBZ1w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsey B.", 
    "review_text": "This place is very quintessential SF to me. It's really small and narrow, which makes maneuvering to the bar an experience in and of itself. The bartenders are clearly \"mixologists\" who take pride in their concoctions.  There are a few tables along the wall, all very small but cute. As for the drinks themselves, I like everything I've tried. this past Saturday was my second time here, and I started out with a Dark Knight. It was a more bitter than I expected. Not bad, but I could only take teensy sips (which okay, maybe that's a good thing). I also had their version of a Moscow Mules (I forget what they were calling it) and it was good, nothing too different than the standard but I always enjoy something with ginger beer!  If you're in the neighborhood and looking for a yummy drink, definitely give this place a try.", 
    "review_date": "2014-09-21"
  }, 
  "xylwQ6GudYdeyZDkz5CNkw": {
    "user_rating": 1.0, 
    "user_location": "El Sobrante, CA", 
    "user_name": "Whitney R.", 
    "review_text": "This place seems to be ground central for a pretentious style of running a business which is becoming all too prevalent in San Francisco. As lovers of quaint places, books and copious amounts of booze, my best friend and I made 2 attempts to patronize this business but were unsuccessful.   Firstly, this place is the size of a postage stamp. It cannot seat more than 15 comfortably. The pictures on the business website are misleading and none of the photos posted to Yelp show this. It is also almost completely pitch black, even more than most bars, which is ironic because you cannot read a book in there.  The first time we accidentally showed up in the middle of a book event. Ok, our bad, but why on earth are you holding large book events in such a ridiculously tiny space? We squeezed our way through, hoping the bar would be larger than it appeared from the street but were trapped in a crush of bodies and stuck listening to a reading of the THE most pretentious, yet vulgar prose. We couldn't get out again for a long while as the 'stage' was the only entrance/exit to the place. We tried to look at the menu, but were rebuffed by the staff.  Ok, so second time should work, right? Heading over after the Opera, we decided to try again as the cocktails *did* look delicious. We got there about 10:25 and were RUDELY informed by the bartender (as we headed for the one table free) that they were closing (they close at 11) and that it was last call RIGHT NOW. We hadn't even looked at him or approached the bar by this time. What kind of bar closes at 11pm on Thursday?! And what kind of bar makes their customers feel so unwelcome?  If you want the library atmosphere, good drinks and enough room to stretch your legs, try the Library Bar at the Hotel Rex. It also closes early during the week, but they are not rude about it.", 
    "review_date": "2012-11-30"
  }, 
  "sLXU5kX9QK0z-IsCOROzag": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Simran T.", 
    "review_text": "Love the low lighting and intimate feel (we had the table by the bay window, which had long velvety curtains on either side), the chinoiserie-style wallpaper, the super-attentive staff, the affordable prices ($5 cheese plate with cheese + pickled peppers + mustard + a head of roasted garlic + sliced baguette? yes please!!)... The food was pretty awesome, too: I'm not a bread pudding person, but their savoury bread pudding was AWESOME and has converted me entirely! We also had the side of roasted brussels sprouts + fennel, which was yummy.   And then, of course, there's the library, which is full of old-school cloth-bound volumes, everything from Kafka to Cheaper by the Dozen to Shakespeare to Homer to a Taschen picture book featuring 1000 tattoos. I hope the take-one-leave-one policy doesn't mean it devolves into a bunch of ratty mass-market paperbacks.   The older of the eponymous two sisters was working the bar when we were there, and was super nice and very interested in hearing about our experience.   The tables *are* tiny, as a previous reviewer commented, but the staff swoops in every now and again to clear away empty plates, so that wasn't too bad.", 
    "review_date": "2011-10-19"
  }, 
  "vguybeVhVDGETEm68XzggQ": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Kimya P.", 
    "review_text": "PERFECT girls night out place. Probably would never bring the boyfriend here - portions are small and it's not exactly man food?   I literally walked past this place and needed to retrace my steps to find it. Small, hole in the wall. You walk in and think you're in someone's study or a library.   There isn't a lot of seating so it's probably not ideal for groups. They also don't have liquor - more of a wine and beer place.   We shared the goat cheese kuri squash bread pudding which was phenomenal.  Light and yet creamy and definitely a type of comfort food.  We also ordered the lamb sausage which was surprisingly good though I probably wouldn't order it again- the bread pudding on the other hand, I would want seconds and third helpings!   One downside, cash only and there doesn't appear to be an ATM on premises, so plan ahead!", 
    "review_date": "2011-12-14"
  }, 
  "KCaOZUnCx25FJhFr_lKsEg": {
    "user_rating": 4.0, 
    "user_location": "Mill Creek, WA", 
    "user_name": "Heidi M.", 
    "review_text": "Last night, I found myself in Hayes Valley in need of both food and a drink, with no reservation and not a lot of time on my hands.  Ducked into Two Sisters which had a free stool at the bar and a very attentive bartender.  I was immediately served up a glass of wine and picked a couple of items from the limited small plates menu.  (Note: the menu currently linked to Yelp is not their actual menu)  First, I tried the deviled eggs, which were delicious!  I'm actually not a really big fan of deviled eggs, but the flavor of these was unique, and the \"deviled\" part was very light and fluffy.   Next, I tried the mac &amp; cheese, which was not as flavorful as I had hoped it would be (as it was a ale/mustard/cheese mixture) but still pretty good.  The house wine was good and only $5 for a large glass.   My order was ready VERY quickly even though almost every seat in the place was full.  The chef brought the items to the table and followed up later to see how I liked everything.   While they did not rush me at all, I was in a hurry, and was in and out in less than 30 minutes, which was pretty amazing.   Would like to stress one last time now friendly the staff was at this place.  I'll definitely be back again when I'm in the neighborhood.", 
    "review_date": "2012-02-23"
  }, 
  "iLjMdZi0Tm7DQxX1C1_2dg": {
    "user_rating": 4.0, 
    "user_location": "New York, NY", 
    "user_name": "Ruggy J.", 
    "review_text": "Attention fellas: if you're one of the types who claims there isn't a single decent looking female in this city (you're crazy, BTW!), I'll let you in on a little secret -- they're hanging out at Two Sisters Bar and Books! I popped by on their opening night last Friday, and the place was brimming wall-to-wall with babes. Perhaps they're friends of the Two Sisters themselves? Who knows, but it was certainly a notable gathering of attractive young women looking to have fun on a Friday. Take note!  Shallow observations aside, Two Sisters was quite the fun little hang. It's much smaller than I imagined before popping in, so you're in for a rather intimate experience. There's a small-ish bar area to the left, a few tables for larger groups to the right, an open kitchen, vintage wallpaper, and of course... the communal library right when you walk in. Such a cool concept:  you take a book, you leave a book. I saw everything from self-help books to literary classics to kid's books like Thomas the Train. Love it!  As for the eats/drinks, they're still operating with a beer and wine license only, so no cocktails for now... but they have a small selection of beers (many of which are local), and a modest wine list as well. I wasn't terribly blown away by either of the two wines I tasted, but for about $8/glass, it was just fine for a quick first splash of the night. I also dipped into a couple of small bites, even though I wasn't necessarily that hungry upon arrival. Being a fan of deviled eggs, I just had to give those a go... and they were pretty good. Certainly not the best I've had, but the chunks of prosciutto that made an appearance in the whipped yolk and ancho filling was a nice little treat. I also gave the chicken meatballs a whirl, and those little buggers were fantastic! I'd probably be inclined to order 'em every time I'm there and hankering for a snack. Bundles of ground chicken with spinach, pancetta, and white wine with a garnish of homemade pesto and grana padano cheese. Delicious!  Overall, a very good first impression! I can't wait to see what they have up their sleeve once they get their full liquor license, as I've heard rumblings that their east-coast style cocktails pack quite the alcoholic punch. Manhattans, FTW!", 
    "review_date": "2011-10-19"
  }, 
  "zA4DmVQg3mpqmAHdn3IWuA": {
    "user_rating": 2.0, 
    "user_location": "Loleta, CA", 
    "user_name": "Dani W.", 
    "review_text": "After reading all the positive reviews on here I was excited to try this place but I have to say: I don't get it. It's ridiculously, uncomfortably cramped. The dim lighting makes me want to take a nap. The grilled cheese was greasy and chewy and the tomato \"soup\" was more like marinara sauce. I couldn't finish either. My drink (the chamomile old fashioned) was fine -- nothing too special, kinda weak -- but my boyfriend's martini was undrinkable.   It's a cool idea but the execution is lacking. I don't get the hype.", 
    "review_date": "2014-02-02"
  }, 
  "ZBLZIOrO3DZJzDFlFO-bJw": {
    "user_rating": 5.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Carlos A.", 
    "review_text": "I read about Two Sisters Bar and Books a couple of months ago on Dailycandy, 7x7 and a couple of other local magazines and the concept was very appealing: books and booze! Doesn't get more SF than that, right? Two Sisters is a very cute space on my favorite block in Hayes Valley. We went this weekend for brunch and made a day of it by exploring all the shops on Hayes. Back to Two Sisters- went there with a party of 4 at noon on a Sunday. I figured Two Sisters was more of a place to grab some drinks but was REALLY impressed by the food. For $20 you get a drink and something to eat which in SF is a pretty good value since you can easily blow more than $20 on brunch.   I had the E g g   a n d   C h e e s e   S a n d w i c h - eggs n' baskets with thickcut beefsteak tomato and grafton cheddar. It was AWESOME. There was consensus in the group that the food was awesome. I had the orange juice which was very tasty.   The staff were very nice to us and attentive. I really enjoyed the Christmas music they had at the time. Most Christmas music makes me want to shoot myself but it was a good mix and not too loud.   I would definitely recommend Two Sisters as a great place to have brunch with friends and chat. It's a great concept and the food is fantastic. I'm looking forward to checking it out on a weekend night.  Note: Cash only so plan accordingly.", 
    "review_date": "2011-12-12"
  }, 
  "PauNerg-kHRpoqLwB6F5CQ": {
    "user_rating": 3.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Bill B.", 
    "review_text": "Stopped in for a drink when the crowd got too noisy down the street, and I was happy with the choice. With subdued lighting, wood trim, and cases of old books, the atmosphere is very reflective, as is the large mirror behind the bar, on which the drink specials are written. Staff were quite friendly and timely. The space is narrow but it doesn't seem like the kind of place that's going to get choked and crowded; however, if you order food, be sure to clear your appetizer before the entree arrives, since the tables arent very large - there's just enough space for a plate and a book; keep your phone tucked away and enjoy unplugging for a bit.", 
    "review_date": "2012-05-20"
  }, 
  "fnBUaGovYletRI_qPFAtqg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sarah W.", 
    "review_text": "We visited this cosy little nook for the first time today after walking past this place and trying to go in several times.  It has always been closed previously, luckily today we found it open and enjoyed a cheeky early evening cocktail. We tried the Two Sisters Manhattan 6/10 - rated by a 'cocktail connoisseur' &amp; 'Back 40' which was a longer cocktail and I thought was yummy, very quaffable, I have a sweet tooth and enjoyed the maple syrup. Great service, ambience and decor.   Will look forward to trying the food next time.", 
    "review_date": "2015-01-14"
  }, 
  "gpLTx6FgCaDvjqM7ej3lcQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexa V.", 
    "review_text": "One of my new top favorite spots in Hayes Valley!!   A small space, but very relaxed and simple.  Books on the side of the bar if you're interested in a quick read, and a great selection of cocktails, house wine and beers.    It's best to get there early for happy hour because the place does fill up, I would not recommend going there with a party bigger than 4.  Oh yea, the food menu is pretty delicious as well!", 
    "review_date": "2013-02-25"
  }, 
  "P1DoBmc7scwWQNfW0l9Wlg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Madeline B.", 
    "review_text": "Having received a lovely small cash gift, I decided to treat myself at \"Two Sisters Bar and Books\". My report: quite civilized and a lovely nosh along with a glass of Lillet. A friend who'd been a few days before had suggested the salmon from her visit and I agree/perfectly done. The Deviled EGGS: SUPERB! Swoon. Since my book was somehow not in my bag, I chose a book of poems after enjoying the foreward and coda in Farenheit 451. \"But give to me a cozy room as quiet as can be and I will go a traveling with my Atlas on my knee.\" (Ola Dawood Register) Hooray, Mikha, Michael and Ben/most hospitable folk.", 
    "review_date": "2011-10-20"
  }, 
  "8ZoaA2L0vMcA3HhsR601IA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex D.", 
    "review_text": "This place is great! Great music, great lighting and just a plain good vibe to it. Small space, but they've done a great job with the design. I approve!", 
    "review_date": "2011-10-16"
  }, 
  "GnkhVQoyUgFtnpBE_gnk3g": {
    "user_rating": 4.0, 
    "user_location": "Hayes Valley, San Francisco, CA", 
    "user_name": "Alyssa Y.", 
    "review_text": "Absolutely lovely! My new favorite spot for drinks in Hayes Valley. It's perfect for an intimate date or catch-up session with a friend (definitely too crammed for a group).   Cocktails are delicious, and the bartenders are crazy friendly. I'm taking one star off the food-- stick to drinks.", 
    "review_date": "2014-11-10"
  }, 
  "sjXDLpvcrMldagWJJDlBTQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "monica c.", 
    "review_text": "I'd been wanting to check out Two Sisters for a while, but for inexplicable reasons only made it there yesterday. Wandered in around 4:45 on a Saturday and was pleasantly surprised with the amount of open tables. Although it got way busier as the night progressed, so come early!  It's super cute + cozy - definitely my kind of digs! This place for sure succeeds in blending Krakow, Vienna, and Paris together into one bundle of awesomeness. It's kind of like a neighborhood version of Bourbon and Branch. Love that you can actually come in and just chill with some tea and a good book (although I definitely recommend doing that earlier in the evening - once the sun sets there's some serious mood lighting going on). Awesome background music reminiscent of Parisian cafés.  As I've been nursing a cold lately, the obvious/intelligent decision would have been to get one of their pots of tea (for a very reasonable $3), but once I stumbled upon their list of tasty adult beverages, I couldn't resist. Everything's made with rye or bourbon here, so don't go looking for that vodka soda ;)  We tried the Two Sisters (templeton rye, cynar, punt e mes, brandied cherry) and The Duke (rittenhouse rye, carpano antica, amontillado). Both were fantastic, and The Duke definitely helped get rid of my sore throat ;)  4 stars because, while fabulous options, there were only 4 cocktail offerings. And I kinda wanted to try the seemingly delicious Port of SF concoction, although it appears their non-spirituous beverages are no longer on the menu since they've acquired their liquor license.  Didn't get to try any food, but I'd come back in a second to check out their brunch deal.", 
    "review_date": "2012-01-22"
  }, 
  "ETDyeyqhlWvNGy2GP0Nm_w": {
    "user_rating": 5.0, 
    "user_location": "Santa Rosa, CA", 
    "user_name": "Paul J.", 
    "review_text": "Stopped here as a better way to spend two hours than sitting in rush-hour traffic and MAN is it better!  Scarcely more in appearance than a dark wood-paneled hallway, it doesn't take long to see past the initial appearance and discover why 2 Sisters is so highly rated.  Great happy hour deals on well-made drinks? Check. $3 pints of happy hour beer? Check.  Friendly, laid back bartenders &amp; hustling wait staff? Check. Cool hipster ambiance without the hey-man-don't-drown-me-in-the-mainstream poseurism? Check.  We spent two hours enjoying conversation and some very good small plates (arugula &amp; strawberry salad plus the to-die-for mini pulled pork with a plantain hockey puck and tongueasm citrus slaw). Looking forward to the next trip to the city during rush hour because I now know the antidote -- 2 Sisters.", 
    "review_date": "2014-07-04"
  }, 
  "Z2PISdtGHThSUUbFccGkrA": {
    "user_rating": 4.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Scott G.", 
    "review_text": "Enter into this intimate and cozy little nugglet of a place - you'll find yourself among friendly folks, an attentive staff, good drinks, and a bookshelf with lots of books.  I tried to look for the two sisters to thank them, but they were no where to be found.  Nonetheless, this place is a great go-to spot for pre-dinner drinks or a week night out with a friend or two.  A fine addition to Hayes Valley!", 
    "review_date": "2011-10-21"
  }, 
  "XCcHznKF6z8asDVzvri7xg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anna H.", 
    "review_text": "Booze and books, what could be better! This place is quaint and small, very small. I'd avoid going during peak times, unless you enjoy being jostled about as servers and patrons try to walk squeeze through. I've tried all of their specialty cocktails and they're all very unique and delicious. But they've got a great selection of beers and liquor too.  Oh and get the bread pudding, trust me on this one.", 
    "review_date": "2012-04-29"
  }, 
  "O4wQaUeLxZDbUCCCvZ-5Dw": {
    "user_rating": 4.0, 
    "user_location": "Bernal Heights, San Francisco, CA", 
    "user_name": "Nik K.", 
    "review_text": "Excellent happy hour! I went here with my friend after work, got the Whiskey Negroni for $5, and was quite impressed. It was sweet without being sickly. The vibe on a Tuesday at 6 is a like a quiet cozy cafe (one that serves drinks.) Looking forward to returning, which I will undoubtedly do soon.", 
    "review_date": "2014-07-24"
  }, 
  "tXtNYCeWSPOowh_yldf0zA": {
    "user_rating": 5.0, 
    "user_location": "Graton, CA", 
    "user_name": "L C.", 
    "review_text": "love it.    very european.", 
    "review_date": "2012-11-05"
  }, 
  "rjV0aQBtgryMahruozCTNw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "s w.", 
    "review_text": "Great cocktails, tasty food. Gets crowded during peak hours, but is a nice place to chill in the mid afternoon.  I am madly in love with the Chamomile Old Fashioned.", 
    "review_date": "2014-04-29"
  }, 
  "lX89A57ZsdTGx2BXaVLlYQ": {
    "user_rating": 4.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Joanna M.", 
    "review_text": "\"There's not a word yet, for old friends who've just met.\"  -Jim Henson  Walking into Two Sisters, I felt an immediate bond with the place. The dark decor, lit only by the twilight and a few scattered candles, and the shelves of free books by the door...I was at home. Same kind of Euro mixed purpose spaces that I love; you can drink a little, read, repeat, eat, strain your eyes reading in the moody lighting, listen to music, have hours of conversation. All within a tiny place that wraps its arms around you tightly and plies you with crafty cocktails.   While waiting for my wonderful friend, who I think was whom Jim Henson had in mind with the quote above, I scored the last table and put it to good use by finishing a novel and having their house red. My mom would have been appalled at me reading in such low lighting, and while sipping such unpalatable wine while doing so. Recommend that you skip the house red, and invest in their other BTG offerings or just buzz straight to the cocktails. Their bergamont bees knees is wonderful and a seriously refreshing take on the classic.   Girls night out was in full-swing when we were here. Not sure if it was a coincidence or if the Y chromosomes in SF are intimidated by a place called 'Two Sisters'. All the ladies seemed to be having serious conversations and we followed suit...cocktails in hand, of course. Gab sessions are always enhanced with candles, cocktails, and pretzel-covered mac n'cheese, no?   Bring your old friends and your new friends, and make friends with this special spot.  The Sisters only deal in cash, by the way. Kermit says it's not easy being green, but it has to happen here. There's an atm in the back by the restroom.", 
    "review_date": "2012-04-22"
  }, 
  "9rdz74ub05wudQdtOPQjaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Xteethx B.", 
    "review_text": "Love this place. The chamomile-infused old-fashioned is great. I did think they were a bit skimpy on the prosciutto but otherwise I enjoyed the food and atmosphere.", 
    "review_date": "2014-07-13"
  }, 
  "E4A2YHLCO0AEoRCkHUUSmQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Spike S.", 
    "review_text": "One of my favorite bars in the city after just two visits, and I was amazed that on my second visit, despite a gap of around six weeks, the bartender recognized us and remembered exactly what two off-menu drinks she had made me the last time.", 
    "review_date": "2012-08-18"
  }, 
  "KDewJBJknfWvQyHHFNbfdg": {
    "user_rating": 5.0, 
    "user_location": "Toronto, Canada", 
    "user_name": "Jon A.", 
    "review_text": "Jeff Buckley. Hemingway before he went gray. Rudolph Valentino. James Franco. These are the hot men I associate my days with, and this is the establishment we'd all gather at if we could. Could? After a ginger infused gin &amp; beer cocktail, they were definitely there with me. In an overwhelming fashion, I care about environments &amp; mood substance. Often that concern is more than I like as I'm light sensitive, I have tinnitus, I have anxiety, and I'm on the overly particular end on the spectrum of being particular about where I exist. Two Sisters turns all of those nervous desires on their head &amp; gives caring about environments a grand name. And, that little darling of a bar is named Sit Down Here With Me And I Might Just Propose To You.", 
    "review_date": "2012-08-20"
  }, 
  "fx7E7U_AGl2-xxTS2QhKcA": {
    "user_rating": 5.0, 
    "user_location": "Torrance, CA", 
    "user_name": "Natalie K.", 
    "review_text": "This is a great spot! Ambiance is small, cozy and home like. I came with a friend and we shared our dishes. Deviled eggs were yummy. Tomato soup was good. I keep giving grilled cheese a chance but I think my personal tastes just doesn't like them. Last I had salmon slider. That was surprising delicious! I really like this place and def would recommend a try.", 
    "review_date": "2014-12-29"
  }, 
  "dMeFqCLKzjVmE60YNGi2Pw": {
    "user_rating": 5.0, 
    "user_location": "Brooklyn, NY", 
    "user_name": "Kenneth L.", 
    "review_text": "Great spot. The music's not too loud, and they have a great beer selection. The bartenders are funny and friendly. Excellent addition to the neighborhood.", 
    "review_date": "2011-12-04"
  }, 
  "WjCz9whSc4mP8e5MNI8CVA": {
    "user_rating": 5.0, 
    "user_location": "Boca Raton, FL", 
    "user_name": "Joe M.", 
    "review_text": "So we went for one of Mikha's wonderful cocktails and ended getting into a discussion with Mikha about gin and botanicals. Next thing we know she does an impromptu gin tasting of some really interesting gins from the bay area. Love this place.", 
    "review_date": "2013-10-02"
  }, 
  "EnuScB8kjfuhfR_8DSSjnA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Colin G.", 
    "review_text": "This is such a gem of a bar.  They have tasty food and you can get a nice cocktail, a glass of wine, or a shot and a beer.  Excellent date spot.  Very romantic and cozy.  The bartenders and Chef Alex are all incredibly friendly and knowledgable.", 
    "review_date": "2013-11-11"
  }, 
  "awmRirDC7WWig6R07XZ_oA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Wakako U.", 
    "review_text": "i love the strawberry drink in the sugar/salt/black pepper rimmed glass.  I love that you can borrow books.    soooo coool.", 
    "review_date": "2012-09-25"
  }, 
  "pZAktka6VfcXmUf4lWlBJQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenn G.", 
    "review_text": "Two Sisters combines to of my favorite things...alcohol and books. After sushi at O-Toro, my friend and I made the three block trek for a post dinner drink.   Pros: - Good selection of drinks. Neither of us was in the mood for a cocktail, so my friend ordered the house red and I ordered a beer. Simple and cheap...for both drinks it was $11 + tip.  - Fantastic atmosphere. I loved the collection of books and the low lighting. It felt comfortable...like a low-key house party with your good friends.  - Great service. The bartender was quick to offer menus and get drinks even though there were only two people working.   Cons: - This place is small and was pretty packed. The acoustics are also not great...  Overall A great place for a casual drink with a friend.", 
    "review_date": "2011-12-05"
  }, 
  "vRhya8Ig7llSdrvWrSuovw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Isabel P.", 
    "review_text": "Last night came for the first time ... yes I'll be back there soon.   We had wine, the mac'n cheese (yummy) and the arugula salad (yummy too).   The ambiance is perfect and the bartender is one of the hottest men in SF ;)  See you soon two sisters!", 
    "review_date": "2012-04-28"
  }, 
  "vz0JrrmArQ4wUjhc70vifg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tony M.", 
    "review_text": "I was excited about finally checking out this new place but was turned off by the rude bartendress. My cocktail questions seemed like a bother to her.  After she made my drink she barked \"that'll be $9\" and I paid and reached for my drink.  She snapped \"I haven't finished yet!\" and added a twist to it.  All this without any humor or apology.  She also didn't know how to make a sidecar...I heard her asking someone how to make it. She needs a new job.", 
    "review_date": "2013-05-28"
  }, 
  "oxl--iAcvMX2RWSqGZXcfQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karena Q.", 
    "review_text": "I love this place. It's a quaint little spot with incredibly personable staff.  A friend and I walked in here one random Saturday afternoon and chatted with the owner at the bar and found out that they were starting a Sunday brunch. Naturally we recruited a few friends to check it out with us!  For a mere $20, you get a coffee, alcoholic beverage and your choice of a delicious brunch entree. The week we went, I had an amazing brussels sprout salad and friends got AMAZING looking breakfast sandwiches. To supplement my salad, I got a side of homemade sausage and it was by far the best breakfast sausage patty I've EVER had at a brunch...porky, misshapen and slightly sweet. I'm drooling just thinking about it.", 
    "review_date": "2012-01-03"
  }, 
  "3sUh2Ok0GrAbO3Hd9f8csQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "lisa t.", 
    "review_text": "Friendliest bartenders ever and amazing food.  Delicious squash bread pudding and good beer selection.  Best bar in Hayes.", 
    "review_date": "2012-01-29"
  }, 
  "tRClUnSHVGtjMF9VvE0bKw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alexis D.", 
    "review_text": "My boyfriend and I stumbled upon this place one Saturday afternoon strolling through Hayes.  This is a new hidden gem to both Hayes Valley, and to SF residents.  It's quaint, it's intimate, it's a locals/neighborhood joint that emphasizes all the right elements of a European cafe, meeting a DIY Brooklyn bar.  The sister is lovely, very down to earth.  We're definitely planning to hit up their brunch- $20 for a meal, cup of joe and 'adult' beverage. Amazing HH prices too!  All in all, very impressed.", 
    "review_date": "2011-11-07"
  }, 
  "TQY03QqnBzTTALx-EI6Pmg": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Candice T.", 
    "review_text": "We happened to be in Hayes, which is one of my favorite neighborhoods... While there, I got a craving for one of my favorite foods: deviled eggs. But I don't often get an opportunity to sate that craving.  Two Sisters came up in a Yelp search so we stopped in for a bite. I really liked the ambiance of this place. Books, drinks, family... deviled eggs... there's not much more to life than that.  The deviled eggs appetizer came out with only three deviled eggs... which I don't understand from even a basic level. You boil two eggs, you get four halves... and I don't have to look like \"skinny girlfriend\" asking to to split the third between the two of us.   Shepard's pie wasn't very flavorful, but it was a good portion, which aptly describes about three-quarters of shepard's pie I've ever had. :(  The grilled cheese sandwich was crispy and perfect and cheesy, it came with a delicious tomato soup that had a very very strong tomato taste.  We will definitely return - and I will make two orders of deviled eggs - so that my boyfriend can stuff me full of deliciousness without reminding me of my figure.", 
    "review_date": "2014-05-25"
  }, 
  "nyXNNLKjSWtDQka5PrFoew": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vivian D.", 
    "review_text": "I love this quaint little bar tucked away in Hayes valley complete with...BOOKS! Go figure. There isn't too much seating though but the atmosphere is the perfect balance between intimate and bustling.   Drinks are made well and it's a great place for a date or catch up with a friend. Would return and try out their food next!", 
    "review_date": "2013-05-07"
  }, 
  "mWovMFEZgWE40UVchWHlWA": {
    "user_rating": 3.0, 
    "user_location": "Rockville, MD", 
    "user_name": "Kevin F.", 
    "review_text": "kinda overrated...nice drinks, everything nice....eh.", 
    "review_date": "2012-10-20"
  }, 
  "3uWP6jEI099DTgtRxFU2cA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jess R.", 
    "review_text": "Updating this review. Since writing previously I've been back several times. The service has been wonderful, with some really friendly people working behind the bar. The food is inventive and hearty, and they do a lot with a small menu. And the drinks just can't be beat, they are so, so good! A fun off-the-usual-path place to have brunch!  I'm a Hayes Valley resident, and I was really glad when a cute new place opened in this spot. So far, I'm mostly a fan, with a few exceptions. I'll start with the good: the atmosphere is great--intimate, moody, peaceful. The drinks are exceptionally good, my current fave being the chamomile old fashioned. Now for the so-so: The food is homey and tasty but inconsistent. For instance, the first time I had the grilled cheese, it was served to me with the bread blackened. Seriously. It was burnt. I loved the soup that came with it, though, so the next time I went I ordered the grilled cheese again anyway. That time, it was cooked perfectly, and the soup was just as memorable. But in a spot where I was one of only 3 customers in the place, I would have expected something simple like a grilled cheese sandwich to be cooked properly EVERY time. The service is...interesting. I've had a couple of different people behind the counter when I've gone, and there's one very nice lady who makes a great cocktail, and there's another one who simply isn't socialized correctly. Not to say she's overtly rude, but there's just not a friendly vibe there. In such an intimate setting, warm service really is a necessity. I hope they work on this, I'd love to see the business stay successful.", 
    "review_date": "2012-11-16"
  }, 
  "2XbQIi87ySz7KSOI4RgCuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kimberly B.", 
    "review_text": "My friend and I stopped in here on a Sunday afternoon to have a little wine after brunch down the street.  We ended up splitting a carafe of wine and just hanging out talking.  It's a long narrow space with a bookcase and a bar on the left side with tables on the right.  The wallpaper and books make the space really cozy.  We had already eaten, but they have a small brunch menu on Sunday if you're looking for something light.  As far as drinks, it's currently beer &amp; wine only, but the owner told us they're hoping to have their full liquor license by the end of the year.  I'll be interested to go back and try their cocktails when they have the full bar!    I'm not sure what it's like here during the week, but I can say it's a chill place to hang out on a lazy Sunday afternoon.", 
    "review_date": "2011-12-12"
  }, 
  "bMhRn16xkG0rPl6VFBnYuw": {
    "user_rating": 5.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Sarah C.", 
    "review_text": "This place is awesome.", 
    "review_date": "2012-01-29"
  }, 
  "qIDy9zJfCuqxy6A3exPe_w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeanne C.", 
    "review_text": "Came here with the bf after work one day because of its gastropub feel. The bf loves these kinds of places so I chose this one. I've been to Hayes Valley quite a few times but never noticed or saw this establishment. We got a table for two pretty easily. You help yourself and order at the bar, and they'll bring it to you at your table. Though I ordered something that was too strong to drink, I can't complain since that was my own fault!  The snacks were good! Mac 'n cheese - Nice and cheesy but agree the pretzel isn't necessary Arugula salad - Solid. Chicken meatballs - Tasty. Juicy. Saucy. Berkshire charcuterie - YUM! My favorite.  Love the romantic dimly lit feel in here. Perfect for relaxing and hanging out.", 
    "review_date": "2012-05-13"
  }, 
  "0SGLIKAxew4PLsY4TZMWww": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rich L.", 
    "review_text": "Great little neighborhood bar.  Looks like it's gained popularity the last year but I love it for an afternoon pint.  They have happy hour from 1-4pm on the weekends.   Friendly bartenders and good bar bites round it out well.", 
    "review_date": "2013-07-14"
  }
}