{
  "d_jFqEuSL5PIH7QPsJrdyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanna T.", 
    "review_text": "Service seems to have picked up. The staff seem nicer and in the morning today, people seem cordial. It's great to have the lounge here @ Westfield Center. Often times there is no place to take a moment to catch one's breath when Christmas shopping. The lounge is in oasis in the shopping/downtown district. Thanks Chase!", 
    "review_date": "2014-12-19"
  }, 
  "-voIvdVzNfgfk2bXxIm7mQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "raymond c.", 
    "review_text": "I traveled a lot and visited the airport lounges from United and Star Alliance over the US and in different countries.  The airport lounges outside the US are way better and everyone knows that.  Today, I was on the way to M.Y. China then I saw this VIP lounge.  I used my Chase United Club credit card to get in.  To my surprise, it's not bad at all.  The lounge equips 3 to 4 commercial Keurig coffee machines with assorted K-Cups.  There were cookies, chips, soda and water.  Well, from my opinion, it's better than the United lounges in the domestic airports.  Well, so it's called the VIP lounge.  I didn't shop today so I didn't take advantage of the free-gift-wrapping.  The problem, as I see, is that it's a little bit crowded.  I was there around 3:30 pm during a weekday and there were quite some people in the lounge.  I hope that this lounge can keep the quality of offers and services.", 
    "review_date": "2012-12-18"
  }, 
  "ZhATZtcAivCoCVCup3VSeQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rebecca G.", 
    "review_text": "What's not to like about the Chase United VIP Lounge? It's open during the holiday season and closes on Christmas Eve. They have done it for the past 3 years. It's located under the dome on the 4th floor of the Westfield mall.  With your Chase United card, you can bring in 3 guests with you. Once inside, there's free coffee, tea, hot apple cider, and hot cocoa. There's also coolers with bottled water and soft drinks that are help-yourself.  There's also complimentary fruit and in the morning, they have muffins and croissants. In the afternoon, there's cookies and brownies and the cookies are delicious. In 2014, they were from Bristol Farms downstairs in the Westfield Mall. There's also chips and pretzels for the taking.  Also, there's free gift wrapping. Bring any present (it doesn't have to be purchased in the mall or anything), and they'll wrap it for you very prettily. If they're not swamped with people (like on weekends), they'll go all out and do really fancy, beautiful bows of ribbons. They have several selections of wrapping papers and ribbon, so you can customize your wrap job.  There's also free WiFi, but it's pretty wonky; it goes in and out a lot, so don't expect to start co-working here. I did try that in 2013, and found out the hard way that the internet is unreliable.  There's comfy chairs, and in 2014, they even added a bunch of big screen TVs. It's a pretty cozy place to take a load off and unwind a bit after holiday shopping.  Also, a few select dates during the season (usually on Tuesdays), if you bring an unwrapped toy donation (value of $20 or more), they'll give you a free pass to get into the United Lounge.   The only thing better is if they added a free boozy happy hour, but we can't have it all. :)", 
    "review_date": "2014-12-31"
  }, 
  "IqIpCfg0qDhIkaUJGKzlyw": {
    "user_rating": 5.0, 
    "user_location": "Houston, TX", 
    "user_name": "Diane S.", 
    "review_text": "This was so awesome a lounge inside the bloomingdales doom for united chase card holders. I not only got cookies, chips and kurieg coffee. I also got VIP lounge tickets to the lounge at the united carpet club for donating a gift for toys for tots. I loved how this lounge had tvs and places to sit it was nice to take a break while shopping. I also got a few gifts gift wrapped for free! I hope this comes back next year!! yay chase united credit card!", 
    "review_date": "2013-01-14"
  }, 
  "LOi1qbpl2hTP0cwSDDuyBQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shirley N.", 
    "review_text": "Chase Bank is once again providing a lounge for United Explorer Visa credit card holders.    Same as last year - beverages and snacks.  Free gift wrapping.  And the Toys for Tots toy drive.  Tuesday 12/3/13 and the next two subsequent Tuesdays.  Bring a unwrapped toy and you'll receive an United club pass.  Not too shabby.    Yesterday a worker was dishing out the cookies and brownies on a paper plate for you.  Is this to prevent folks from stockpiling?   Folks are grabbing what they can in both hands. Can you really eat the sweets, the chips, the bananas, the apples, drink the coffee, tea, sodas and the water while you're sitting in the lounge?  They've got Keurig  one coffee cup serving machines again.  But irregardless of which coffee flavor pod you select, the coffee dispensed tastes like hazelnut flavor.  I didn't try the tea but I bet that tastes like hazelnut too.", 
    "review_date": "2013-12-01"
  }, 
  "TJoILHOxI_K5kJUye0BtbA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mot Y.", 
    "review_text": "Open for the holidays in the mall.  It requires having a Chase United credit card flavor.  I was able to have a few cups of coffee (Newmans own), cookies, and charge my phone.  Big lcds and a lot of people just sitting around waiting for something to happen.  They also gift wrap.  Not sure if that was free.  :|", 
    "review_date": "2014-12-11"
  }, 
  "LAwptwS7nJwPkV5Niy9jkg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jeff H.", 
    "review_text": "I was a nice break from the shopping crazyiness - though the second time I went in there it was as crowded in there as it was out in the mall and on the streets and the wait for the free gift wrapping was 1 hour.  good coffee, good cookies, free water and soda's, and a friendly staff that put up with the \"entitled\" people that came into the VIP lounge.", 
    "review_date": "2012-12-24"
  }, 
  "Age3bxeXFCQpGcWB1nDE4g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben L.", 
    "review_text": "Some of the personnel are nice and friendly but most are rude, abrasive, and makes the lounge unwelcoming.  The management here is dreadful, they lack respect and courtesy; they treat visitors as if it was a privilege for them to be inside the VIP Lounge.  I've said \"hi\" on multiple visits to the managers who walk by and I was ignored, I've asked a couple questions to different managers and they reacted as if I was bothering them.  It's awful and the rules are very inconsistent, it's different for each person.  My Caucasian friends get better treatment less harassment versus I, who gets ID'd and questioned each visit.  I like the lounge amenities and the free gift wrap it's just best to be independent and not ask for help.  The gift wrappers are nice they keep to themselves and it gets busy for them, I usually drop off my gifts and return later for them.  This is probably the only part of the lounge with decent customer service unless there's a manager involved then it gets chaotic and things become disorganized and I hear \"No\" flying around.  No you can't ask for tissue paper for inside a gift box, it's only for gift bags.  \"No\", you get get a different ribbon and here I thought managers were supposed to problem solve, not create problems.    For the Toys for Tots Toy Drive, they treat this like it's a gift for visitors who want to donate toys.  They critique each toy and depending on the person bringing in the toys, some get denied.  Some are asked for proof and receipts while some are just given the United Club passes.  There's a sense of some discrimination that goes on here.  The rules are very subjective depending on the worker.  It's not very customer service oriented.  I've communicated this Rob Tacey who handles Public Relations for Chase.  If you  have issues please email to <a href=\"mailto:rob.tacey@chase.com\">rob.tacey@chase.com</a> so he can be better  informed on the performance of this lounge.", 
    "review_date": "2013-12-18"
  }, 
  "nCbL2T7cU_7D-zEZln55-w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tadaa T.", 
    "review_text": "Lounge at the Westfield concourse level for Chase United cardmembers.  Enjoy gift wrap, wifi, flatscreen tv, refreshments and drinks free of charge.", 
    "review_date": "2012-11-25"
  }, 
  "5f1td7NYde8mbahIRhaMuA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "J. P.", 
    "review_text": "I love airport lounges.  I don't get to visit one often but when I get the opportunity, I definitely make use of them.  I'll admit that I am spoiled sometimes.  So when I saw the ad for the VIP Lounge for Chase United cardholders, I knew I had to stop in.  And I have, quite a few times.    It's a great place to stop and rest away from the other Holiday shoppers.  There are Keurigs set up for a wide selection of hot drinks or fridges with cold sodas, waters or juices. Snacks are plentiful. There are TVs and free wi-fi. Just like an airport lounge!  But there's more.  Free giftwrapping (perfect since I HATE giftwrapping).  But the best is Toys for Tots Tuesday.  Bring a toy on Tuesday and show your Chase United card.  The Marines get a toy to distribute and you get two passes for the United Club.  Score.  I'll second what Joanna T says.  Membership DOES have its privileges.", 
    "review_date": "2012-12-12"
  }, 
  "j14WgRoU_-2ZE1aw1dXrJg": {
    "user_rating": 5.0, 
    "user_location": "Atlanta, GA", 
    "user_name": "Daniel B.", 
    "review_text": "This review is for the Chase United VIP Lounge located on the top floor of Westfield San Francisco Centre, just underneath the dome.  The lounge was open from November 23 to December 24, 2013.  We visited two days ago on Christmas Eve, the final day.  Considering I didn't know this place even existed, it was quite a pleasant surprise after a long day of shopping.  I'm a Chase United Visa credit cardholder and the card got me and family members access to the lounge.  I should read the benefits of my card more often.  I'm only in it for the miles.  Apparently, there were a lot of other Chase United cardholders at Westfield on that night because the lounge was slammed.  I guess it makes sense since San Francisco is a hub for United.  I'm from Atlanta where United has a small presence.  The lounge was much like an airport lounge.  Everything was complimentary.  There was cafe-style seating, TVs, a fridge with sodas and bottled water, a staff member giving out muffins, basketfuls of snacks (apples, pretzels, etc.), and multiple Keurig coffee-making machines.  There was also free, fast Wi-Fi.  Two features which were particularly useful inside a shopping mall during holiday season were the complimentary bag and coat check (a great place to leave shopping bags and continue shopping) and complimentary gift wrapping -- perfect for someone like me who isn't great at wrapping presents.  There was a limit of 2 gift-wraps per cardholder.  Freebies were offered for checking into the lounge via Facebook.  The freebies were iPhone 4 and iPhone 5 cases and nice sunglass pouches.  Now those are freebies worth checking in for.  The lounge was well stocked with snacks and refreshments and it was also well staffed.  All of the staff I interacted with were friendly and helpful.  The only downside to the lounge was the sole unisex restroom.  It was clean, but the lounge should have more restrooms.  Overall, I was pretty pleased with the Chase United VIP Lounge.  They need to do these more often!", 
    "review_date": "2013-12-26"
  }, 
  "CHV3OXUzMbMDZ5A07UGO5A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Helen L.", 
    "review_text": "It's a good place for a little respite from the hustle and bustle.  I'm grateful for a place to sit down, gather my thoughts, coffee, soft drinks, hot chocolate, muffins, scones, bags of pretzels and chips, and bananas and apples.  The staff could use a smile and fake a friendly greeting or two.  They gift wrap for free while you wait.  How wonderful is that!", 
    "review_date": "2013-12-21"
  }
}