{
  "NqR8jT3PWDkTWBuZI-Vxyw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gabriela W.", 
    "review_text": "The veggie sushi is ON. My fav is the dragon roll, no eggplant.   Four stars.   The sweet potato and avocado marry each other all up in my roll. Every time.  The roll is finished off with a very dainty lil' sprinkling of sesame seeds. Your mouth will thank you, bow down to you, throw you a party.   This used to be our go-to spot for sushi delivery. I'll be honest, they suck at getting your order to you in a timely manner. Seriously though, you won't get your order for an hour and a half or two, and they won't even trip on that. They aren't accountable for their poor a** service, and that's what kills me. We have officially broken up.  Not cool, so I gotta give 'em 1 star.", 
    "review_date": "2014-10-27"
  }, 
  "Afnxg0SfAC4gtz2DzooFzw": {
    "user_rating": 5.0, 
    "user_location": "Pasadena, CA", 
    "user_name": "Sharon L.", 
    "review_text": "It was my birthday, my friends told me to pick a place for dinner. I'm new to the city, but not to the Bay, so I found this place on Yelp, thought it looked pretty classy, and sent out the link so my friend could make the reservation.  Tuesday night, 8 pm, the restaurant is basically empty and we get our pick of tables. Now that I think about it, it's probably because the Giants' World Series game was on, although there are TVs at this restaurant too.   I'll admit, the empty tables were worrisome at first, but the service was all the more attentive for it. We were immediately offered water and edamame. My friend brought a coupon for a free crunchy CA roll for a purchase over $35, which apparently can only be redeemed if you order online. But since we didn't know that, and because it was my birthday, the waiter told us that they'd honor the coupon anyway. So far, so good...  We ordered 6 rolls: X, Kamikaze, Martini, Miso Salmon, Crunchy CA, and Volcano. The Martini and Crunchy CA were fried really well and the Martini roll is actually served in a martini glass! As a salmon lover, the Miso Salmon roll was right up my alley. All the fish was very fresh.  We also ordered 3 of the soju cocktails, which were hit and miss. My passion cocktail (soju, pineapple juice, mango juice), was definitely the hit. Not very strong, but very delicious.  After we finished--free dessert (since it was my birthday and all)! The waiter (I wish we knew his name!) brought a plate of mint chocolate and coffee ice cream mochi with some chocolate syrup in a flower pattern, and he and my friends started a round of Happy Birthday, all in different keys. Very cute, and I love both mint chocolate and coffee ice cream.  Give this place a shot. I sure am glad I did, especially on an important occasion like a birthday. We're talking about returning for those $1 oysters during happy hour...", 
    "review_date": "2014-10-22"
  }, 
  "YoNqp0aCGpXJSftY_ViVaA": {
    "user_rating": 5.0, 
    "user_location": "Crockett, CA", 
    "user_name": "Nicolas D.", 
    "review_text": "This place is amazing ..  Very good quality products .. very good prices and in the middle of the Gaytho ..  We have been there several time and always have been very happy with the food .. more than happy ...   Oh .. they have an happy hour with sushis and meal from 3pm ... to 5 pm ...   Go there and you'll love it !", 
    "review_date": "2013-04-17"
  }, 
  "1SnSWxvNZ_aU-7_CrdhG5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kenneth W.", 
    "review_text": "This is the sister restaurant of Wasabi and Ginger on Van Ness.  Wasabi Bistro opened in October 2012 and of course I was skeptical of another restaurant in the Castro.  I have been to the Bistro 5 times and I think it's one of the best, freshest Japanese food in San Francisco.  Beautiful presentation, fresh sushi, and they even make their own soy sauce.", 
    "review_date": "2013-06-06"
  }, 
  "nO_5OkDDWYHe_GE6iYQa1w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sandy L.", 
    "review_text": "This place is awesome! The environment is very unique and I love how everything is brand new. They have a large selection of appetizers and I LOVE the garlic shrimp. The waitress was very knowledgable of the menu and she introduced us to many signature dishes. I can't remember her name but she has short hair with glasses, I highly recommend her costumer service and she was down to earth and took a sake shot with my friends and I. I love an environment where everybody are friendly and just trying to have a great time.", 
    "review_date": "2013-03-13"
  }, 
  "dOOOpcnZOvlADi_Y4aSCwQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Xiaoxin H.", 
    "review_text": "Good taste and good serives, I love the uni salmon roe sashimi is the best ever!!!! Highly recommend!!!", 
    "review_date": "2014-05-18"
  }, 
  "qxOFg19UE2x-jojXhE7EDw": {
    "user_rating": 1.0, 
    "user_location": "Palo Alto, CA", 
    "user_name": "Julie L.", 
    "review_text": "horrific. i think it is pretty much consistent across the board that you should not order online for delivery! delivery took forever and when it came the guy told us to come down to get the food. not cool. to make matters wrose, the food was terrible. boooo for wasabi!", 
    "review_date": "2014-08-09"
  }, 
  "wapndG1ldCJ-bwe2IwaxIw": {
    "user_rating": 5.0, 
    "user_location": "San Antonio, TX", 
    "user_name": "Dinero A.", 
    "review_text": "This place is amazing, crunch unagi roll and x roll are s'gooood. Delivery is pretty great too, always prompt.", 
    "review_date": "2014-11-13"
  }, 
  "oST_mDS15CyM3vhfT3FIWw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Marina S.", 
    "review_text": "My new favce sushi spot in Castro. Big, fresh, juicy chunks of fish for sashimi and a yummy specialty roll. Service is impeccable. Get salmon belly sushi!  [The above was written back in August 2013.  I just realized that I have not posted it.]", 
    "review_date": "2014-01-17"
  }, 
  "4I7aa289QLmeKm-YabKbYg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jenny K.", 
    "review_text": "Strengths:  Traditional dishes with a twist like Yuzu Hirame and Garlic Edamame was very delicious.  Good assortment and very fresh sashimi.  Ask server for fresh grated wasabi!  Ankimo was very creamy.  Sparkling sake?---instant fan!  Weaknesses:  The restaurant is a lot bigger after the remodel and feels a little less personal, but now it is updated, open, and comfortable.  On the flip side...this makes a great place to have a large party.  Opportunities:  I think they are still improving their menu, but I think they would do well with more specialty dishes like the Yuzu Hirame and more sashimi and oyster options.  Threats:  At least 10 other sushi places within 4 blocks, where do I start?    Total:  $120 for 2 ppl with drinks...quite a few are those darn sparkling sake.", 
    "review_date": "2012-10-23"
  }, 
  "AHHb0kobCOaZfzcK0UUI9A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kenneth O.", 
    "review_text": "Wasabi Bistro serves delicious, inventive Japanese food -- a large selection of rolls, sushi and sashimi, tempura and skewers. Everything we ordered was delicious and the service was prompt and personal, despite the fact that the place was packed on a Friday night. Be sure to order the bacon wrapped shrimp and a couple of their rolls. Beer, wine and sake are available and there are booths and tables. All the staff were extremely pleasant and professional. Get there before it's reviewed and becomes impossible to get into.", 
    "review_date": "2013-06-23"
  }, 
  "GHVB_kyNDlyg-AoixwGOfQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rachel W.", 
    "review_text": "My girlfriend and I were craving some sushi so we came here on a Saturday afternoon after a feature at the Castro theatre. It exceeded our expectations!  First of all it was happy hour, which they have every day so we got fresh food for excellent prices. I started off with some oysters ($1 each) and it was super fresh with zesty toppings. Definitely would go back for these.   We also ordered a spicy tuna handroll ($2.95 each), Unago roll with mango and a Golden Gate Roll. Everything was fresh and tasty but the Unago roll was the most memorable and I'd come back for that too.   We also got a large order of unfiltered sake which was only $4, super good deal. Our bill came to $23 so if you want fresh food at a good deal, happy hour at this place is a great idea! Plus you get free edamame! Seems like a good place for a date night too.", 
    "review_date": "2013-06-26"
  }, 
  "kwj_QQ5VYUHSHR617YQ-xA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sally C.", 
    "review_text": "Im here again ... bravo. .  Wonderful service and very nice food... fresh oyster... lamb is delicious.", 
    "review_date": "2014-12-24"
  }, 
  "GzmNT1Thulxvn-4GoemkCg": {
    "user_rating": 3.0, 
    "user_location": "Honolulu, HI", 
    "user_name": "Jamila J.", 
    "review_text": "This place reminds me of home.  I ordered a ton of food and it all tasted good.  They looked at me and my friends like, you are a pro at ordering.  The best way to enjoy is to have a good selection, not just get one entree and eat.  Share, be merry!    I enjoyed the atmosphere and good company always enhances an experience.  I think that the menu is good for anyone, there's something for everyone.  It's a good spot for a nice dinner.", 
    "review_date": "2014-10-27"
  }, 
  "1LGfdvpEK2Ok6AX1HkwL0w": {
    "user_rating": 5.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Larry J.", 
    "review_text": "The best sushi I've had in a long time. Creative and beautiful presentation, very tasty food, great specials, and excellent friendly service. The owner checks in to see how your meal is and he really cares. I'll be back soon!", 
    "review_date": "2013-09-26"
  }, 
  "3ZGhghqiHOvfEt1wbz_vMg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mick Z.", 
    "review_text": "The food was great. I do recommend Wasabi if you want sushi. It was fresh, creative and delicious. But be careful if you get delivery! I was informed by the delivery guy that they only deliver within 2 miles, and apparently I live outside of that range. Well, sorry, but if I go to Grubhub and your restaurant is listed and I am able to order, then I assume that I live with the parameters that you set up when you agreed to have your establishment linked to a delivery site. Oops- what was I thinking? I feel that they graciously agreed to deliver my food as a first time customer, but was then told not to order delivery again. You got it! I will never order from Wasabi Bistro ever again.", 
    "review_date": "2014-10-17"
  }, 
  "2LC4yoh20VeUBIQ6TWvfjw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Raymond G.", 
    "review_text": "I read the reviews, and they seem pretty mixed. Unfortunately, this time, I have to side more on the negative side.  When I went, the restaurant was not too crowded. I was there with just one other friend. We waited almost 15-20 minutes for any sort of service. When the waitress finally showed up, all she said was, \"Do you know what you want yet?\" There was no greeting or introduction of any sort. That was disappointing.   Once we ordered, it took about 25 minutes until we got our food. Before we could ask for more water, the server seemed to just book herself out of our table, so we couldn't ask for anything.   The food was so-so. I love sushi, and I have definitely had better.   I'm unsure if we were there on an off night, but I wasn't that pleased with the service or food.", 
    "review_date": "2014-05-23"
  }, 
  "7sXksx_kIDvRARYt-Hilvg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Natalina C.", 
    "review_text": "How can you review AMAZING?!?! The man in charge Albert will taylor your order for you. He knows his fish and the staff is friendly and great.   Hands down.... This place is AMAZING and my new favorite place!", 
    "review_date": "2014-04-29"
  }, 
  "EaZL6zlu9xoxFMP1OZUWYw": {
    "user_rating": 5.0, 
    "user_location": "Castro, San Francisco, CA", 
    "user_name": "Gilbert P.", 
    "review_text": "I love this place!!! Fast service, nice waiters and Jessie at the sushi bar said I looked like Wolverine... He gets extra bonus points for that.  But seriously great food and on a Friday don't be fooled by the lack of people just because they are fools not being here. Yum!!!", 
    "review_date": "2014-02-21"
  }, 
  "2JiNySmkKpDbYKfOC6S6vQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shannon J.", 
    "review_text": "Loved the assorted sashimi (especially scallop and toro), uni Ikura tasting spoons, waygu beef tataki, baby lobster nigiri. Not to mention they have a great sake selection.", 
    "review_date": "2014-10-04"
  }, 
  "YDrzKffeCJF4_4z6x30_JA": {
    "user_rating": 5.0, 
    "user_location": "Greenbrae, CA", 
    "user_name": "Caitlin B.", 
    "review_text": "My girlfriend and I love Wasabi! We come here all the time because it has a great atmosphere and the staff is fun and attentive. Even when the restaurant is packed you will always get good service. The sushi is also very fresh for being moderately price. Come here for sushi if you are in the Castro, you won't regret it!", 
    "review_date": "2014-09-24"
  }, 
  "jR5Sto9jXOTWrpkjpIf9EQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chesley Z.", 
    "review_text": "I'm going to keep this brief as I always do. This restaurant takes sushi to the next level with their Wagyu nigiri. It melts in your mouth like a sliver of congealed fat would and brings the consumer on a euphoric boat ride down Flavor River. The rest of their sashimi stock is also delicious and fresh, especially the Toro. I've eaten at several high end sushi bars and most of the fish here is prepared on par with those restaurants. One of the many highlights of the restaurant is the wasabi. It transcended the fish to a level enjoyed only by demi gods and up. Overall, I would definitely recommend this restaurant.", 
    "review_date": "2014-07-21"
  }, 
  "cVgKdOGfnxlo4pg6uy6Gvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "EC N.", 
    "review_text": "Wasabi Bistro did a great job of remodeling the old All Season Cafe, aka The Cat and Rat.  The dinning room reminds me of restaurants in the Ginza District of Tokyo. Flashy and with a style all their own. Food was very good, very fresh and the service was excellent.   I'm not a huge fan of TV's in the dinning room, but I think I'm in the minority on this issue as just about every restaurant in the Castro has huge TV's on.", 
    "review_date": "2012-10-25"
  }, 
  "-iOg8IJADQLKzRpGZAPm6g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nick S.", 
    "review_text": "Ordered delivery from this place and they said it would take an hour. After an hour and a half I called to check on the order. They then told me it would be another hour. Don't use delivery from here.", 
    "review_date": "2014-10-20"
  }, 
  "v60jwfRL3rped6oF36v3qw": {
    "user_rating": 5.0, 
    "user_location": "Temple City, CA", 
    "user_name": "Michael A.", 
    "review_text": "Very innovative and fresh sushi menu!  The creativity of the menu caught my eye and in I went.   I had the Hawaiian Roll, the Miso Salmon sushi, and the Baby Lobster sushi.  The presentation was top notch, and there was plenty of selection in terms of fresh seafood.  The two sushi selections were seared and well seasoned with garnish and sauce.  For those of you that don't do sushi, there's plenty of hot appetizers that looked amazing, whizzing by my table.  There is also a salad, robata, nabeyaki, and traditional food menu (labeled main dish).   Despite being Friday, packed and crazy, my server Zeon still managed to be very attentive. Great!", 
    "review_date": "2014-01-10"
  }, 
  "wI795B7EQTjkSL1eiYpMhw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jen R.", 
    "review_text": "boys town sushi. checked it out after it was open for a couple of months and had to wait and wait and wait while all the boys seated all around us (and AFTER us) got waited on first. bullshit.  that aside, the sushi was pricey and i can't attest to the freshness of any of the rolls because it was all the touristy kind. you know - clever names with tempura this and eel sauce that on it. stuck to the sashimi, which was not mind-blowingly fresh. which for the price, it damn well should have been.", 
    "review_date": "2013-03-06"
  }, 
  "3qlyuu8-Uc7xEMRGDLmw8Q": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Jane H.", 
    "review_text": "Wasabi Bistro! OMG.  We went for $1 Oysters at Happy Hour, and I was skeptical of any oyster that is one dollar, BUT BOY HOWDY...  The oysters were super fresh and clean with a great sauce to add to it (if you choose). We ordered a bunch of sushi, calamari appetizer, and couple rounds of 6 oysters at a time. It was magnificent. Their California roll is so good. The crab is fresh and real, and there's a hint of lemon to it (previous deluxe California rolls come with a lemon slice on it, and I loved the combination of flavors so it was great to see this flavor on the regular CA roll.)  The tempura shrimp roll was fantastic. Sometimes it's really the basics that are a tell to the quality of a sushi spot.  The calamari comes with fried onion and jalepeno pieces and plentiful squid. (the rings AND tentacles). It was perfection.  We were so full and so happy by the end of our meal. We will become regulars and urge you to do the same.  The décor is very stylish and posh, with unique fixtures, and wall details.   The service is professional, but friendly and personable as well. We dealt with two female servers and they were engaging, helpful, checked in with us at all the right times.   I really want this restaurant to thrive. There are so few good sushi restaurants in this area. Wasabi Bistro is #1!  (Sorry, Barracuda, your days might be numbered....)", 
    "review_date": "2014-09-04"
  }, 
  "hzrjR7fQeNJc_LDMRUQMrw": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Yorbee H.", 
    "review_text": "Great food! The sushi chef and the boss are super friendly too! Everything was very delicious.. Definitely going back there!", 
    "review_date": "2014-04-24"
  }, 
  "x_-92hfHNAlC5yJu86Zf2A": {
    "user_rating": 1.0, 
    "user_location": "Pasadena, Los Angeles, CA", 
    "user_name": "Daniel K.", 
    "review_text": "Worst experience. Wait 15mins for order. Wait almost 30mins for food. Wait 10 mins for check. Wait another 10 mins to get back to us with our cards. 15+30+10+10=1hour 5mins for one sushi dish. You've got to be kidding me.", 
    "review_date": "2014-06-16"
  }, 
  "L804Hcvkq7KvZgkugfUxWw": {
    "user_rating": 4.0, 
    "user_location": "South Hero, VT", 
    "user_name": "Michael U.", 
    "review_text": "Very good sushi. Well priced lunch menu.", 
    "review_date": "2013-05-20"
  }, 
  "xSILNBPDYBL1CwbM4-I9tw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Betty C.", 
    "review_text": "I would recommend this restaurant. Service was great and fish was fresh. The wedges of mochi ice cream at the end of our meal really topped off the whole experience.", 
    "review_date": "2014-07-21"
  }, 
  "bV9KSYxj8CWwFdvNkbLmwg": {
    "user_rating": 2.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Nate T.", 
    "review_text": "Pros -Oysters were very fresh -Decor and dinnerware are very modern -Calamari came with onions and jalepeno peppers  Cons -Wouldn't honor lunch specials even though there was no time limit on lunch specials  (I got there around 3) -Service was very slow -Brought out my miso and oysters with my meal (I had wanted them for an appetizer) -My hot food was cold by the time I finished off poorly-timed appetizers -Sushi rice needed vinegar -Tea was cold - I asked for hotter tea and it took 6 minutes. The waitress warned me it was dangerously hot. I took a sip, it was perfect. Not sure why she thought the luke-warm tea was hot to begin with. She thought I was insane when I wanted it hotter.  All in all, while it was not a bad place to eat, I doubt I'll be back. The wait staff are immature and they need to focus on improving their skills (ie, bring out hot tea when it's hot, bring appetizers at the beginning of a meal, etc).", 
    "review_date": "2013-03-26"
  }, 
  "f4mMAyIgK8LESUCCyFzHEw": {
    "user_rating": 5.0, 
    "user_location": "West Hollywood, CA", 
    "user_name": "Stephen C.", 
    "review_text": "Excellent lunch and happy hour specials.  I had the miso salmon, assorted sashimi and 6 oyster shooters. All excellent and all an excellent value. I'm glad I walked by and decided to go in for lunch. Wendy was very nice and helpful, too. Great service.", 
    "review_date": "2014-06-24"
  }, 
  "Qzns2bbkT7KLK9XYl71qbw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Qinci G.", 
    "review_text": "this restaurant  is terrible！！！！！！ The service is really bad, an delivery person is very rude. This place sucks.  PLEASE DONT GO TO THIS RESTURANT.", 
    "review_date": "2014-03-29"
  }, 
  "5-ngN0yVVNno60X5t_QOPw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Boriqua H.", 
    "review_text": "I've tried ordering delivery from here a handful of times because they have a few dishes I really like. I was willing to give them the benefit of the doubt for being late the first two times but it seems that they habitually take FOREVER. When I order warm things they show up completely cold, with the inside of the bag filled with condensation...like my food has been sitting in somebody's car for over an hour. Not good when your primary ingredient is raw fish. I'm done with them after this last order of Chirashi. After an hour and a half wait time, the fish looked totally gnarly. Never had slimy skin left on my fish before. Yuck. And AGAIN, udon was stone cold. LAME.", 
    "review_date": "2014-12-11"
  }, 
  "1d_lnuJ9CS4dbm_S95phiw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Rhonda J.", 
    "review_text": "The fish was so fresh and delicious, you can tell a lot of care was taken into preparing each roll. The customer service is what takes this place to the next level, very attentive and polite waiters. The ambiance is great, really like the decor.   Finally the prices were very reasonable especially considering the area and how nice the interior of the restaurant is.", 
    "review_date": "2015-01-19"
  }, 
  "Vc-VcKwvDsqb0PQ6w8jFuA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kyle F.", 
    "review_text": "FINALLY! A unique sushi place! I've sampled a lot of different sushi places in my time. Wasabi Bistro had a refreshing menu with new and exciting rolls, great beer, and a great selection of nigiri sushi. I will go back again and again.", 
    "review_date": "2012-10-30"
  }, 
  "cDw-3yx_GfSc7tn-Oyrm7g": {
    "user_rating": 5.0, 
    "user_location": "CA, CA", 
    "user_name": "Hoa C.", 
    "review_text": "Excellent restaurant. Highly recommended. Fresh sushi and excellent customer service. We will definitely come again.", 
    "review_date": "2013-10-17"
  }, 
  "1IKxATTCLkOvpWZscAMHuw": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Jamie L.", 
    "review_text": "great place, great food, very friendly service. A must go place!", 
    "review_date": "2012-12-13"
  }, 
  "AXKSi6r7dV7P_7lIvwQL3Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Samira N.", 
    "review_text": "The service at this place is incredible. Super friendly and welcoming. Food is good and delivers fast. Ambiance is good. But seriously love going here mainly because they r soooooooo super duper nice. :)", 
    "review_date": "2014-07-22"
  }, 
  "XD62vwaHjguEWNWOkPDV_w": {
    "user_rating": 2.0, 
    "user_location": "Boston, MA", 
    "user_name": "C B.", 
    "review_text": "Terrible delivery service. Ordered at 6:05pm, told that my meal would arrive in 40 min. It didn't arrive until 7:45 - 100 minutes later!     I called to check on the status of my delivery twice and was told both times it was almost there - not so in either case.  By that time it finally arrived, the sashimi was warm and mealy and the soup was cold.  To their credit the manager did try to fix the situation when I called to complain. They spoke with the owner and called me back to let me know they wouldn't be charging me for the meal, which was nice.", 
    "review_date": "2014-10-09"
  }, 
  "knReN1F-2WbpQzyhElvnYQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Margaret I.", 
    "review_text": "I've only eaten here for lunch, but I thought it was very good.  Lots of options/combinations for a reasonable price.    I left full and content with my meal.   The interior is swanky, and the staff was really nice.  Go check them out.", 
    "review_date": "2013-01-30"
  }, 
  "j0GuiD-i9Xda-BFqQ0wVeQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Curtis L.", 
    "review_text": "This is the Castro!  Only in San Francisco can you find the best, freshest sushi and sashimi in an over the top restaruant with Chandeliers!  I was a little nervous at first glance when I walked in with my friends because this is not a traditional Japanese restaruant with all the shoji doors, and rice paper and matted walls.  This place is in your face modern and upscale different...Just like the Castro!    We were immediately greeted by the owner, Albert who I recognized from another great sushi place in Millbrae.  We were served complimentary Soy beans with just the right amount of savory goodness.    The specialty dishes are really the hit here with one of the freshest scallop dishes I have ever eaten in my life.  Sweet, fresh and firm coolness just eased down my gullet and into my belly!    My litmus test is always the fresh tuna shashimi and the quality of sushi rice.  The rice had just the right amount of sweetness and tanginess that helps to compliment the fresh, sweet, red colored tuna.  Come here when you want to entertain guests and allow yourself to have a few drinks and get your party on!", 
    "review_date": "2013-04-08"
  }, 
  "25lDL2bixVYDTkS-dipRqg": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Sophia W.", 
    "review_text": "GREAT CLASSY Place to go to with friends!!! I do like the interior and i also love the vegetarian options to this place!!! I ordered a lot of Vegetarian substitions to the sushi they served here and the staff was happy to accomodate me!!  Great place to dine at!", 
    "review_date": "2014-12-18"
  }, 
  "P3DdOOIX-owHP5UNjZWzcA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Richard H.", 
    "review_text": "Delicious food, nice ambience, good prices and friendly staff.  Will definitely be back.", 
    "review_date": "2014-01-16"
  }, 
  "dB0QbCqriqGkSblaUEqTpA": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Jun W.", 
    "review_text": "Been to various Japanese restaurant in San Francisco, by far this is the best in my opinion. Long list of variety to choose from and they are all delicious. Great environment, and staffs are very friendly.", 
    "review_date": "2014-11-17"
  }, 
  "9mZUBlhHN5uqfJlF2816PQ": {
    "user_rating": 4.0, 
    "user_location": "Ventnor City, NJ", 
    "user_name": "Joseph F.", 
    "review_text": "EXCELLENT SUSHI AND ROLLS.  The service was a bit haphazard. We arrived a bit before the end of happy hour and placed our drink order with Wendy. 10 minutes later another server arrived to ask if we needed anything. We explained we placed a drink order and were waiting for the drink delivery. Finally Wendy arrived and we placed our HAPPY HOUR order 10 minutes late. We never received one of our items and asked to have it removed from check.  We placed an additional order of sushi and a Dragon Roll and never received two of the items we had ordered and when a another server approached the table to take dessert order we informed him that we never received our Enagi or our Salmon Roe. Poof!  They arrived.  All in all the food was fabulous. The service?  It seemed that all the staff were too preoccupied with the sushi bar guests and the remainder of the guests at the tables suffered.", 
    "review_date": "2015-01-13"
  }, 
  "AnDbPtDdPhEqM8q3aPEPHQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mauricio V.", 
    "review_text": "I went in over the weekend and I was taken care of by Andy the sushi Chef! He was great! not just because of the yummy eats, but also because he was genuinely interested in having rapport with patrons. Great place and you get what you pay for!", 
    "review_date": "2013-02-14"
  }, 
  "HjpgWv5nVFvcdK1WmbdDsA": {
    "user_rating": 5.0, 
    "user_location": "Mission, San Francisco, CA", 
    "user_name": "Timothy L.", 
    "review_text": "Back to this nice restaurant again. Owner recommended some great food. We enjoyed the x mas dinner. Definitely will come back.", 
    "review_date": "2014-12-24"
  }, 
  "HxW-a6QMGzXQSYcJKtIjoQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason D.", 
    "review_text": "This place tries to be a sports bar, dance club, and sushi restaurant.  The three big screen TVs are distracting, but the awful blaring music and sub par sushi are much worse.  Went there last week, the one and only time.  You're trying to eat and this godawful music is blasting through the speakers.  Vocoders and dubstep, I'd rather get a spinal tap.  If the sushi were good I wouldn't come back because of the music, but the sushi fails too.  The fish is not good.  They can't even get the rice right.  They overcook the rice til it becomes pasty, and they use it as their sticky rice.  I suspect that's what gives you the strange aftertaste.  Oh I almost forgot, the lighting.  Way too bright.   If things stay this way, I don't think they'll be open very long.  As it is now it's just another bad restaurant in this neighborhood.", 
    "review_date": "2012-10-07"
  }, 
  "aftehIWnOvu_W8G1cPYnlw": {
    "user_rating": 4.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Ahrmon R.", 
    "review_text": "Great food but a bit too pricy like any other Japanese restaurants. The service was excellent and the food I had as well. I had some good curry that was nice and spicy. I loved their miso soup and their sushi's too. The atmosphere was very diverse in terms of people who come from different walks of life. The space is very nice and romantic...", 
    "review_date": "2014-06-23"
  }, 
  "XZeFJAOFwmkw9rCeu-R4Gw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Morris R.", 
    "review_text": "My sushi was covered in fruit flies. Also, the special Castro Roll tastes like lighter fluid.", 
    "review_date": "2013-09-07"
  }, 
  "J609G85QHctqMUNVXB1icg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Art W.", 
    "review_text": "3.5 stars. The miso tasted too much like chicken broth and the fish wasn't terribly fresh - so stick to the fried makimono.   It has a nice atmosphere, and decent prices. I'm interested to try their curry. But given my choices for sushi in the city I would not come back here for the sushi.", 
    "review_date": "2013-12-15"
  }, 
  "Qv-qgZn8nO1Dfdt8DDQ8nA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vincent C.", 
    "review_text": "nice people.  horrible lighting....made your skin looked green.  fish was good but mushy rice....like white paste.  and why tvs??????? enough already, people don't need to constantly watch tv.  it cheapens the place and the music was horrible.  other than that had a great time.", 
    "review_date": "2012-09-30"
  }, 
  "9972Cpi-eRMYFLiIjNVIBQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Edgar M.", 
    "review_text": "Tonight was very loud and it appears their service is lacking. Food known to be the star at this restaurant unfortunately was a no show.   Bright spot. Loud group that the four servers tended to left.  Will reconsider returning.....more compelling restaurant s in the area to venture towards.", 
    "review_date": "2014-11-21"
  }, 
  "IT3OAEuPQoVfrwSKlRDrFg": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "W W.", 
    "review_text": "This place is awesome! I was there with two of my friends last night. The sashimi was super fresh and nicely presented. The rolls we tried were delicious. I loved the Truffle Oil infused Hirame Sashimi &amp; Ankimo.  Great selection on Sake.  Most of all, the service was excellent.   Found out they have happy hour starting at 11am with $1 oyster.  I will definitely go back again for their happy hour.", 
    "review_date": "2013-05-11"
  }, 
  "k8pKW4G2fQpTgwa-y6rspw": {
    "user_rating": 5.0, 
    "user_location": "Twin Peaks, San Francisco, CA", 
    "user_name": "Chris H.", 
    "review_text": "LOVE, LOVE, LOVE this place! It's one of the best places to get the chirashi bowls. Great price and great sushi! My family members ordered things other than sushi and they all really enjoyed their meals! Always looking forward to going there again!", 
    "review_date": "2013-10-23"
  }, 
  "lKRikB0cNLX0ewGfbHcCMw": {
    "user_rating": 5.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Cassie B.", 
    "review_text": "Found this place while walking down the castro and it was AWESOME! The sushi was  amazing and the staff is extremely nice! The ambiance is great for date night or hanging out with friends. Super cute and hip! Ended up staying passed closing because of all the fun we were having and they didn't even kick us out! And their deep-fried green tea ice cream is DELICIOUS!!!!  It's right by all the bars and clubs so it's a great place to grab dinner and drinks with friends before a night out! :)", 
    "review_date": "2013-08-25"
  }, 
  "CpivX03zFbxCxRURNobJNQ": {
    "user_rating": 5.0, 
    "user_location": "Western Addition/NOPA, San Francisco, CA", 
    "user_name": "Daniel L.", 
    "review_text": "I went the on my friend's birthday and the food was awesome. I love the sashimi, fresh, feeling like swimming in my mouth. Great place to go to for dinner.", 
    "review_date": "2014-01-21"
  }, 
  "K46WdJcHmVJABWavKjRbQQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek V.", 
    "review_text": "The food was amazing and the staff was very attentive. We ate dinner at the bar and the chef was very interactive, which made us feel at home. This was the third time for us to eat here and each time we have never been disappointed. We certainly eat here again and continue to support this wonderful restaurant.", 
    "review_date": "2013-10-02"
  }, 
  "VMoP1kYszz2Po1XWACMnsA": {
    "user_rating": 5.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Derrick C.", 
    "review_text": "Great service, fantastic food! Definitely coming here again. Probably my favorite sushi restaurant. Great owner and staff.", 
    "review_date": "2014-01-17"
  }, 
  "yMaGSefyyBGakM6GrKAEkw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Connie D.", 
    "review_text": "I threw up when I got home. I had the teriyaki dinner special and tiger roll. Customer service was pretty lagging and there was barely anyone in there.", 
    "review_date": "2013-08-08"
  }, 
  "tHY1spV9UjQCPZ5PxSItkA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren F.", 
    "review_text": "Wasabi Bistro is like my local bar. I go here at least once a week and have become friends with the people who work there. The food is always good (best California rolls) and it's the perfect spot to drink some cold beer and hot sake. I even watched the superbowl here - they have TVs above the bar if you need to catch a game. The service is always on point every time and the wait staff is extremely friendly!", 
    "review_date": "2014-09-24"
  }, 
  "ojur8znWZhIDlfQmdPTj8g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stacy W.", 
    "review_text": "Really awesome sushi. Best I've had in the Castro.", 
    "review_date": "2012-10-04"
  }, 
  "0g0qvqR_8LRNIF2bgC8YFA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "JOHN O.", 
    "review_text": "The food is absolutely incredible and the staff is extremely accommodating. My partner and I arrived at the restaurant at 9:50 pm, and we never felt as though we had to rush to order and eat dinner. Also the staff was very helpful in patiently going through the television channels to find the particular station we wanted to watch. We will definitely return and will also tell everyone we know to support such an amazing, consistent establishment.  JOHN and DEREK", 
    "review_date": "2013-10-01"
  }, 
  "qwONwL783a0hvPQl2TVWjg": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Anthony N.", 
    "review_text": "It was super nice and shiny inside, but the food wasn't very good..  and there was a bone in the sashimi...which is so wrong on so many levels..  I just kept thinking how many times they've reused that swirled fish body decoration on the plate...I point this out because the type of fish wasn't any of the kind of sashimi that was ordered...and the waiter awkwardly took it away which i thought was fishy...haha fishy get it?  We got some weird mango tango roll that was super disgusting...I had two pieces of it and tried to pawn it off to other people.", 
    "review_date": "2013-03-04"
  }, 
  "FrjgkqEMhFeAkBxjD_Lx5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Darrin L.", 
    "review_text": "Great service. Fast. Great specialties. Fresh fish. What else can you ask for.  I love their Toro Tartare. Taste so fresh and automatically melts in your mouth.  They also have a special fried rice which absolutely mind blowing. (Mix in some fresh wasabi!)  Also, their Shooter Tasting is to die for. A little bit of everything on each spoon for you to try! What else can you ask for?", 
    "review_date": "2014-05-21"
  }, 
  "47jYU6CunkW--4S9vYqyYg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Helen F.", 
    "review_text": "UGH.  Yelpers, wtf are you guys smokin'??  This place was terrible.  i'll excusse the awful service because it was pride, but the sushi was almost unpalatable.", 
    "review_date": "2013-08-22"
  }, 
  "6AfqH-PQyTZXPG-P8AtYcw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tory P.", 
    "review_text": "Have tried so many sushi places in SF and Wasabi is by far my favorite! They not only have the best sushi around (fresh &amp; delicious), but they also have the best servers. Everyone is extremely kind and fun. I'm always bringing friends here to try it.", 
    "review_date": "2015-01-28"
  }, 
  "xLn9rVdXVhO1VX0lUxSQrg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kent W.", 
    "review_text": "I believe this restaurant opened its doors about a week ago and so we thought we'd give it a shot on its first Saturday night dinner.  Appears they've put in quite a bit of work and invested a good sum of money to update this restaurant.   The food was quite good: the sushi seemed fresh, rolls were good, and gilled very salmon flavorful.  The restaurant was quite full but didn't feel too crowded (a little loud with the music but not too bad).  The restaurant itself was well kept and clean as well as food nicely presented on the dishes.  I do think the service was somewhat disorganized, but I'll give them the benefit of the doubt that they'll work through this since they've only been open a few days and they did seem to have plenty of waitstaff to handle the crowd.  Within a few weeks, I'm sure they'll have all the kinks worked out and running a smooth operation.", 
    "review_date": "2012-09-30"
  }, 
  "kHYU060QI2JsDf3TKnx70w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon E.", 
    "review_text": "I'm really not sure how this place gets a Yelp 4-star review.  We came in last night, and sat approximately 15 minutes before a server came by.  We weren't even asked if we wanted drinks during the wait!  Meanwhile the front door's broken and swinging in the wind (my girlfriend complained of being cold).  And there's BLOODY MURDERED BODIES on the TV screens throughout the place, courtesy CSI: Miami on 3 giant TV screens.  The human blood and guts was pretty unappetizing.  We managed to get the attention of our waitress after 5 minutes, now with the murdered bodies being dissected at the morgue on the TV... She said she'd change it.  But she forgot.  5 minutes later, I told her, \"Listen, we were actually serious about not wanting to see dead people while we're eating.\"  She did fix it then...  Anyway, the food was unremarkable.  They said they had hamachi belly, but they didn't.  So I had some hamachi, and it was rubbery.  Certainly not worth savoring in any way.  We also had some rolls, which were pretty decent... Though one was overly sweet and hella fatty (deep fried).  The garlic edamame were very good.  But back to the service... So my girlfriend's vegetarian, and we ordered her stuff very clearly as \"the vegetarian stuff\"... Then the food comes out, all vegetarian stuff first, then all the fish!  So I got to watch her eat (well OK I stole a bunch of it) and then she got to watch me eat.  Really?  Seems like that could have been done better.  All in all, the only explanation for the high rating must be the prices.  Because it was actually pretty cheap.  I would much rather pay for something a little better though.", 
    "review_date": "2014-03-22"
  }, 
  "H1YXtj4sj2G5VTv0sSrb-Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jason B.", 
    "review_text": "The food is average, the look is modern/new (much needed for Castro), the service is ok.  Well that was until they sat a couple on Coke, right next to my friend and I, when the restaurant was completely empty.  The couple they seated next to us, was overly loud and I do swear they were on Coke, they were both talking at 50 miles per hour and barely took a breath between sentences, their conversations did not even match each other.  I don't know if maybe the server thought we were rude and getting back at us or something but it was one of the worst restaurant experiences I've ever had.  But again, the food was just fine, nothing special, nothing great, but not bad.  I am a firm believer that if I'm going to a place to pay for someone else to prepare my food, it should be pretty darn good and absolutely better than I could do myself.  Unfortunately, this place failed way too many places do.", 
    "review_date": "2013-03-10"
  }, 
  "6s7isj1OHWg6vQKa7YtorQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elisa L.", 
    "review_text": "As if the past in-restaurant experiences didn't scar us enough, we decided on doing an online delivery through Eat 24. A simple $25 order made around 7pm on a Sunday, and it's already 9pm with no food delivered to us yet. Contacted their driver 3 times now. They say \"10 minutes\" each time. Definitely not recommending online orders. Their yakisoba is what saves them", 
    "review_date": "2014-10-19"
  }, 
  "TRkwwj7CjxDXwpW75FvJAg": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jesse S.", 
    "review_text": "Great sushi in the Castro. Excellent fish. Terrific service! Can't wait to come back! Andy is the best!!!", 
    "review_date": "2013-04-14"
  }, 
  "Mjk19b2GiawaUKXrY7pcWQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Will C.", 
    "review_text": "Went here on a Monday night... It was fairly quiet, maybe 10-12 tables. The decor was nice, the menu is honestly on the expensive side for what you get... But I really wouldn't expect much else in the Castro.  My date ordered some sushi for main course, and I ordered one of the entrees (pork katsu). His sushi came out in about 5-10 minutes. Fifteen (!!!) minutes later, I still hadn't received any soup or salad, much less my entree.  We had a hard time flagging down someone to help us (despite eight people front of house that we counted). We mentioned that none of my food had come out yet, waiter was apologetic, went to the back and immediately returned with my entree.  When I mentioned that I didn't receive my soup or salad still, they were surprised and brought them out immediately.  As for the quality of the food, mine was mediocre at best. Under-seasoned katsu that was soggy on the bottom (I'm guessing it was sitting out for a while). Pretty much flavorless. Date said that the sushi wasn't bad, fairly standard.  The management was very apologetic for the mess up with my food, and comp'd us our sake. They offered us free dessert too.  All said, I think they really have to work on the quality of their food for the prices they are charging, and their communication between the front and back of house. Having 8 people milling about that haven't noticed a half-served table is pretty unacceptable.  Doubt I'll return.", 
    "review_date": "2012-10-30"
  }, 
  "dWEeZANzQwcRNQmb-PDFkA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John F.", 
    "review_text": "Great food, very friendly staff.", 
    "review_date": "2014-01-14"
  }, 
  "AhtAsGipzZrHGIHyec-dWw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Nick M.", 
    "review_text": "I work on the street and hadn't tried Wasabi Bistro since it opened because I thought it was the previous sushi place that had a terrible Chinese place in front just getting a facelift. However I found it had different owners now. I used to be loyal to Osaka Sushi in the Castro for my healthy food meals (amazing a neigborhood full of gym bunnies mainly has heavy food restaurants), however Osaka's sushi a while back was noticeably not as fresh one day and never got better, and it was still hard to leave without paying $35/$40 for a simple small lunch of sushi.   The interior looks nice. There's a host in the middle of the day waiting to seat you. They are super friendly. Don't let the fact that this place is empty fool you- it's good, just undiscovered! They have a large selection of food, some dishes such as the tuna tartare (delicious) have a california cuisine edge to them. I was impressed by the size of their side salad, and the price and quality were good (no iceberg lettuce). There is a large selection of hot and cold sakes. It's really easy to walk out of here after having a fresh, healthy, good tasting meal for around $25 for lunch (without being limited to the lunch special).  I highly recommend this place to all my clients who often ask where to eat in the Castro. I hope these guys succeed. If they can shake the old sushi place they'll do just fine.", 
    "review_date": "2013-01-26"
  }, 
  "8p4w0obQ4tBStWw13omWig": {
    "user_rating": 1.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Jill T.", 
    "review_text": "1) Overly salty miso soup 2) Butane soaked Castro roll 3) Grisly tough toro tartare with overripe avocados for $18 !!!!! 4) A mound tofu chunks 5) Scallops that were so badly over cooked they could have been used as bouncy balls.  There was one roll that was ok at best but I can't remember the name of it.   We should have know since it was empty on a Friday night and we were trying to wait out the traffic. Ugh.   The food was pretty awful. The atmosphere was weird. Loud lounge music, a basketball game on, and some chick flick on another TV. It was a sureal strange scene! I don't think I ever want to repeat.", 
    "review_date": "2013-12-07"
  }, 
  "DBG7ZuZvRk47W8m-bK25Fg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Larry C.", 
    "review_text": "We went for happy hour. Ambient and interior look great, but the food didn't quite live up to that experience.  We ordered oysters on the half and a couple rolls (spicy tuna, tempura). Their oysters may have been some of the worst I've had. A bit bland and still hinged to their shells. Nothing really to rave about.  One more thing. I ordered a diet coke ($2.00) and got a refill, but was charged for 2 diet cokes. Not complaining about the extra $2 but a notice about no free refills would have been nice ...  All in all, I would probably give this place another shot, but wouldn't re-order any of the foods we ate today.", 
    "review_date": "2013-01-12"
  }, 
  "rYIb_t3HlLj34MzzKw34QA": {
    "user_rating": 2.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "R Z.", 
    "review_text": "The sushi is horrible. I don't know how anyone can give the food more than two stars. We started off with some basic rolls: california and spicy tuna. Both of the rolls tasted bland and old. We also had the veg dragon roll which was also a disaster. The sweet potato tempura was incredibly bland. My wife ordered the stuffed mushrooms - soggy and gross.   Service on the other hand is great. Very friendly wait staff!", 
    "review_date": "2014-02-16"
  }, 
  "zCDGeDeq70g80lHWqjpQyw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "priya r.", 
    "review_text": "I cannot talk about the quality of the food or ambiance, because we never received our change back from the waiter last night. It was a $74 bill, and we gave $100, and we waited and waited and waited and waited. The staff was closing up and the waiter completely avoided coming back to our table. Really? NEVER presume a tip. We were planning on leaving 20% or more, and we were happy awesome customers, until you did not come back to our table and avoided saying goodbye or anything.  We did not deserve that. My boyfriend wanted to say something and we tried to catch the waiter's eye and the waiter actually just stayed in the kitchen. I did not want to quibble about a few dollars, so we left. But you know what, you stole from us. We were so nice and told you how much we enjoyed stuff, and you stole from us. You do NOT determine your own tip, and you stole from us. If you were so willing to steal cash, how can anyone believe this restaurant will keep your credit card information safe?   Management, you have anything to say?", 
    "review_date": "2012-10-20"
  }, 
  "nfNKY22eBgIdKB8jlxP-0g": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Victor P.", 
    "review_text": "What a horrible place this has become! I could not wait to get out of there.  This was our third  time and each time it got worse. First thing of the evening was that they had no oysters but the advertised $1 oysters happy hour sign was still outside. We were the first table in the restaurant on a Thursday. They should have had oysters.   They served everything backwards with the appetizers last. I don't get it.   All the food was tasteless. Cheap grade tuna. Please avoid.", 
    "review_date": "2014-03-06"
  }, 
  "rdZ5lCjCqDBTHRQtczxjFg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "joey b.", 
    "review_text": "I was a little disappointed by the food at this price level.  The only dish I would eat again was the fried tempura which deserves 4 to 5 stars.  The service and atmosphere were also good.  I'll also mention that being vegan I ordered all vegetable rolls and dishes.   The tofu steak was drowning in a sea of soy sauce and was too salty for me.  It was also crisp outside but mushy inside.  I would expect firm tofu to call this a steak. My sense is that the chef added it to the menu just to please vegetarians but does not really care how it tastes. The veggie dragon roll was pretty bland and the ratio of rice was too high. It was like eating plain rice garnished with a little avocado.   Next the potstickers were mushy and the dipping sauce way too salty for this dog. With tip the meal was close to $50 and was generally disappointing due to the food alone.", 
    "review_date": "2014-06-15"
  }, 
  "qYitzqK6btr2p627dW03Nw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristina F.", 
    "review_text": "Definitely worth the five stars.. Reasonable price super fresh sushimi.  Highly recommend", 
    "review_date": "2014-04-13"
  }, 
  "4aWNZNBGRetGOcdgwRq2Kw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jon C.", 
    "review_text": "Gays and sushi. Apparently these two things go hand and hand. However, outside of a couple spots, the Castro doesn't have that many raw fish joints. The sleek Wasabi Sushi making it's debut on the infamous street feels right at home.   Opened later than most (the profile here says 11pm, but I could've sworn I went much later), the trendy and sexy joint serves up most regular-expected rolls plus some bitchin' appetizers. Complete with a hefty beer and wine selection, the place is good to go.  Primo location will probably knock Takara out of the running for places my tummy wants to go to when needing a salmon fix.", 
    "review_date": "2012-11-19"
  }, 
  "lJ6S1pWAUBvl8VIpjsIxlA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Edward C.", 
    "review_text": "My son and I stopped in for a late lunch and it turned out to be happy hour. We hit some happy hour items but put ourselves into our servers hands. We had to have Shima Aji and OToro sashimi and a sashimi platter. The oysters were excellent because my son ate four out of five. The Toro had just come in so it came last as it needed preparing and cutting but I were very pleased when it arrived. We had Chicken Karaage, a Hawaiian roll that had butterfish and baby scallops, and pineapple and usually fruit in sushi is a disaster, but it was light and fresh and scrummy. All of our fish was of excellent quality, exceedingly fresh, generous portions, hon-maguro to die for, and the robata was very well cooked and spiced. The Toro was amazing. Fresh wasabi, caviar and fresh sweet belly!Great sake selection and the server, again steered me to a  short bottle.  Great owner, helpful and friendly staff and we will return and sit at the sushi bar. They could tell we were all about the fish. Go!", 
    "review_date": "2013-07-30"
  }, 
  "LTEhi0juViPDh9X3qJVAHg": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Phil T.", 
    "review_text": "Always fresh always the best service. Owner is super friendly like a bucket of joy.  Got to try their specials.  Dont order anything you can find at a grocery store.", 
    "review_date": "2013-08-21"
  }, 
  "fRclDad6qMwgW_l3jtRqig": {
    "user_rating": 5.0, 
    "user_location": "Glendale, AZ", 
    "user_name": "Trent K.", 
    "review_text": "Great sushi and also the first place that I have seen sparkling sake which was also awesome.", 
    "review_date": "2015-01-06"
  }, 
  "EcEvdxZO4Ur683gsC8S7GA": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Yvonne Z.", 
    "review_text": "i love this place, food is so good here! All of the fish are really good and fresh, plus their nice customer service! You will love to have dinner or lunch with your good friends. I am highly sugguest this is a good place to hang out either weekend or weekday.", 
    "review_date": "2013-10-28"
  }, 
  "qcwNi-rhMQhjinqNnWFbkQ": {
    "user_rating": 3.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Tommy H.", 
    "review_text": "Went here on New Years Eve for lunch.    Service: 4 Speed:3 Friendliness: 5 Cleanliness : 5", 
    "review_date": "2013-01-05"
  }, 
  "erbePsSZJj7E8axAuDNJmQ": {
    "user_rating": 5.0, 
    "user_location": "Outer Sunset, San Francisco, CA", 
    "user_name": "Sa C.", 
    "review_text": "The food is very good. The ppl here are supper friendly. Services is great and reasonable price.", 
    "review_date": "2012-10-27"
  }, 
  "84oPkNdCcisrtOmYK_ACwA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ella A.", 
    "review_text": "My husband and I love coming here during happy hour. The $1 oysters are so good, their california roll is made with real crab, and my all time fav is their agedashi tofu. Staffs are very friendly and the decor is very classy and nice. Definitely my go-to sushi spot!", 
    "review_date": "2014-09-15"
  }, 
  "9ZnPI53I-GnN0hHUp2g5Ew": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lee R.", 
    "review_text": "If you're in the mood for Japanse during the brunch hours then this is your spot. Quality food, decent prices and never too crowded.", 
    "review_date": "2013-03-20"
  }, 
  "7n73P9TEB-U99FwghB_1SA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kai C.", 
    "review_text": "Fantastic local restaurant in Castro  As many others have said, their sashimi selections are excellent. You can get many fish that you can't get at other local restaurants. Lunch combo is also top grade, and very well priced.  You may have to wait for a bit to get a table, always call to make a reservation first. I have always found the service to be excellent. The owner Albert is super friendly, but not in a put-on, over the top sort of way. If you are in Castro area, you should give it a try!", 
    "review_date": "2014-10-06"
  }, 
  "BZbb3oT90w9Mkbx78Yemtg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mark W.", 
    "review_text": "$1 oysters even on weekends! Delicious happy hour menu!  Whole fish aji sashimi style with crunchy fried fish bones for $18. Can' beat that. This is a well secret in Castro.", 
    "review_date": "2014-11-15"
  }, 
  "sNUxitQdM6gu7aDkoiCgFA": {
    "user_rating": 4.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Hailee P.", 
    "review_text": "I've come here on numerous occasions and honestly, I don't have anything to complain about. The staff is great. Especially the owner, he's hilarious. He makes sure he does his round to see how every table is doing and converse a little. Very hands on. Impressive.  Everything I've tried here has been a success for me. But my recent visit I tried something that I just fell in love with? Try the miso salmon! It just melts in your mouth. Loved it!", 
    "review_date": "2013-12-19"
  }, 
  "3AY6e267ZNPu1suQ2Wd-bQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dennis W.", 
    "review_text": "I have become a regular at this place. The sushi chefs all know their stuff. The selection is not huge, but it is high quality and fresh.  The sauces, an integral part of sushi, are excellent. The dishes unique to them are great.  There is no place for miles around I would rather go to either for sushi, rolls, katsu, Japanese curry, and other dishes.", 
    "review_date": "2013-12-08"
  }, 
  "eASlIdHgqFc7Dn0o1J9uWA": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Ashley C.", 
    "review_text": "Celebrated my wife's birthday there on Saturday with family and friends.  Parking is a pain right now cause Castro is all torn up and you gotta hit the side streets and or park blocks away.  Had reservations for our group and the table was all ready for us upon arrival.  Albert (owner/operator) along with his staff served us personally.    Started off with appetizers and cocktails before ordering dinner, sushi and more cocktails.  The food was absolutely delicious and the personal attention we received was awesome!  The place was pretty full with maybe a few tables open but it's a big sushi house and you couldn't tell that from the outside.  It's definitely a bit more upscale than most of the sushi places I've been to.  We live in the San Mateo/Foster City area so we had a bit of a drive just to get there.  It was well worth the drive and the time to find parking.  We'll definitely be back!", 
    "review_date": "2014-04-16"
  }, 
  "Vm1aUvzG3APDJW2JV6Ovmw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dwayne R.", 
    "review_text": "Yet another mediocre restaurant serving Japanese food prepared by non-Japanese people.  This remodeled space is atrocious.  There are too many elements, giving the place a hodge-podge feel.  The seats are covered in black, alligator pleather.  One wall is cream and gold vertical tile, while the opposite wall is a framed, mirrored finished, while the wall behind the bar and the floor are different yet again.  The lighting all looks like it came from one of those cheap discount warehouses in SOMA and there are TV's playing sports alongside music that simply makes no sense.    The food is just not right.  My partner ordered the chicken teriyaki and I had the chicken udon soup.  The chicken is paper thin, and I do mean paper thin.  Rather than a tender morsel, it feels more like chewing wet, chicken jerky.  The miso soup tastes like it's the freeze dried/rehydrated kind you get at the supermarket and the soup broth was simply brown and salty (perhaps thinned Oyster sauce)?  The food really tasted like Chinese food, meant to look Japanese.  The quality of ingredients seemed subpar (is this where they cut cost to pay for all that tacky remodeling  The prices were simply outrageous; $15.95 for a chicken teriyaki lunch special with 3 tablespoons of paper thin, chewy meat, and a similarly priced, bowl of salty brown udon, accompanied by the same, lackluster, processed looking chicken meat. Barracuda on Market or Takara Sushi on 18th if one must have Japanese in the Castro, never, ever Wasabi Bistro.", 
    "review_date": "2012-10-27"
  }, 
  "fREl4iFU7OzBK0cPYkqI6Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "James W.", 
    "review_text": "I live in the Castro and I've avoided going into this place because I honestly thought it looked tacky, but we decided to give it a whirl last night and boy am I glad we did! The food was nothing short of excellent, particularly the sashimi sampler and the AMAZING Golden Eye, which a salmon wrap with snow crab, shiso, mango and tobiko. Quite possibly the most delicious thing I've ever eaten. Our waitress, Wendy, was incredibly knowledgeable and gave us very helpful tips, including which things really shouldn't be dipped in soy sauce so that their flavor could be properly savored. They also have REAL WASABI in addition to the paste one almost always gets, which is a nice treat. We were actually the only customers there, which was sad and in due in part to the war zone of the Castro, which is being completely torn up and renovated these days, so I can't speak for how the service might be if it was crowded but for us it was perfect.   So we gorged on a lot of food and had a $30 bottle of sake that seemed magically bottomless, and the meal came to $100 for the two of us, which seems very reasonable. We will definitely be back! I'm surprised to see so many negative reviews here. I'm giving it 4 stars instead of 5 only because we're in San Francisco and that does not do justice to the truly extraordinary restaurants we have here.", 
    "review_date": "2014-04-15"
  }, 
  "68dlQ8UVpyhh-R6vPET1MA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ron J.", 
    "review_text": "Food was amazing!!! Service was bad, they did not ask to take drink order till almost 20 minutes after we were seated. Would understand if busy, but they only three tables at that point. Reason, \"had important things to take care of in back\"? Last time I checked the customer was the important thing. Also forgot to bring desert menu before bringing bill even after requesting it. Overall amazing food!! Just don't expect great service.", 
    "review_date": "2013-12-16"
  }, 
  "W_1rS-lu9l0g_-d9kiyWrA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shaun A.", 
    "review_text": "I've been a sushi eating local for 6 years now and this is one of the best Sushi bars I have been to in years. The staff is very nice and Tony was very entertaining and helpful. The sushi chef is a young cute guy which helps in any situation and he is very skilled with the ever so fresh fish. Try the Hawain butter fish wih Fresh real wasabi, I couldn't stop eating it. I got some hot Sake with my lunch and the owner kept buying me more on the house! The rice is perfect, when it was All season sushi before, they never got the rice right but the new owner has it golden!  They have a huge variety of cold sake as well. The atmosphere is nice and slick and modern except for the two 1980's ALL you eat Chinese Buffet Crystal Chandeliers hanging from the cealing are the downfall of the look. Great place for those who like great sushi, they should think about having a wesite and delivery.", 
    "review_date": "2012-10-09"
  }, 
  "K4QNhmLIfu2LaB4ugETFwA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bottomless B.", 
    "review_text": "- food: fresh / creative - atmosphere: lots of mirrors / loud music - staff: pleasant and responsive - price: reasonable for sushi  additional info: - 49er roll was a standout", 
    "review_date": "2013-07-06"
  }, 
  "IEU9EpKlA8GiBwFrK_L3xQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kevin l.", 
    "review_text": "Gave them another chance and this time it was good. I got my appetizer before my meal, main course was delivered promptly and the waitperson didn't disappear this time.", 
    "review_date": "2014-09-23"
  }, 
  "wR8sbb-NVxUQhH4e46PVbw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alex K.", 
    "review_text": "This place was amazing! Brought out all the dishes on point! The fried California roll... Amazing. Try it! :)", 
    "review_date": "2012-10-01"
  }, 
  "h2_B5S4QWkLSt-zfSiteNQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric C.", 
    "review_text": "I ordered from here on EAT 24 the other night. After waiting an hour and half I had to call Eat 24 and have them track down what was supposed to be my 45-60 min order.  Another 30 min pass before the delivery gets here.  If you are going to miss your ETA delivery time, is it that hard to pick up the phone.  Of course the food that should be hot is cold and soggy.  What made this experience even worse was the driver wouldn't deliver it to my building.   He made me walk downstairs and out to his car to pick it up.  What piss poor customer service you people have.  At least the one sushi roll I had was pretty good.", 
    "review_date": "2014-07-16"
  }, 
  "D1q4dDwKC7vuJUWwer8sxQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Zac A.", 
    "review_text": "This is regarding the take out. I ordered the Sake (Salmon) and Maguro (Tuna) Nigiri, Q Madness and Miso Soup.  The food was very ordinary. Fish was mediocre quality at best. The Q Madness tasted very 'fishy', not like lobster and tuna. If you ordered something that had a strong sauce and hid the quality of the fish, you'd probably have a much better time than i did. Miso soup was fine.  Delivery: Very disappointing. It says 45-60 minutes and it took over 80 minutes. They sent someone who couldn't speak english or navigate, and complained about the parking (despite there being available free parking directly outside). Definitely a sub-par experience.  Would I order takeout from here again? Definitely not. Would I come here for a sit-down meal? I'd give it another chance.", 
    "review_date": "2014-08-17"
  }, 
  "DeeJBXdXz9m4aQwXTrHaeQ": {
    "user_rating": 1.0, 
    "user_location": "Cambridge, MN", 
    "user_name": "Batchie B.", 
    "review_text": "Drove 20 mins to this place per yelp's 4 star rating. Posted on their website and here in yelp that they are open from 11:30-11pm  I came on a thursday at 3:30pm and this guy was telling me they are closed and will open in 30mins?!!! WTH  Was so disappointed because that was day that my son was supposed to get his braces on at 4:30pm and the only thing he wants to eat before he had them on is sushi!  Long story short, we didnt get his sushi, and of course he couldnt eat anything after the braces are on :,(   I would stick to isobune in burlingame, they have authentic sushi! and great customer service", 
    "review_date": "2014-09-27"
  }, 
  "83D1Bd0hE-d_dIp-NebR2Q": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Naimah M.", 
    "review_text": "The food was great, the service was exceptional and the music was popping. I would definitely go back!!!  We order the niku donburi which was amazing, exceeded expectation.", 
    "review_date": "2014-07-09"
  }, 
  "r1pLhaLdS9NGLKep16ctJw": {
    "user_rating": 3.0, 
    "user_location": "Santa Ana, CA", 
    "user_name": "Chantel B.", 
    "review_text": "pretty good sushi.  the service here is reallllly friendly and the atmosphere is pretty swanky.  a bit expensive, but hey you're in the castro!  would like to see some more creative rolls like osaka down the street  Edit: why 3 stars, This place is inconsistent. I reviewed it after the first time I went but have been back a few times. The fish isn't always fresh", 
    "review_date": "2012-12-04"
  }, 
  "Xj0O2l0bp633ebmG468aZw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew K.", 
    "review_text": "Nice clean glam space w a Vegas vibe. Great happy hour specials. Really nice service. Food was fresh and tasty.", 
    "review_date": "2013-10-10"
  }, 
  "KrHq1OsXkQe97G__IV6vKA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick S.", 
    "review_text": "The interior.is a bit much for me, however the food is the reason why I come 1 or 2 days a week for lunch.. Not a mediocre meal so far. Love the Katsu. And the service is on the ball!", 
    "review_date": "2013-03-06"
  }, 
  "JnGtgOPpkjyWOvWM0SYEXg": {
    "user_rating": 4.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Hen A.", 
    "review_text": "three to six pm happy hour at wasabi bistro...$four large hot house sake or beer?...take both...$dollar oysters?...take four...lightly sauced, quite fresh and wedge of lemon squeeze...sweet, tangy and a perfect slurp...$two.ninety-five hand rolls?...take one of those too...rice, filling and roll mediocre, but fine for roughly $four total...slightly buzzed, slightly filled, slightly under $twenty total, slightly worth happy hour pricing...", 
    "review_date": "2013-06-27"
  }, 
  "P3usQcIegPCl-cdH4IDirg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sean B.", 
    "review_text": "Every time I move to a new city, I start exploring. Gyms. Restaurants. Clubs. Coffee Shops. Bars. Parks. The purpose is clear; to soak in the local flavor and find things that you love about a city; to make it home.  When I moved to Phoenix years ago, I discovered Fez. Then I got to San Diego and it was Hash House a Gogo. Then in Berkeley, it was Lime (okay, in SF). Then in LA, it was Animal.  The category? Mood enhancers. Those places that are so on top of their game, do what they do so well, and make you feel so comfortable, that you just click into place and go \"Yup, this is one of those gold-star places.\"  In 2014, in San Francisco, Wasabi Bistro is the place. I don't even know what to say, other than look at my pictures. The presentation was spot-on, the flavors were flawless, the sushi amongst the freshest I've had. The sake was delightful. The waiters were handsome (Hey, you're looking at a place in the Castro. You care too.) The owner was friendly, knew half of the customers by name, and hugged half of them on their way out the door after their meal.  Chatting with the owner a bit as our party had dinner tonight, somehow he came to feel like a friendly uncle who owns a restaurant. Which is two things... one... really how you want to feel at a place to plan to return to regularly... and two... really weird because there's no resemblance at all... Okay, maybe I should stop taking myself too literally here.  Seriously, worth checking out. I don't know what the few bad reviewers were talking about, but I suspect that either they caught the place while it was still undergoing some settling-in period... they had a few bad apples they no longer have... or something. Because I'm a sushi snob, as well as, you know, a general snob, and this place just nailed it.", 
    "review_date": "2014-01-10"
  }, 
  "GE73JiRYHeMdXxCDmEaDlg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Angel C.", 
    "review_text": "I really like the sashimi by the sushi chef (creative) , pleasant environment and highly recommend..", 
    "review_date": "2014-05-28"
  }, 
  "4T3IPgAnK5qR2gs7EJ0yaA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Randy M.", 
    "review_text": "I will say i was totally surprised about how wonderful the food was here. The take out place is gone, but this really beautiful upscaled Bistro came in and a great addition to the hood. Dee had the raw fish stuff (YUK) and loved it all and I had the Chicken and the steak and it was really great. I know it looks really out of place from the outside but really the servers and cook amazing food .", 
    "review_date": "2012-09-26"
  }, 
  "h7pC54SwfneL_K9xkSq73g": {
    "user_rating": 5.0, 
    "user_location": "SOMA, San Francisco, CA", 
    "user_name": "Huijie L.", 
    "review_text": "Highly recommended! Great environment! Fast service with delicious sushi and rolls! Especially the wasabi shrimp! It's delusions!", 
    "review_date": "2012-10-27"
  }, 
  "nA800ObrgrjuxwPpwjEvWA": {
    "user_rating": 3.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Victor A.", 
    "review_text": "The only thing I have to complain about is the forgetfulness of our waiter. I ordered a sampler and was expecting it to come before the main entree and sushi roll but alas it came at the very end when everyone, including myself were done eating. He was super nice about it, giving me back rubs so I guess I can forgive him this time otherwise Bonquisha will come out the next time.  What can I say, the sampler was to die for, fresh, light and yes, umami! The roll was delicious and the tako nigiri also mouth watering. The reason for the 3 stars is because there are so many more place in SF to try I just couldn't give all my goodies to one establishment. All in all come out and try it!", 
    "review_date": "2014-02-13"
  }, 
  "Bcc-I7xeJyQMe9rKIfcjAg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "William N.", 
    "review_text": "It's a very nice and trendy looking place. I love that they are open till 1 pm but for the food you get (quality and quantity) it is not really worth the price.", 
    "review_date": "2013-08-07"
  }, 
  "Fj3XeEGpIzSrpVgEJs4ETw": {
    "user_rating": 5.0, 
    "user_location": "Newark, CA", 
    "user_name": "Andy C.", 
    "review_text": "I took my family for lunch here and had a great time.  The service for lunch was fast and lots of room available with zero to no wait.  We were served ginger and endamame for appetizer and the Miso soup was just right before our luncheon.  The Sashimi was amazing, I had a variety of samplers thanks to Albert (also owner of Wasabi and Ginger at Van Ness).  The staff and people there are very friendly.  We had some amazing foods and Sashimi which will bring me back again, upon our next visit up to SF.  The sushi and selections is amazing, also love the ambiance and decor.", 
    "review_date": "2014-04-09"
  }, 
  "orZUwETOukbGagxNWY9DQQ": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Kam L.", 
    "review_text": "Very good service! The sashimi is fresh~  and they have a lot of special rolls! Especially the Costco roll! Highly recommended!!!! Definitely will go back!", 
    "review_date": "2012-10-27"
  }, 
  "1fbqafPJJ-kxQgrJqt9wPQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Xue H.", 
    "review_text": "I was really pleasantly surprised. Ordered via Seamless.  The sashimi was really fresh and tasty (definitely best I've had on Seamless for sure), as were the baked mussels. Great looking menu with other things I'd like to try.", 
    "review_date": "2013-05-23"
  }, 
  "3TksSLep84z7dkAn7sie9A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany S.", 
    "review_text": "Decided to try something new and get out of our neighborhood.  Great selection of sushi and sides. I think our favorite was called the \"Pink Lady\". The staff  was also really friendly. Can't wait to go back :)", 
    "review_date": "2013-08-12"
  }, 
  "xJJ-Vwwtj5bJtFfvJlXe3g": {
    "user_rating": 4.0, 
    "user_location": "Charlotte, NC", 
    "user_name": "Gary C.", 
    "review_text": "I'm from the other side of the US - Charlotte, NC. Been to NYC, DC, Atlanta, Vegas, Portland, you name it, but I make it a point to come here every trip I take to San Fran because the freakin' California Roll, of all things is AMAZING! And it's the simplest, most common roll in the world, but here it is new and different and magical!   The main entrees aren't as great, but everything leading up to from the salad to the sushi is ridiculously good!!! Just go all in on the sushi instead of a full entree!", 
    "review_date": "2014-04-17"
  }, 
  "1wNEma3ZhdJcBZ9vZsXWiQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Patrick N.", 
    "review_text": "Wow!!! That is all I can say. The fish... Fresh. The ambiance... Beautiful. The chefs Jesse and Dragon (I think that's his name) were amazing. Not only were their dish captivating but their preparation was impeccable. Definitely coming back. PS if you like uni and ankimo get the shooter tasting... It's to die for", 
    "review_date": "2013-12-17"
  }, 
  "pYKeFLu5KGyhIF90BkYU5Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jerry W.", 
    "review_text": "Was very concerned when I saw high percentage of \"spicy\" rolls on the menu. In my experience this has been an attempt to mask low quality or less than fresh fish.  I am not a spicy tuna fan.  If I wan't to add chiracha to my food I will do it myself so I NEVER order anything on the menu with spicy tuna or a lot of sauce like ponzu or unagi sauce.  When I order Sushi I want to enjoy the flavor and texture of the fresh fish. Because of that this menu made it very difficult to order any rolls. I ended up order nigri: maguro, hamachi and hamachi toro., a rainbow roll, and and X roll which did have a spicy sauce.     They brought the Nigiri first and was quite pleased with the freshness and portion of fish to rice. The maguro was one of the best I had in a while.  Then came the X roll.  very nice roll with salon and tuna on top, but drizzled in a typical chiracha based sauce.  Once I wiped that off it was pretty good.  Then came what I thought was the safe roll.  the Rainbow Roll.  It touted no imitation crap, they used snow crab instead with avocado and then an assortment of fish on top.  Well it may or may not have been imitation crab, but it was the worse crab salad in a rainbow roll I have had in a long while.  I ate the fish and avocado off it and left the roll.   When I told the waiter what I thought he thanked me and said that he appreciated the feedback because that is the only way they can learn and grow.  He also brought green tea ice cream as an apology.   To wrap it up. The fish buyer seems on top of it.  If I came back I would probably stick with Nigiri Chirashi or Sashimi.  The Menu really misses the mark for me. Place is a bit too Hipster Hong Kong and prices are a bit high, but it is the heart of the Castro so their rent is probably outrageous.   Oh, and the host if very HOT.  I won't be rushing back", 
    "review_date": "2013-06-23"
  }, 
  "Xqvz7wAAapUI8YAIydfaSQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rhea K.", 
    "review_text": "I've only gotten delivery here, so I can't comment on the restaurant itself, but the delivery experience is great.  Chirashi bowl = solid Snow crab hand roll = awesome  I've tried other delivery chirashi bowls and they were meh. This one's def my favorite. Fish is pretty fresh and the sushi rice is the best I've had from delivery (and in general -- second only to Kiji). Also comes with a bit of wakame so I don't have to order that separately.", 
    "review_date": "2014-07-15"
  }, 
  "WedxYIj4FgeJspBkGZMh7A": {
    "user_rating": 5.0, 
    "user_location": "Seattle, WA", 
    "user_name": "Dainen P.", 
    "review_text": "Great sushi, great owners, great service!", 
    "review_date": "2012-10-15"
  }, 
  "CpTcmQAdYuYo9Y5Ck18dow": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Vinkin Ken T.", 
    "review_text": "This place has been opened for a year and this is my first time dining. Came in straight from work on a weekday around 5 for happy hour and the place was pretty much empty aside from a few tables. The space is huge and very nicely decorated in black and gems. Happy hour menu looks good. We got the $4 hot sake and a few appetizers including calamari, a couple of hand rolls, oysters (min is 6), and a roll. Everything was good, not bad for happy hour prices. Waiter was friendly, service was quick.", 
    "review_date": "2013-09-18"
  }, 
  "-w2amKHj9zgcIHit5Xtbzw": {
    "user_rating": 5.0, 
    "user_location": "Winnetka, CA", 
    "user_name": "Jessica N.", 
    "review_text": "I stumbled upon this place with my boyfriend when we were in the city, and I am so happy that we chose this sushi restaurant!   We were greeted immediately by the hostess and were able to sit in one of the booths. The decor of the restaurant was absolutely beautiful. With the Its dim lighting, it is perfect for date night.  We ordered a lot of different nigiri and all of them tasted extremely fresh and delicious. The lobster nigiri was my personal favorite. My boyfriend and I love spicy anything, so we gave the shishito peppers a try, and we loved it! It wasn't burning our mouth hot but they definitely had a kick to them. We also ordered uni. To be honest, I am not a fan of uni but the uni at Wasabi Bistro might have changed my mind. I always have room for dessert, so of course we ordered tempura ice cream. And, it was perfectly crispy on the outside and cool and refreshing on the inside.  In the middle of our dinner the owner, Albert, came by our table and asked how our food was and gave me and my boyfriend a complimentary beer. He was kind and genuinely wanted to know our opinions on his restaurant.   If you are in the city and near the Castro district, I would highly recommend you try this sushi restaurant. Five stars all around!", 
    "review_date": "2014-06-24"
  }, 
  "CEtn9Tl_2m41bqL5b3XqZA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Casbah Y.", 
    "review_text": "Food was good but service was SLOW. It seemed we waited 15 minutes between each dish. It was a relatively slow evening as not all tables were occupied. I had to ask twice for soy and napkins. Dishes were not removed promptly. The appetizer was served mid-meal.  Another curiosity is the TV's showing sports. Huh? I suggest they take the TV's down and replace them with artwork.  Bottom line is I will go again simply because the food IS good. Maybe the service will be better next time. But there won't be a third if they don't improve the service.", 
    "review_date": "2014-03-07"
  }, 
  "OLC9B2noj_EVAlMbTiyDGQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "david f.", 
    "review_text": "I chose wasabi over a number of other local sushi spots to host a large group last night and I'm glad I did.  The hostess and staff provide a lovely large table and provided edamame as a free appetizer which charmed our foreign guests :)  The hit by far was the sashimi chirashi with all and everyone marveling about the variety and volume of the fresh fish.  It was delightful and the service was attentive and capable.  I highly recommend it for the quality and value of the chirashi and the outstanding service and hospitality.", 
    "review_date": "2014-09-15"
  }, 
  "phqAnVSU_31DruobO8yPJA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike Y.", 
    "review_text": "The only reason I'm giving it 1 star is because Yelp doesn't allow 0 stars, which is what place deserves.  First off, it's run by Chinese -- so it's not even close to authentic Japanese sushi.  Secondly, everyone there is pushy and trying to get you to order the thing that they suggest -- even though you've told them three times you're not interested in cream cheese in your maguro roll and no, you don't like deep-fried sushi rolls.  Fish tastes fresh, but there's so much rice surrounding it that you can hardly taste it.  The only good thing was abundant green tea :)   Definitely worth skipping!", 
    "review_date": "2013-09-08"
  }, 
  "kwzcRZpBldDAbpEnhKDYFg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric M.", 
    "review_text": "I've been here once and can't wait to go again! They took fantastic care of my friends and me. The food was excellent and the service was even better. This is even more impressive when you consider they haven't been open for very long. Wasabi Bistro definitely knows what they're doing.  See you soon.", 
    "review_date": "2012-12-03"
  }, 
  "SPVVkVO7O-Dfb7y1XnpVZQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "yana Z.", 
    "review_text": "The ambiance was nice, the menu looked good. The food was mediocre, but definitely some interesting choices to pick from. Will definitely give this place another try.", 
    "review_date": "2013-05-21"
  }, 
  "QJJnwI86Bl0n_Yju5GlMTQ": {
    "user_rating": 5.0, 
    "user_location": "San Leandro, CA", 
    "user_name": "Thai Q.", 
    "review_text": "The food was delicious, the service was great and the music was popping. I would definitely go back!!! Highly recommend this restaurant to my friends.", 
    "review_date": "2014-10-06"
  }, 
  "NgapNNErXajBp6Ro5I21Jg": {
    "user_rating": 3.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Kenson K.", 
    "review_text": "We ordered 3 of their rolls and they were all good except for the Pricess roll. It had salmon and some sort of mayonaise sauce and it tasted really horrible. That needs to be axed from the menu. The spicy tuna and spider rolls were good .I can't say how good  their nigiri is since we only had the rolls. I'm always skeptical if the sushi chef isn't Japanese because I know to be a sushi chef in Japan takes years of apprenticeship and training.  We ordered other stuff off the menu which was surprisingly good, and some misses. The hamachi kama was good. Fried tofu, good. The bbq beef was good too. One thing that was not on the menu but you should try is chicken karaage (fried chicken). That was a winner.  Some of the not so good. Aside from the Princess roll mentioned above, the Teriyaki chicken - this was just grilled chicken with a sweet teriyaki sauce on it. Kinda dry. I'm used to my teriyaki chicken being marinated. We also had ankimo, which is supposed to be the foie gras of the sea. I think it sat a little too long because it didn't have that rich, buttery flavor its supposed to have. I found the taste to be rather flat.   The service was good. It took a while to get our initial order in because there was a large party next to us, but they were attentive.", 
    "review_date": "2013-01-02"
  }, 
  "dzEEHQT5b_2RUgaCELc6_g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eli B.", 
    "review_text": "Really sad as it appears the owners spent a great deal of money on the remodel.  The service was friendly, however their sushi was very unremarkable.  The seafood is of poor quality as were the sushi rolls.", 
    "review_date": "2013-02-25"
  }, 
  "-aP7KmGwfXBudWkY3oTA3w": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tommy C.", 
    "review_text": "I honestly think a 3.5 star rating is spot on for this restaurant. While I don't think the sushi is the best in the Castro (as some reviewers have pointed out) I definitely don't think it it's the worst. I went for lunch just the other day and the place was pretty empty. The waiter came over, greeted us, and answered all questions we had about the menu, which is always nice. He genuinely seemed happy to have his job, again a plus.   I ordered the lunch special, which cost $12 and included a large salad, miso soup, bowl of rice, spicy tuna roll, and 4 pieces of nigiri. That's a pretty damn good lunch special. I asked what types of Nigiri would be given and he said it was the chef's choice so I asked for anything but eel (I hate eel!). He said that wasn't a problem and left.   I agree with other reviewers in that the service is quite slow (we were the only ones in there) and the food was pretty mediocre. I mean, the sushi rice was pretty dry, but the nigiri was fresh and tasted good. I didn't like one of the nigiri pieces (albacore) and didn't eat it. When the waiter came back he was so apologetic I didn't like the albacore and offered to go get me a salmon slab of fish instead. I thought that was quite nice of him. We (my friend and I) split a spider roll, too and found it to be delicious.  In short, I'm glad I came for lunch and didn't have to spend a ton of money but If I'm in the Castro I'm probably not going to eat sushi; I'll save that for other spots within the city.", 
    "review_date": "2013-01-20"
  }, 
  "Hk2Gzp1Fmrsk_51hLjDjgw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sheila m.", 
    "review_text": "Way too noisy on a Saturday night. Stupid, unnecessary music, food ok, but service very bad: for our 6 people, took 30 minutes for half the group to get their food. Vegiie rolls boring and tasteless, although the rest of our group liked their food. Uncomfortable booths, decor that looks like it is a disco. Will not go back.", 
    "review_date": "2012-10-07"
  }, 
  "cdKPMh6h57YvpRxkatyYGw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Henry S.", 
    "review_text": "Convenient neighborhood Japanese restaurant with great service.  They have the standard different Japanese varieties of food, including sushi, donburi, noodles, rice dishes, etc.  They have their own creative fusion type dishes that are pretty good.  The waiters are great and give good service.  They are also happy to make changes to their standard dishes to my liking, so I often go there.    Price is reasonable.", 
    "review_date": "2014-04-20"
  }, 
  "fr09XguvCBnBAisR5Zxw7A": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Average J.", 
    "review_text": "Let me start by saying this place now ranks as one of the worst meals ever.  The placed called GingerFruit on Market (now Shangia) carried it for 2 years.    The place was clean.  The service was very good.  Clean and responsive staff.  No complaints.  We ordered a mix of rolls and sushi.  The sushi was small and 50% was fishy.  2 of the 3 rolls were inedible and I could have done better at Cala or Safeway. The dragon roll tasted ok; but I've never seen such an ugly preparation.  I would like them to succeed; but I think this place is another situation were the Chinese loss something in translation.  Shangria on Market is another case.  Too bad....I confess to being a regular at the old Chinese food take-out that used to be in the location.  I like it.  For those that think I might be too negative....I can tell you I liked the HiTop restaurant on Market.  Sliders. The new Korean place on the cornern 18th/Castro and many others.  This place might survive on deep pockets...but it is on par with Shangria and the BBQ Rib place up the street and Jakes (did you see the whine fest on the door?).  All owner's currently blame the 'community' for their mistakes; rather than taking the criticize and trying delivering a good meal, at a fair price, in a nice atmosphere with pleasant staff.  T.", 
    "review_date": "2012-12-04"
  }, 
  "GcUCFPT68HWi6LyEx1hWdA": {
    "user_rating": 5.0, 
    "user_location": "West Portal, San Francisco, CA", 
    "user_name": "Lauren C.", 
    "review_text": "I went on a Wednesday night after getting my hair cut in the area and was craving some sushi. I probably wouldn't have gone if I looked at the reviews on here a head of time, so I am glad I didn't! This place was very good! I was stuffed by the time I left as it was so good, I just kept ordering more.   The hand-rolls are extremely fresh and well prepared. You could taste the crunch of the nori and the freshness of the fish. Definitely some of the best hand-rolls I have had. The sushi was pretty good too, but I just got the standard Rainbow roll and 49er roll. Nothing too fancy, yet I was extremely excited that they use real crab in their rolls! It is so hard to find a good sushi place who also uses real crab.   The only negative that I had was that the wasabi was really weak/mild. I had to use a lot to get any sort of kick.   I will agree with another Yelp review in that it is a weird ambiance in the place (lounge music, sports game on the TVs, etc), but it would not prevent me from going back.  The service was also very friendly as well. The sushi chefs were attentive and friendly, and the waitress was also sure to check in with me every now and then to see if I needed anything.   If you are in the area, definitely a good sushi spot.", 
    "review_date": "2013-12-14"
  }, 
  "2inwnrRsSs077Zz9UghdNA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew M.", 
    "review_text": "The food is good but the delivery service is as bad as it gets. Food was 35 minutes over the longest expected delivery time and then the driver tells me to come down to his car to get my food when it did get here. I told him to please bring it up and he refused.   Terrible. Don't order delivery from this place.", 
    "review_date": "2014-08-02"
  }, 
  "m07sy7eLtOjVdZ8oN9JKag": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ed U.", 
    "review_text": "How fabulously swanky and perfectly appropriate Wasabi Bistro is for the Castro where everything just needs to be, well, fabulous. At least that's the impression I got when I entered the doors of this new Japanese eatery, the one that took over All Season Sushi. I came at about 8PM on a Wednesday after a rather long day at work, and the place was still moderately busy. I was seated in the bar area where there were plenty of empty two-tops. It should come as no surprise that the decor was dominated by black lacquer, high-end light fixtures and lots of mirrors.  It was like eating at Liberace's Vegas showroom. Like I said...fabulous. Complimentary edamame arrived almost as soon as I sat down (see photo). While I was squeezing the beans into my mouth one pod at at time, I kept noticing how the menu went on for days as it was dominated by quite an eclectic collection of sushi and rolls. I always feel guilty ordering an elaborate sushi plate just for myself, so I went modest and ordered the $6.50 Spicy Tuna Roll (see photo) - simple, risk-averse and to the point. It was just fine as a starter.  The main event came with the $11 bowl of Pork Ramen, which came in a white designer bowl more fitting as part of a Danish modern place setting. The surprise was how delicious it was with slices of rolled roast pork generously swimming in the hearty broth alongside bamboo shoots and bean sprouts (see photo). I had every reason to believe it was going to be a noodle disaster, but far from it, I think I may come back just for that again. I'm also tempted to try tantalizing side dishes like wasabi scallop, tofu steak or any of the robata since I like the challenge of skewers when I eat.  FOOD - 4 stars...killer ramen bowl is a major surprise worth trying here AMBIANCE - 3.5 stars...just fabulous...it's the Castro, sweetie SERVICE - 3.5 stars...on the quiet side TOTAL - 4 stars...makes me want to try some more", 
    "review_date": "2013-03-04"
  }, 
  "Yc_VOwXOt8wP3pSUB5TCoA": {
    "user_rating": 5.0, 
    "user_location": "Sausalito, CA", 
    "user_name": "Chiara D.", 
    "review_text": "Finally had a chance to stop in for lunch and it was well worth the visit. I ordered the Omakase 10pc lunch to see what the sushi chefs were featuring today and it's absolutely a dish this restaurant can be proud of. It was some of the freshest sushi you'll find in town and amazingly, it's served with delicious bright green fresh wasabi (the pale ground version has more horseradish in it).  I see that some Yelpers complained about pricing but my lunch was very fairly priced for their excellent quality fish. If freshness is essential to you and you would never think of cutting corners on sushi, you will love this place.  I also had a spectacular salmon roll with fresh (super fresh!) dungeness crab, mango and roe.  I think it's called the Sun Roll. Unique and excellent.  My server was friendly, professional and attentive. I will go back and bring friends for sure.  Check it out while there is still no wait.  It will be packed as soon as the word gets out.", 
    "review_date": "2012-12-04"
  }, 
  "oZVBBbv7aLeSIJANqtL1qQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "allen C.", 
    "review_text": "Um.A great experience sake and yummy food.  A very yummy waiter Eric.  Great tasty .  Fine.  Eric was sweet and was nicevwhemn we flirtef.   I want to hug him.", 
    "review_date": "2014-08-12"
  }, 
  "gYm8XTMDe8ntL2mKRQehGg": {
    "user_rating": 5.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Kevin T.", 
    "review_text": "The food is delicious and fresh here. The sushi and sashimi here was great, the miso salmon sushi is a must try. Service was great and will definitely be back again!", 
    "review_date": "2014-01-17"
  }, 
  "2giO3bs09uw0NDPU01sCvg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiberius A.", 
    "review_text": "Been here twice now...first on a slow after lunch hours, and once for dinner.  I like 'em, food is yummy, and the presentation is beautiful.  Some new refreshing rolls that I haven't seen or eaten at other sushi places.  It's a nice addition to the Castro.  Service was excellent.", 
    "review_date": "2013-01-25"
  }, 
  "a1tRRsrJwTlyVgDSX1wvxA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jessica W.", 
    "review_text": "This place is amazing. must try the wasabi scallops.  Good service and beautiful place.  very friendly and the food is all amazing!", 
    "review_date": "2013-05-19"
  }, 
  "1E71fItTPEDAnQyIKQKQ2A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andy H.", 
    "review_text": "had a great experience here the other night. Got a hankering for some Japanese style curry and was happy to find this place more or less right around the corner form me, when you usually I have to make the trip over to the Japan Town mall for my curry. The curry was among the best that I (and my brother) have ever had. Rich and flavor and delicious. Good stuff. It was a slow not and the service was very friendly, but also a tad on the slow side when not being friendly and talkative at our table, but we weren't in a real hurry, so it wasn't a big deal.  Good to know i have new curry joint so close to my house, I'll definitely be returning.", 
    "review_date": "2015-01-21"
  }, 
  "bQiST5YdWLSH_yk56ccApA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tracey M.", 
    "review_text": "We both got violently ill later that night.  He was throwing up and had the chills and I was such horrible stomach ache and headache for days.  My co worker and I will never come back.   We should have checked the health scores first. EEEEEEEEEEEKKKKKKKKKKKKKK", 
    "review_date": "2014-05-08"
  }, 
  "Bnn-vaauPeHfgRreT_t-1w": {
    "user_rating": 5.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Don M.", 
    "review_text": "This place ROCK!!! They have great sushi and sashimi here. The fish are very fresh and tasty, lot of delicious dishes from the kitchen as well.  I came here with a couple of friends and they all really like it. The service was great, Z was very attentive and funny. Will come back for happy hour to try it out. Good job guys.", 
    "review_date": "2013-06-10"
  }, 
  "O9iVmgS_hPtNd887LDBctw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Saminda W.", 
    "review_text": "Sadly, I have to downgrade my rating to just 1 star.  The service we have endured as of late has been absolutely abysmal.  They have consistently delivered the wrong orders, packed veggie sushi together side by side with regular fish sushi, and taken up to 2+ hours to make a delivery.  The sushi itself is generally of a good quality but the atrocious service has made it that we will never order from Wasabi again.  We've switched to Takara and have had a much better experience overall.", 
    "review_date": "2014-11-27"
  }, 
  "c9kdJ0xV7vyuKnU-DZq56g": {
    "user_rating": 5.0, 
    "user_location": "El Cerrito, CA", 
    "user_name": "Rick S.", 
    "review_text": "Reasonably priced, excellent food, extremely personal over-the-top service if you know how to behave.  My GF and I were only going to stop in for a very quick snack before dancing, but we wound up ordering lots of food and saki and having a lovely evening.  Since then, I've been back with other friends and had an equally delightful experience.  Definitely check it out.", 
    "review_date": "2014-04-15"
  }, 
  "clQ5_3BFDqnJaebdp6LcHA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tim W.", 
    "review_text": "What would you call a roll which had:  - mediocre fish  - unimaginative menu  - European-style service  - weird, hipster, d-bag customers  - high prices  I'd call it the Wasabi Bistro roll.", 
    "review_date": "2013-06-14"
  }, 
  "Q5HreYPR-t05Zb0jWMEudA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Allison S.", 
    "review_text": "I live in the neighborhood and I'm a big fan of Wasabi Bistro.  First off, for some reason whenever you go there the restaurant always has a table open (shhhh... don't tell anyone).  That's quite a rarity in the Castro and awesome to know that there's always a seat available at a good, reliable sushi place.  Second, the staff is really nice and the service (when you're in the restaurant) is always great.  On multiple occasions, the staff have either sent our table free edamame or given us a free sample of sake if we're having trouble deciding.  And, just last week, I was in there with a friend.  We were so deep in our conversation that we didn't realize it was already 11:20pm and the restaurant had closed.  I really appreciated that the folks there didn't rush us out and seemed happy to accommodate to us. One last time, the Dragon Veggie roll is totally delicious and the salad dressing... I don't know what they put in it but, honestly, I can't get enough.  Yum, thanks Wasabi Bistro!", 
    "review_date": "2014-11-20"
  }, 
  "w2o8rsUA_NkNd5AbUDO3nw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carla B.", 
    "review_text": "Fabulous sushi. Everything was fresh and delicious.  We were served free edamame within minutes of  sitting down. Happy hour had just ended, but we were still allowed to order from the specials. Other than the sushi, the agadashi tofu was also excellent and a huge serving.  Ditto for the miso glazed eggplant. Free ice cream at the end of the meal. Very reasonably priced. Highly recommended!", 
    "review_date": "2013-04-27"
  }, 
  "tLJ2QhKP3u7QtwEdXxieTw": {
    "user_rating": 5.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Amy N.", 
    "review_text": "What a great place! The sushi is fantastic and the staff is exceptionally friendly. The Country Roll was so good! I can't wait to go back and try some more!!", 
    "review_date": "2013-12-07"
  }, 
  "Mxd_5caUtCBDZfRvmKscBQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Damion B.", 
    "review_text": "Good place, friendly staff and fresh tasty sushi. Thay have a good happy hour too", 
    "review_date": "2014-10-24"
  }, 
  "0AlnetQ_-a4f7kY0Sker2w": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Susan C.", 
    "review_text": "Thanks, but no thanks.  Food:  Chirashi was just ok.  Sorta skimpy on the fish.  Some of the fish was not quite as fresh as I would have liked.  The tempura was standard and somewhat unremarkable.  The miso soup was also standard and unremarkable.  Service: Very slow, no fault of the waiter, since he was the only one for the whole restaurant during lunch time.  Ambiance: Quite modern and club-esque.  Overall, I will probably not be returning to this place when there are so many other places to eat in the area.", 
    "review_date": "2013-10-30"
  }, 
  "FFQzJQz30-2u-56V-iuzXQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jan R.", 
    "review_text": "If I had to pick a sushi/Japanese restaurant in the Castro district, it'd be Wasabi Bistro.   I pride myself in thinking that I'm somewhat of a sushi connoisseur, and in terms of taste, service, decor and price(not that this place is cheap, because it's definitely not).  Value wise, they have an excellent happy hour menu: $1 oysters, $5 tempura $4 gyozas, a real bang for your buck. Moreover, their happy hour starts at 11:30am, which is unheard of.  I recommend their 3pcs/ or 6pcs Omakase menu in order to enjoy the best and tastiest sushi they offer.  I HIGHLY recommend their seared walu sushi-succulent, tasty, buttery, orgy and heaven in your mouth awesomeness.  As of right now, I'm the \"duke\" of Osaka sushi, which is a far cry from what Wasabi Bistro is. It's just that the later is right across from my work and I rather not walk further.  I strongly recommend you to try this place. Great food, Assertive service and has a modern touch in its decor.  5 stars!", 
    "review_date": "2014-06-19"
  }, 
  "PKI6SjI2PXjRmYC-IppGyQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Vik L.", 
    "review_text": "Really good fresh sushi  The staff is friendly. Albert the manager and Sarah were great to come to our table and give us some suggestions.  The quality of the fresh catch was one of the best in the city. Prices were reasinable too and good Sake too.  I felt spoilt and may get used to it.", 
    "review_date": "2013-04-16"
  }, 
  "QGQ2hGEqb3fF6cC8Q2M50g": {
    "user_rating": 3.0, 
    "user_location": "SOMA, San Francisco, CA", 
    "user_name": "Kenya P.", 
    "review_text": "Nice Modern Design and ambiance but inexperienced service flubs and lackluster flavor in most dishes leaves room for improvement.   This review is primarily focused on the happy hour menu.  But I feel if the menu fails in the happy hour most likely does not improve later on.    If you want ambiance and want to talk, and are not focused on the food's taste this maybe a good place - it never seems terribly busy.   I love oysters and the $1 oyster happy hour special is what attracted me to try Wasabi Bistro.  I've been several times now - irresistibly drawn by the oyster appeal. The oysters are a nice size and taste ( drakes bay perhaps?) and it's served with a ginger green onion ponzu dressing.  The dressing is ok but I'd prefer  a traditional mignonette with shallots and champagne vinegar.  I wish they offered the option of more than one accompaniment.  I tried their house hot sake - a lil rough...   One very good thing is their California roll made with very nice real &amp; tasty snow-crab crab-meat.. I was pleasantly surprised and would come back just for the California roll.    I decided to try some other appetizers on the menu - the fried chicken - Chicken Karaage and Tempura.  These were mediocre, not soggy but not tastyeither.  I think this place has room for improvement.  I love meat , especially fried chicken but I think this dish would be improved if the chicken were more bite-sized and the if the dish received a sprinkle of seasalt before service.  The Tempura was not as crisp as it should be and was rather flavorless.. this place should take a page out of Osaka Sushi's playbook up the street..  The service is strange here .. a mixture of attentiveness coupled with periods where you are ignored.  I think this awkward service is due to an inexperienced &amp; untrained staff.. out of the 4 times I've been here my order has always somehow been messed up.  Once the sake I ordered failed to arrive until halfway through my dinner.  Another time the 12 oysters I ordered never came until I brought it to the attention of the staff.  Another time they removed my entree thinking I was done without asking me.  I will go back in the next month and see how things improve..  hope they are still around and get better.", 
    "review_date": "2013-05-30"
  }, 
  "C4ZMX7p7lUL5za6ok7Yo_w": {
    "user_rating": 5.0, 
    "user_location": "Brisbane, CA", 
    "user_name": "Yuri K.", 
    "review_text": "I was very pleasantly surprised by this sushi spot.  The fish was very fresh, the rolls were delicious and the sashimi was amazing.  I highly recommend the fresh oyster.", 
    "review_date": "2013-10-08"
  }, 
  "LWHO0aXIX_ZHi773jyOUZw": {
    "user_rating": 5.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Norman S.", 
    "review_text": "Came to Wasabi Bistro the first week of opening and the service was still getting up to speed so it wasn't all that great. However when I made a trip here again, it seems like the manager has done a better job at managing the service and I had a pleasant dining experience with a couple of my friends. The shrimp and scallops from the kitchen are wonderful and the fish is all fresh. I will definitely be back again.", 
    "review_date": "2012-10-21"
  }, 
  "Y6IiPVI6amY3oA-Ir9UM0g": {
    "user_rating": 5.0, 
    "user_location": "Crockett, CA", 
    "user_name": "Jamie D.", 
    "review_text": "Love this place! Great food and good service! The happy hour is great and can't beat the price and quality, give it a try", 
    "review_date": "2013-04-04"
  }, 
  "IH1iOatR3UkGxuiZVD4Xqg": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron W.", 
    "review_text": "Seasons closed along with its next door establishment, which was a low-end Chinese place for mostly take-out. These places are now combined into space called Wasabi Bistro. The large windows in the front are great for both diners and passerbys.  The first time I went, I got the chirashi, my favorite sushi dish. Basically a bunch of sashimi over a bowl of rice. The sushi was all fresh and the sushi rice was tasty. As was the ginger and wasabi. Absent in the dish were pickles, though some spicy sprouts were there. The dish was $14, which is about on par with the other places in the area. I ordered miso soup, which did not come with the lunch special (it should.) The miso was good.  However, on another visit, I got the sushi nigiri combo. One of the snapper pieces was completely inedible. Chewy, scaley, unfresh tasting. Really so terrible that I have never gone back since. I have eaten a lot of sushi in my life and have never been served something that terrible.  Takara remains my favorite choice in the area.", 
    "review_date": "2012-09-24"
  }, 
  "TrbwKmTpndbBmKimehlX9g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anita C.", 
    "review_text": "A friend had invited me to dinner here and I was pleasantly surprised since I don't venture into this part of town often, but now I don't mind making the trek over for Wasabi Bistro.   They use fresh ingredients and you can tell they put a lot of attention in every aspect of their food, from quality and preparation, to presentation. I've tried something new each time and every dish has been impressive. My favorite has been the uni served on a spoon, gyutan izakaya, and baby lobster tail sushi. Their sashimi omakase is always fresh and in season.  Great place to grab dinner and drinks with friends. Tip: Ask for the fresh wasabi, it brings out a different taste compared to the regular paste and not all places have it.", 
    "review_date": "2015-01-18"
  }, 
  "hu7UAMONehtlpfnnBfbogg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marjorie B.", 
    "review_text": "Decided to come here for my lunch break and made it in time for happy hour 11:30-6:30  Love the ambiance and the sleek look of the bar My server was Serena and she's pretty amazing! Customer service was on point, all the staff were friendly Choice of music was great!  I ordered a tempura for appetizer, calamari, unagi roll with a large sake on the side. No major complaints, will be coming back for a dinner date next time!  Check out this spot if your in the Castro area :)", 
    "review_date": "2014-08-08"
  }, 
  "6-AA014-IT2FJjcEqJBZYg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ty T.", 
    "review_text": "19-October, Friday: I'll start this review with the bad points because this place is so inconsistent it is hard to place my finger on exactly why I feel so mixed, but basically here are my likes and dislikes.  CONS:  The interior feels like I stepped into the faux version of Donatella Versace's banquet hall: smelly alligator pleather upholstered on the booth seating, which is hugged by a long beveled wall of mirrors before it turns into an accent wall of more alligator pleather in the back with a flatscreen hung in the center. In the front room there are 2 dangly chandeliers that are quite ridiculously over the top, and a harsh transition to slated walls that were either made of mock-porcelain, or something resin coasted with a low-sheen to it.   -tuna poke: maybe a bit too much onion - rainbow roll: was frighteningly awful, the salmon and tuna tasted a bit rough in texture and the level of freshness was definitely questionable.   PROS: Despite the atrocity of overwhelming decadence that is the interior, the service is always friendly, prompt, overly polite, and overly apologetic. Both times I've been here they have been very proactive about taking orders too soon, without giving me time to first breathe while I am still perusing the menu in an effort to make the best of informed decisions.  However, in the same breath plates of pickled ginger, wasabi, and edamame immediately come out upon seating, along with tall tumblers of iced water.  --miso: fresh bits of tofu very firm, light on the sodium, and perfect for the cold weather. -spider roll: was nice and crisp -gyoza: were cooked very well and had with the perfect amount of seared crisp -walu nigiri: I was rather impressed with the excellent freshness, texture, and taste. -castro roll: had a subtle severity to it, as the slices of fresh jalapenos complimented the sweet sauce really well  MAS-O-MENOS: so-so -spring rolls: were descent  -hamachi nigiri: I've had much better  I would probably come back here exclusively for the things I had good experiences with, since this place is conveniently located to where I live. And there aren't much better options in the Castro.", 
    "review_date": "2012-10-25"
  }, 
  "Mm-HY6wMPyOJw1c_EUGrBw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Luffy L.", 
    "review_text": "Amazingly fresh and excellent service. The uni and toro are among the best in the city. They never seize to disappoint me. Owners are also very interactive and they will always \"ganbei\" with you", 
    "review_date": "2014-12-05"
  }, 
  "2su1nko0lzvQmmTGd8uBbw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike E.", 
    "review_text": "The food is good but the service was a bit slow.  This is are second time here and we really like the golden eye and the salmon and tuna tartare.  This time we also got the volcano roll which is our new favorite.", 
    "review_date": "2013-08-17"
  }, 
  "danyTP8bG7gU6fm1bGhk2A": {
    "user_rating": 5.0, 
    "user_location": "Belmont, CA", 
    "user_name": "K C.", 
    "review_text": "I've eaten here twice so far and I was happy (and full) both times.  I like how they removed the take-out section in the front.  Having the picture windows in the front of the restaurant are great.  It feels like you are sitting outside without having to deal with the outside noise and uncomfortable weather during cold periods.    My wife and I like to be surprised so many times we just ask the owner or manager for their best recommendations at that time.  Many times it's different because they will give us something that is fresh or in season.  There were a couple of times I asked for one of my typical sushi dishes and he would recommend something better.   It's kind of a team effort thing that we really aopreciate.  The food was great!  I like how creative some of their dishes are.  I don't really remember the names of the dishes because I just told the owner (Albert) to hook me up with some of the best stuff he can offer.  He did not disappoint us.  I just remember having various sushi and grilled dishes that I never had before and walked out of there totally stuffed and happy.  He actually comp'd me with a couple of dishes that were new and asked my opinion before adding it to the menu.  I did take photos of what I liked though so all I have to do is pull it up on my iPad and I'll get to re-experience the yummy dish I had before!    As Arnie S. would say ... \"I'LL BE BAACK!\"  :)  P.S.  They are the sister restaurant to Wasabi and Ginger on Van Ness and Vallejo streets.  Their food and service are very good too.  One of the things I like there is that they have FREE valet parking!", 
    "review_date": "2012-10-23"
  }, 
  "TkToy_vQXQmseminhFS8tw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Edmond T.", 
    "review_text": "Very fresh deluxe sashimi that came with great fresh cuts of a great variety of fishes.  Well worth the price!  The rainbow roll was also excellent!  Sat at the bar, service was friendly.  Fresh wasabi came with the deluxe sashimi.  Will go back.", 
    "review_date": "2014-04-12"
  }, 
  "plmzSOdhkz7CZRTQ6EVdGA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joanne F.", 
    "review_text": "Great Sushi and Sashami. I'm always looking for excellent quality Sashami and have found it here. Good service, nice ambiance and enjoyable Sake. I recommend coming here for a meal with 1 friend or several. I've been here for lunch and dinner and it's always the best.", 
    "review_date": "2014-11-27"
  }, 
  "4CtoDM8il03xdcWPx11aQw": {
    "user_rating": 1.0, 
    "user_location": "Inner Richmond, San Francisco, CA", 
    "user_name": "Jake S.", 
    "review_text": "I ordered the pork ramen and it was delivered cold and no noodles.  Haven't been back and won't go back.  Between my experience and a mile long list of horror stories from friends we'd much rather go elsewhere.", 
    "review_date": "2014-04-08"
  }, 
  "__05rytNjsye9MBhqB0DMA": {
    "user_rating": 3.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Marck N.", 
    "review_text": "After a leisurely day, my friends and I dined here for our first dinner of 2013.   We shared several plates and rolls.   Ordered were the beef robata, smoked salmon, akimo (monk liver fish), chicken karaage (not on menu), chicken teriyaki, pink lady roll, and several other rolls that I cannot remember.      Most of the food was OK in taste except for the pink lady roll.  The roll is served with some odd sauce over the salmon layer.   The sauce was not to my liking.    Service was slow that evening, though it wasn't really crowded. I would say it was a little over half capacity.  Our server though was very good, as she was attentive to what we ordered.  She provided an extra large salad and 4 miso soups for our (at the time) 1 plate order. And she also corrected the chicken karaage portion size, as she noticed they brought out an appetizer portion.", 
    "review_date": "2013-01-03"
  }, 
  "JC99U5y-KAchZIjBhf_DiQ": {
    "user_rating": 3.0, 
    "user_location": "Concord, CA", 
    "user_name": "Vanessa K.", 
    "review_text": "Food is good, but the price is HIGH.  I think you can find comparable sushi places in SF without paying this steep price. The amaebi (sweet shrimp) was really good, and the heads were fried perfectly.  Uni was uber fresh. Godzilla Roll (recommendation) had multiple layers and had a nice level of heat.", 
    "review_date": "2012-11-12"
  }, 
  "Q9OtX03w24Q5Rz0JuzgjRQ": {
    "user_rating": 5.0, 
    "user_location": "Nob Hill, San Francisco, CA", 
    "user_name": "Sue N.", 
    "review_text": "HIGHLY recommend!!!  A combination of freshness and the variety of foods, plus  excellent of services just make you can't wait to go back.  And best of all, it's very reasonable prices.  I extremely like the assortment of sashimi,  very very fresh!!!!!!", 
    "review_date": "2013-05-11"
  }, 
  "6Cy6d_NvjwpHBcNWgQdX3Q": {
    "user_rating": 5.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Polar B.", 
    "review_text": "You got to try this place. I was there the other day and ordered combo sashimi. Fish is fresh and unique. Chef's special sushi roll is very tasty.  Fried ice cream desert is yummy. The atmosphere is quiet and romantic.. I will go there with my friends again.", 
    "review_date": "2013-01-22"
  }, 
  "Ji7HfxXWCIPDmojkaEXjtw": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Aaron H.", 
    "review_text": "This is one of my favorite sushi joints in Castro.  Some of the freshest sashimi and sushi with great presentation too.  Gotta love the ambience which is complimented by great customer service. Five stars!", 
    "review_date": "2014-02-17"
  }, 
  "M4lq0s_MynRpQAhYbuMulg": {
    "user_rating": 4.0, 
    "user_location": "Edgewater Park, Bronx, NY", 
    "user_name": "Alex Dallas M.", 
    "review_text": "Went out on a suggestion to Castro and I will have to say that I did enjoy myself. We got hungry after a few beverages and decided to give Wasabi Bistro a try. I must say that it was pretty delicious. I love getting fresh sushi and rolls with good combos. Usually when I dont know exactly how a place will taste i order very slowly and simple things. As I get the food try it and like it, i'll go ahead and get riskier. I ordered:  Warm Saki and a large Sapporo- to get us started =]   Gyoza- Simple nothing out of the ordinary  Spicy Tuna- Was pretty good, was lacking spice but I just asked for a side of spicy mayo  Age Tofu- Very good. I love tofu so I was happy even with the amount!   Scallops wrapped in bacon- They were good but nothing from what they were... The bacon over powered them a bit  Godzilla Roll- fried miso tuna topped with spicy crab  In conclusion very good, great service and would definitely return", 
    "review_date": "2013-03-18"
  }, 
  "QT4FXurz3-7lKwrEfcbJEw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marga G.", 
    "review_text": "I've been here almost 10 times. It's open late. No attitude. Their sushi is the best in the Castro. I It wouldn't compare with the awesome sushi outside of this neighborhood however.  But the waitstaff is friendly and fast enough, including the manager who tries to greet everyone in a genuine way. It's big so there's usually no waiting.  I used to love Tokyo A GoGo and one of their sushi chefs works here. That's a good sign. And they give you a little bowl of edamame on the house. The decor is whacky which makes it feel unpretentious. And it looks pretty spotless.", 
    "review_date": "2012-12-14"
  }, 
  "wfHb6cGSSweF6XZYXw1XQA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lisa W.", 
    "review_text": "Awesome!!!  Great happy hour sushi rolls. Fish is really fresh and flavored are solid.", 
    "review_date": "2014-02-23"
  }, 
  "9xeH3DClbtijEFBZjqd6eg": {
    "user_rating": 2.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Annie S.", 
    "review_text": "Wellllllll. My girlfriend and I went in for lunch the other day and were pretty disappointed. Our California roll came out hot. It also had a Piece of plastic in it that I almost swallowed. One of the other rolls tastes literally like dirt and the sashimi just wasn't fresh. We are going to stick with sushi time down the street. Maybe the dinner is better?", 
    "review_date": "2014-09-13"
  }, 
  "ecWHyrQNu-S5HEfFSGRbyA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron K.", 
    "review_text": "Food was good, fish tasted fresh.  Nothing to complain about.", 
    "review_date": "2013-10-30"
  }, 
  "LWBaJtqpqgVl4ylzv-DmDA": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Irina K.", 
    "review_text": "Just amazing! Service, ambiance, food... Simply wow in my opinion!!! Definitely a must to try :)", 
    "review_date": "2012-12-28"
  }, 
  "tW6Znr0qZcrE9epALShffg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John N.", 
    "review_text": "I've now eaten here twice now, both times being amongst the best dining experiences of all time. Their sashimi is the freshest and the best cuts. The spicy tuna I had the night before last has left me for a hankering I will have to satisfy during each successive visit.  The help is exemplary. I left a rare 25% tip after my last visit. This restaurant is under new ownership and extensively remodeled. The place is now truly beautiful and most accommodating. It is in the same location as another sushi place that I frequented for many years. As much as I liked the previous establishment, there really is no comparison.  Do yourselves a huge favor and head out for the Wasabi Bistro for your next night out to eat!", 
    "review_date": "2012-11-14"
  }, 
  "okrKhL4uuC54elaaOB5oXg": {
    "user_rating": 5.0, 
    "user_location": "Ingleside, San Francisco, CA", 
    "user_name": "JLing L.", 
    "review_text": "I really like their sashimi, is really really fresh, and rolls are good too! I will come bak!", 
    "review_date": "2012-10-27"
  }, 
  "ycAyKJt9PMIEv1ydETDpEQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Duncan T.", 
    "review_text": "This place looks a lot nicer since they burned it down and got rid of that nasty Chinese takeaway that took up the shop front window. Now you have a nice big open space.  Only now all the walls are hard surfaces so the place is an echo chamber, making it impossible to hold a conversation without yelling at your partner.  And why does every restaurant in the Castro have to pretend to be a sports bar. Enough with the flat screens! I get they're cheap crowd-pleasers but go to The Mix if you want to watch the game.  And now for the main point. Service. Have these guys ever run a restaurant before? I ordered Tuna Sashimi, Salmon Sashimi and Agedashi Tofu and a glass of Sauvignon Blanc and my friend ordered California Rolls and a bottle of Sapporo. Nothing came as planned. Asahi Black came instead of Sapporo, while that was being sent back a random red wine came for me. Ok, with the drinks straightened out the food trickles in. \"Special Sashimi\" - a selection of 5 different fish came. sorry not ours. Then some rolls that looked like green hockey pucks (going with the sports theme?) came. Sent those back too. Then the Special Sashimi came back again. No takers? Then nothing for 20 minutes, our waiter studiously avoiding our stares.  We gave up at this point so I can't review the food. When we told the waiter we want to leave he just sighed and said \"I'll bring the check\".   Yet another disappointing restaurant experiment in the Castro.", 
    "review_date": "2012-09-30"
  }, 
  "nT3tLANzGy0a7DuB_GIQjA": {
    "user_rating": 3.0, 
    "user_location": "Madison, WI", 
    "user_name": "Rebecca L.", 
    "review_text": "Came in here for the happy hour with my boyfriend, and we got a dozen HH $1 oysters and the nigiri sampler. They brought out some free edemame and we munched on that while we waited for our food. The nigiri came out first; I think they let one of the apprentices cut the fish because some of the cuts were crooked. Not the prettiest sushi, but I guess you get what you pay for. The oysters were decent. Overall, not a bad happy hour, but nothing to go out of your way for.", 
    "review_date": "2013-01-04"
  }, 
  "HTD8SOsALckYWUmtAYA5Hw": {
    "user_rating": 5.0, 
    "user_location": "Claremont, CA", 
    "user_name": "Josh Y.", 
    "review_text": "My first time here and it's was such a great a experience. The fish was extremely fresh and my steak was delicious.  Sake was so mmmmmmm good. Albert the manager came by and said hi and he was more than happy to see us first timers here. The presentation of the food was amazing and I'm definitely coming back for sure. Happy birthday Joey!!!! ;-). Did I mention the fish was very fresh ;-)", 
    "review_date": "2014-08-28"
  }, 
  "brV0EwTAqFaDwn1fqP8hgw": {
    "user_rating": 1.0, 
    "user_location": "Boulder, CO", 
    "user_name": "otto h.", 
    "review_text": "When asked which of their fish were caught \"sustainably\", our server emphatically (and very confidently) responded \"all of them\".  To follow up, we asked if they served blue fin tuna, and our server proceeded \"oh YES, and it's delicious!\".    If you know anything about seafood sustainability, you know that the blue fin tuna industry is among the most egregious of all fisheries. Google it, and boycott this restaurant.  96% of the world's Blue Fin Tuna are gone already, and a full 90% of what's left are got before they have a chance to reproduce.     If you'd like your children to eat fish, boycott this and other restaurants like it.  If you're interested in learning more about the state of the worlds fish species, go visit the Monterey Bay Aquarium, which is at the forefront of knowledge on the topic.  PS. the food was great, the service good, and the prices reasonable for what you got.  If it weren't for this total disregard for the environment this place would have gotten 4 stars.", 
    "review_date": "2013-01-11"
  }
}