{
  "JFnDRosLPrK15eCiYjxK8Q": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Anton K.", 
    "review_text": "totally mediocre. had 2 beers and a burger. burger patty seemed to be that frozen crap from costco, I wouldn't advise it to anyone, beer selection was ok..bartender super slow. I wasn't sure whether its 2 or 3 stars.. its sunday night in soma, and the only benefit of this place is that its open.", 
    "review_date": "2013-11-24"
  }, 
  "o0SnJcLxIF5RqTFsX4MOuQ": {
    "user_rating": 5.0, 
    "user_location": "Houston, TX", 
    "user_name": "Kevin T.", 
    "review_text": "Love this place. I've been working in SF for the past year and staying here. Great staff, shout outs to Robert, Laurie, and Kellan. My totally amazing co-worker who is not on Yelp agrees. The food is typical pub fare, but coming here is like being in your own living room, so comfortable and friendly.  A great place to watch the game, enjoy a brew, and meet new friends.  The only negative thing I have to say is don't order the salmon.", 
    "review_date": "2013-02-04"
  }, 
  "FnmRCTxZRqkN1UJB7egHZg": {
    "user_rating": 4.0, 
    "user_location": "San Diego, CA", 
    "user_name": "Angela H.", 
    "review_text": "I wandered downstairs for a drink around 9:30 PM. I was extremely disappointed that there were only two other people at the bar (both were having beers), but the bartender was extremely friendly. I knew exactly what I wanted- the San Francisco Iced Tea for $12 (I had been staring at the specialty cocktail menu upstairs in my room all afternoon, and couldn't wait to try it!). The drink was absolutely DELICIOUS!!! The bartender was surprised at how quickly I drank the cocktail... various bartenders have marveled at how quickly I'm able to inhale the first couple of drinks and remain sitting upright in my seat (maybe it's a sign that I should slow down). I asked him for a suggestion (I don't like anything too sweet), and he made me an appletini. Also very tasty! After a couple of drinks though, I had to head out for the night because there wasn't much activity going on.  I will definitely come back to this bar the next time I'm in SF!", 
    "review_date": "2010-04-17"
  }, 
  "ChKHMb5xCCjO99vac3MhnQ": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Scott Y.", 
    "review_text": "I came here for a drink after work due to a recommendation from a friend and am quite pleased with what I found; a secret bar that is perfect for the after work drink / happy hour.  Recently remodeled and located in the Courtyard Marriott on 2nd street, Whispers is never too crowded and has a great vibe.  It's a great place to hang out after work, watch some sports, and have a beer or five.  I love it when I walk in and Laurie, Anton and the rest of the staff will run from behind the bar, hug me and parade me around the hotel lobby like Eli Manning after the Super Bowl until I beg to be let down 1 hour later.  I think they think I'm Jet Li, but I never disagree with them because they make great drinks and maybe I shouldn't have told them that my name was Jet Li.  Oh well.     Anyway, I digress.  It's weird to think that a Courtyard Marriott has a cool spot but this place is full of out of towners getting ready to paint the town red, stewardesses (for you guys out there) and really friendly staff.  There is a smoking patio and convenient bathroom access, which is a must when you are watching a shoot out between the 49ers and Cardinals.  I mean, you wouldn't want to miss a fumble or 5.  I will occassionally bring my laptop and work on the free wireless while sipping on a glass of wine trying to bring the silicon valley vibe to the north bay.    Apparently, a lot of sports stars hang out here too due to the proximity to the SBC ball park.  I came here during the Giants Alumni weekend for a drink and dinner and saw Kirk Rueter, Mark Gardner, and Rob Nenn hanging out.  It was cool to see those guys there but I couldn't tell if they were hanging with really unattractive groupies or their wives.  Anyway, the atmosphere here is quite chill.  Perfect for a group of 4 or more for happy hours.  The food is actually pretty good.   We will stop by occasionally to grab a drink before we go out sometime.  Only con, last call is at 11:45 p.m.", 
    "review_date": "2008-09-12"
  }, 
  "Qd5GyT45vcCydR2mM9dcmg": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Laurence W.", 
    "review_text": "Amazing.  It's true.    Whispers is a cheap hotel bar, and I mean that in the best sense of the term.  There isn't a mixologist in sight, nor even a waxed mustachio or pair of suspenders.  You won't even have to fight a crowd to get in the door and place your order.  It's not even dark and dreary.  It's just small groups of people comfortably chatting and sitting around slinging insanely cheap, adequately prepared well drinks that go down real easy.      If you're looking to meet people, this probably isn't the place.  If you're looking to talk to your friends over a drink or two, Whispers is a revelation.", 
    "review_date": "2013-02-20"
  }, 
  "6HfGx_gVu1IHFnPL66kAOQ": {
    "user_rating": 4.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Jaime L.", 
    "review_text": "I came here today for an early dinner.  My dining party and I were kind of in a rush and made sure our waitress was aware of this.  She was very accommodating and made sure we made our deadline of being out within 45 minutes.  I ordered the chicken quesadilla and it was delicious!  The chicken was oh so tender AND it came with yummy guacamole and pico de gallo.  I would definitely order this again.  The quesadilla was something like $11.  I was super naughty tonight because I ordered the sea salt fries appetizer on top of this (the quesadilla is also on the appetizer menu).  The special dipping sauce that came with the fries really made this appetizer divine.  The sauce was made of horseradish, aioli, and probably some other ingredients.  It went very well with the fries.  To counter all this grease that I ordered, I scooped some lettuce pieces from Cam S.'s chicken caesar salad, as well as some green beans from my kid sister.  The green beans were unique; each bean was cut in half and very flavorful.  The salad was good with delicious, freshly grated parmesan.  It probably could've done without half the amount of dressing.  Those poor lettuce pieces were drowning in salad dressing.  In sum, the food is tasty, but somewhat on the pricey side for what it is.  The service is so great and so speedy. I'm a fan!", 
    "review_date": "2010-04-04"
  }, 
  "fXn1STPwhd8KnVVt_dGPNA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Bob C.", 
    "review_text": "How did I not know that this place existed?  I may be adding an extra star as this place happens to be across the street from my place, but I'm glad I found this gem.  Beer, burgers, wings and TV's and a little peace and quiet.  Why is that so hard to find in this SOMA/FiDi corridor?  Well if you don't know, now you know.  Prices are little higher than usual due to the fact that its a hotel bar but if you're looking for a low key sports bar in the area, this is your spot.", 
    "review_date": "2013-09-11"
  }, 
  "adKonsQWY64vJYglPotH5Q": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Stefanie C.", 
    "review_text": "Business here is much like a whisper. It never seems to be busy, but that just means faster service for me! I'll come to the Courtyard Marriott to get work done sometimes, and the staff has a lot of ground to cover in terms of customers. They constantly patrol the actual bar area, the lounging area with tables next to the patio area, and then the patio area itself. They're all super sweet, and I've never had a problem with the service here.  As for the food, I love their sea salt fries with onion dip ($6). There is a reasonable amount of fries for that price, and their onion dip is pretty good. Interesting... but good. I have also had their caesar salad with chicken. The chicken does not taste very fresh, but the rest of it does! And they had a generous amount of dressing, which I appreciate. Overall good prices for hotel bar food, so it's totally getting some while you're here.", 
    "review_date": "2014-10-28"
  }, 
  "PntyZIbRFFfw65Cwd8X1Sg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shawn B.", 
    "review_text": "Had a not-so-nice experience with one of the bartenders here. He didn't seem to keen on the fact that people were paying with card that night. Weird.  Wouldn't recommend expecting to eat here. Lots of people moving around, so not easy to flag down someone to order food from.  Drinks were okay. Can get pretty loud after work-hours as people from the surrounding area and within the hotel come down for a drink.  There's a nice courtyard to chill at outside if you're not feeling the inside.", 
    "review_date": "2013-07-17"
  }, 
  "zgV0ZroIF956gw4cul8MHA": {
    "user_rating": 1.0, 
    "user_location": "Las Vegas, NV", 
    "user_name": "Elizabeth B.", 
    "review_text": "lame...who does not open until 4:40pm...hello?!?!? what about game days like today?!?!?!  this place has nasty food, management weird rude lady is a nightmare  I asked what time they open and she YELLED \"we don't open until 4:30pm\" when it is listed there on the sign at 4pm  our first night at hotel we wanted to watch the game and sat in the lounge area outside of bar, Asian guy with glasses rudely took our order, then 30+ mins later they bought out the food  my fish and chips were cold and greasy and fries were greasy and flaming hot, looked refried  hubby had a \"grilled cheese\" sandwich his fries were refried looking and his sandwich only nice quality was the bread roll, it gushed out white stringy cheese and yellow grease  neither of us ate our food and ordered another draft Anchor Steam then......  this blonde bartender that looked like she was posessed and just rolled out of bed came and slammed shut the cabinet the TV we were watching and gave us a dirty look  ok.......ummmmmmm  then a rude Asian lady came and asked us if we wanted another beer (ours were full, she just brought them) we said no thanks and she left........  sitting there another 20 mins later she came back with our check and literally tossed it on the table  it was 8pm and they do not close until 10 or 11pm.....  these people are a joke  the last night we stayed there I went down at about 9:30pm and walked up to the full bar and asked for a beer.......the azzhole said WE ARE CLOSED  so I turned on my foot and called him a lying azzhole under my breath......I guess his whole bar where all his friends because he was back to laughing and pouring beers for the full bar  personally I think everyone here can kiss my butt and the next time I stay here, we do frequent this $300-500 a night Marriott I will NEVER step foot into the place", 
    "review_date": "2012-10-15"
  }, 
  "0pb7fWD194iTqPMFAG5Oxg": {
    "user_rating": 4.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Paul C.", 
    "review_text": "Whispers is a really great hotel bar. They have fantastic beers on tap including Lagunitas \"Little Sumpin'.\" They also have Woodford Reserve, so double yum.  Sometimes it can get a bit crowded but you can take your beers and go in a zillion different areas. There's also some great outside seating.", 
    "review_date": "2012-04-23"
  }
}