{
  "sTW0gS1reTlPhrZYCDKH7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda C.", 
    "review_text": "Came here on a busy Thursday night with my mom for dinner. Busy because it was game three for the GSW playoffs game against the Clippers. Got seated and took awhile to get our menus but it was okay since we were watching the game. While we waited to get our food, we were offered free shots! Cool! So my mom had some apple cinnamon shot and I had the Jameson shot. Not a good idea before eating and on an empty stomach... But it made food taste that much better hah. I had the crab melt and I loved it! The tomato bisque that comes with it is a bit spaghetti sauce tasting  so I didn't like it much but the crab melt it's led with avocado and bacon, was bomb! I liked the salad that came with it in the side. We also ordered the sweet chili habenero wings which was a bit spicy but a good spicy! My mom has the tri-tip steak which was a little overcooked for me but my mom liked it. The fries were typical and a side of salad was yummy! Definitely wanna come back for the crab melt since I live just down the block :)", 
    "review_date": "2014-04-25"
  }, 
  "CWU7Bkz4TSz-mpVSLDzrbQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Teryll H.", 
    "review_text": "The totchos were gluttonous and amazing, but the service and the ambience weren't all that great.", 
    "review_date": "2013-06-14"
  }, 
  "c8FOqDRhtL7q_YsQio6bog": {
    "user_rating": 2.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Kevin B.", 
    "review_text": "Gosh, I truly hate writing negative reviews. Deep down, I want every business to be a winner and succeed &amp; shine &amp; make buckets of money. So I'm truly sorry to be giving Wild Hare just 2-stars after my recent visit.   This spot used to be Solstice Lounge back when I lived in the neighborhood. A year or so ago, they sold it and transformed it in to a more sports-friendly/tater-tot-loving restaurant/bar. I came in a few times before I moved out of the hood, and I thought the place was a reasonable addition to the neighborhood.  Some friends and I came here Sunday evening after catching a matinee down the street (@ the Vogue Theatre). At 5:30pm, it was the only nearby bar open for biz. Immediately upon entry, you could tell something wasn't right with this place. There was no one at the hostess stand to greet us. We sat ourselves at a communal table, only to gradually realize that there were no servers working the floor. The other patrons were drunk and loud football fans who just kept shouting obscenities at the TV.  We finally saddled up at the bar to order drinks. It took a little bit to catch the bartenders' attention. The young kids working the bar seemed busy just hanging out with each other and oblivious to their customers. My friends and I finally ordered a few beers and their signature Wild Hare Cocktail and some sort of Fernet concoction. Now let's get one thing clear - I'm a pretty open-minded cocktail guy. But the beverages these guys served up were downright horrible - almost undrinkable. My friend (who's a liquor rep for a notable spirit company) gave up on her Fernet About It libation after 2 sips. My Wild Hare libation tasted like it was infused with gasoline (no joke).   The entire atmosphere was so uninviting and the drinks were so dismal, we finally decided to just cut our losses and leave. I'm really sorry to say these negative things, but Wild Hare really let us down. It was like the grown-ups left the house and left the kids in charge. This place needs to grow up a little before I return any time soon.", 
    "review_date": "2014-12-04"
  }, 
  "FRSoGLPQI16pus03avyaSA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gill C.", 
    "review_text": "It has taken me awhile to get over that Wild Hare is no longer Solstice. After a mourning period, I've accepted that my one of my fav hood spots is gone forever, and have slowly moved on. On several occasions, I've met with my support group to  reminisce about our good ole fun times at Solstice, and attempting to embrace the changes made at Wild Hare.  As soon as I saw truffle on the menu, I was a goner. Nothing else on the menu mattered to me. I'm a huge fan of truffle and typically order anything truffle if on the menu. How excited was I to find out that there was truffle popcorn, truffle fries, and truffle tater tots! Truffle Heaven!   Of my Wild Hare outings, here's what I've ordered:  - Crab Melt with Bacon, Tomato and Avocado - tasty gooey cheese and ample amounts of crab! Make sure you have at least 2 napkins to eat this bad boy!  - Tater Tots - Must order and add truffle (of course)! Perfect tots with crispness on the outside and tato goodness on the inside. FYI, with tots and fries, you can order with crab or a la wild hare (cheese curds and gravy, as the Canadians call \"poutine\" (eh?)  -Truffle Popcorn - Must order, and super fresh popcorn with truffle oil on top. Greasy fingers (and napkin required). watch out as I could finish it all in one sitting, so act quickly if you want to try it!  Decent selection of wine, beer and specialty cocktails. Check out Happy Hour specials!  Vibe here is fun, lively, and can get loud. This is a popular hang out group, as well as a date spot! I literally saw a couple go from shaking hands upon meeting to swallowing each others tongues by the end of the meal. It can happen, so you've been warned, as it could dampen your Wild Hare experience.  Will always remember you Solstice, but I'm embracing the change. Change can be good! Cheers to you, Wild Hare!", 
    "review_date": "2013-10-09"
  }, 
  "plecDucUZ7Qa7m86TZpgCw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Genevieve L.", 
    "review_text": "From the makers of Bullit, Dr. Teeth, Soda Popinski's, and the like...here's one more place with Tatchos!  Wild Hare is a great place especially since there isn't a lot of places like it in the area. I've come here for all the points: -Brunch: great bloody's, and pancake batter-dipped sausage with syrup...AMAZING -Happy Hour: Fun, good apps, can get a little loud. Not great for a first date (oops) -Late night: good place to catch up. Get a seat, grab a drink, get drunk  Not awful, not mind blowing. I prefer Soda and Dr. Teeth, but hey, if you're on California and Divis, there's nothing else and this place will do just fine.", 
    "review_date": "2014-04-29"
  }, 
  "AGSaPH_x8FNfojjmDdFb5w": {
    "user_rating": 5.0, 
    "user_location": "Manhattan, NY", 
    "user_name": "Patrick B.", 
    "review_text": "Awesome service and Tuesday is $20 for $20 tacos (the veggie tacos were awesome!) and $20 for a pitcher of margaritas.  Now that Tortilla Heights is closed this is a great spot to get your Mexican fix in lower Pac Heights.", 
    "review_date": "2014-04-26"
  }, 
  "XobVOrLM7CmA250pKfVTpg": {
    "user_rating": 4.0, 
    "user_location": "Sonoma, CA", 
    "user_name": "Jack C.", 
    "review_text": "Lord Tariq and Peter Gunz's \"Deja Vu\" came on here; that deserves four stars right there.  Dunn.", 
    "review_date": "2013-05-17"
  }, 
  "CgKb22edkZoIqbOrDFnwtQ": {
    "user_rating": 4.0, 
    "user_location": "Albany, NY", 
    "user_name": "Regina D.", 
    "review_text": "I'm loving this bar - it's spacious, great for groups, great food (tactatos... sliders...), amazingly affordable, the waitresses come exactly as I'm thinking of ordering another round, and the music is a great mix of rock/indie/pop. Can't wait to come back!!", 
    "review_date": "2013-07-19"
  }, 
  "BpQfXnk5flVJ43UvKkdM2g": {
    "user_rating": 3.0, 
    "user_location": "River Falls, WI", 
    "user_name": "Prescott B.", 
    "review_text": "Came here for a late night drink and appetizer with my son. An OK neighborhood bar, very busy due to social specials / dating night or some such, out of the beer on tap we wanted, ok selection but at least it was close.", 
    "review_date": "2014-01-25"
  }, 
  "IxQrE6BuM_QKnjSq6kVglg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lois W.", 
    "review_text": "Came here for morning games and brunch yesterday. The experience left us feeling like they should rethink the brunch menu...  First of all, let me say the service was hit and miss. The first waitress we had was ok. A group came in after us, but somehow we were asked to move -- not that they came afterwards anyways. Once we migrated to the bar, the bartenders were fun and attentive. Our main bartender changed the tv channel to our game too, excellent.  Food on the other hand, was a different story. The menu looked great, but what came out of the kitchen was not up to expectations. I ordered the French toast and my bf ordered the corn beef hash. My plate contained 2 pieces of french toast, and my bf's plate contained corned beef mash -- pics uploaded, you can be the judge.  We have heard great things about drinks and bar bites here, but will definitely think twice before coming to brunch again.", 
    "review_date": "2014-11-17"
  }, 
  "nprR61-yZvMS1vcgoXBucw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Scott E.", 
    "review_text": "Ended up going here without realizing that it was no longer Solstice.  The food is American low-brow done with medium- to high-brow twist, which can be fun.  I'll miss Solstice, but Wild Hare is an interesting replacement.  I can't get too excited about the food, and I feel the decor took a step back, but it's still a solid location to go from time to time.", 
    "review_date": "2014-08-03"
  }, 
  "_h2wj0kTNV6mu19VZYOm0w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elliot E.", 
    "review_text": "There's a lot to like about Wild Hare: upscale bar snacks, Fernet and Jameson on tap, a solid list of spirits, and a friendly group of bartenders. They removed the heavy curtains from the windows and generally made the \"restaurant\" part of the floor into a bunch of high bar tables. The atmosphere is markedly different and more bar-like now, which is a good thing because something needed to change when Solstice closed. Beer is unreasonably expensive, at $6 a pint, though some of the upper end liquor is quite reasonably priced. Unfortunately, the crowd now seems to be a healthy mix of woo woo girls and AMF pounding bros. It's like you're in a National Geographic documentary about the post-Hellenic collegiate experience. But you can't really control who comes to your establishment, so I can't fault them for that. This bar has good bones, no doubt about it, but Saturday nights are a shitshow. I'll stick to weeknights.", 
    "review_date": "2013-05-08"
  }, 
  "swocJWD8R1iH20-lveXh0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Rosalind S.", 
    "review_text": "I just got home from HH at the Wild Hare so my experience there is still fresh in my memory!  I was weary at first because of all the negative reviews I read but then again these yelpers could have been die hard Solstice patrons.   My coworkers and I got there right at 5pm when they opened the door.  We were greeted immediately and were given menus.  We ordered the Day Breaker cocktail which was delicious with muddled strawberries, and the Seek and Destroy which pretty much was a mojito.  We also got two orders or the garlic crab tater tots which were a huge hit with our group.  Another ordered the burger with tater tots but it came out with fries, oh well.  And one more wrap with fries.  No comment on the wrap or burger but they looked good.  Due to it's close proximity to work this is officially our go to HH spot.  The waitresses were amazing and came by exactly when we needed them to.  They were also VERY accommodating when we tried to split the bill.", 
    "review_date": "2013-07-03"
  }, 
  "0IPrA1ydX_LNVGQQCiaPCw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christopher W.", 
    "review_text": "If for some unfortunate reason you end up here, remember the rule of 1 hour. It will take 1 hour to receive your food, nearly 1 \"bottomless\" mimosa poured per hour and 1 hour to receive your bill after you ask for it.", 
    "review_date": "2014-01-04"
  }, 
  "kP4Zt83mr4psCcsONMNiAg": {
    "user_rating": 4.0, 
    "user_location": "Dixon, CA", 
    "user_name": "Scott B.", 
    "review_text": "Great food...used a Living Social deal. Two brunch entrée and bottomless spritzers with two shots of Fireball. Had dungeness scramble and it was delicious. Server was Claire and she was a treat too!", 
    "review_date": "2014-01-19"
  }, 
  "RcRbs6qOmfYoVdtbtrJZgQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "diane n.", 
    "review_text": "Unfortunate brunch. Too loud - music is blaring. I literally put war plugs in. Order wrong and mimosas mostly champagne which I'm sure someone was happy about but not me. The stuffed French toast was not. It was a French toast sandwich with some marscapone and strawberries. Oh well. Won't come back.", 
    "review_date": "2014-02-09"
  }, 
  "_wEJj16t2qG39a3679jgXQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren W.", 
    "review_text": "This place was awesome! Me and a group of 5 friends got there around 12:30 and the place was packed. Only had to wait for a table for about 40 minutes which wasn't too bad. We had the Living Social deal and our waitress was super chill about it.  The food was great, the table shared the Totchos and I ordered the veggie scramble. The mimosas were flowing and the service was awesome... I will definitely be back!", 
    "review_date": "2014-03-02"
  }, 
  "cX-AD3Ul6CaSLU3T1Pe4TQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emilia G.", 
    "review_text": "Today was the third time we visit.  Drinks were pretty good and reasonably priced.   The food was great and reasonable as well.  One of the times we came it was Taco Tuesday and they were the best ever, and I am Mexican from the D.F.!  Tonight I tried their sliders!  The best little buns ever.  Great burger and you can ask for pastrami.  I loooooooooved the pastrami and their sauerkraut was was delish.  You also get cheese.  They were the perfect little bites.  I also ordered plain fries.  They were perfect!  You have to try it~  Just be patient with the staff...also they do not have a n y t h i n g sweet.  dairy free.", 
    "review_date": "2014-09-26"
  }, 
  "nbfyMmgqnxXIp7EDqTmkqw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kajal G.", 
    "review_text": "Came here with a living social deal and it was one of the best brunch deals I have ever used. The deal was $25 for two brunch entrees, bottomless sparkling spritzers and two shots of fireball. Our bill was $70 and to only pay $25 was insane so we tipped well.  This places is a seating free for all so come early or be prepared to stalk tables as they finish up their brunch for a place to sit. We were lucky there were two seats at the bar.  The spritzer menu included (among others) a blueberry basil one and a watermelon lime one. Both were delicious and truely bottomless. We had maybe 9 each while watching the Niners game. We tried mixing them together but they weren't as good. There was also an Aperol drink but that was a little too aperol-y for me so I only ordered it once. We ordered the Dungeness Scramble which had a chipotle aioli and was really hardy and scrumptious. We also had a burger with a fried egg on top and truffled popcorn on the side. Unfortunately, they seem to have forgotten the truffle on the popcorn, but it was still good. Then of course, fireball shots to end the meal.  -On Tuesdays they do $2 tacos and $20 margarita bowls -There's four tvs in the main room and each was showing a different game. Warning: Apparently this is a Broncos bar as they changed the channel on the TV we were closest to from the Niners game to the Broncos game. It was weird. -Somewhat of an Alice in Wonderland themed bar, but it could be more \"themed\" in my opinion.", 
    "review_date": "2013-12-01"
  }, 
  "uzDXeLYST2xx-ZI_sGfRzw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren F.", 
    "review_text": "I purchased a LivingSocial deal - two brunch entrees, two bottomless mimosas, two fireball shots.  It was pouring rain and my friend and I waited an hour and a half to be seated (started waiting at 10:50am). Because they have bottomless mimosas and mostly large tables, it's a long wait for a table for two. I suspect it would've only been an hour, HAD THEY NOT CROSSED OFF OUR NAME ACCIDENTALLY. The only reason we knew this was because we checked with the host to see how many people were in front of us. This place just gets too crowded on the weekends and they're not organized enough.  The food was good, but not great. We had the french toast (small portion), the crab scramble (good crab flavor), and the tatter tots (delicious!). The elderflower and watermelon mimosas were okay.   I'm not sure how this place is during other times of the week, but this place is loud during weekend brunch, with large parties of drunk people and pumping music.  The food wasn't disappointing, but it was definitely not worth the wait in the rain (or without the LS deal).", 
    "review_date": "2014-04-02"
  }, 
  "sFFdPjsKWMfZA0FbAK9pEw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren S.", 
    "review_text": "Who's idea was it to decorate this shit like your grandmother's house at Christmas? Seriously, green and red/burgundy striped walls? And minimal old-timey black and white pictures? It's like drinking in Urban Outfitters. This place replaced Solstice which was pretty decent and dare I say, sexual. It had couches, and good dark lighting, good food and most importantly wasn't filled with assholes. Who's idea was it to bring the Marina to Divisadero I mean when I want to get slutty I don't do that in my own neighborhood, it's Wednesday for christ sake.  I just had the sudden terrifying realization that I don't like this place because I'm a boring prude, mostly because I am watching Master Chef and can hear my neighbors upstairs having sex and literally my first thought was 'who is having sex while Master Chef is on??' and then I got sad for me.  Oh also when I was here I was sitting at the bar, looking cute and shit with my new weave clipped in real tight, this wasted dude looked at me and said he was going to eat me or something AND PROCEEDED TO CHEW MY WEAVE and I was like nooooooo and my friend PBC was laughing her ass off and being absolutely no help.", 
    "review_date": "2013-06-12"
  }, 
  "Vkj42md-5O3VoOD9pBg6Sw": {
    "user_rating": 3.0, 
    "user_location": "Redondo Beach, CA", 
    "user_name": "Rick S.", 
    "review_text": "Wild Hare is a decent place, which I consider \"Bar Food\" in a bar atmosphere with a slightly more diverse menu than a typical dive bar, but is more expensive than going to a standard restaurant where you get better service (not that the service here was bad, but it's bar type service), ambiance and an actual dining experience, as well as a more complete meal (and more bang for your buck too).  So, if you're looking to drink and eat, where alcohol is the foreground than this might be a good spot for you.  If you're looking to eat and drink, where the food has higher importance, you might do some research.  The music was a tad loud for conversation given there was no dance floor.  The ambiance and lighting was a tad dark, and dining seats a bit cramped.  They seem to specialize or have a claim to fame with their \"Tater Tots\", which I know from living in Los Angeles is trendy hipster white trash comfort food cuisine that is en vogue when a restaurant just adds cheese wiz and other things to dress it up and charge more than the $3 it's actually worth.  They're not bad, but in my opinion, nothing special you couldn't do at home and maybe even do better and cheaper.  The other dishes were so-so.  The fried chicken in a bucket were more like small pheasant or game hen sized pieces; the Lettuce Cups were not really cups more than a fist full of lettuce hard to use as cups; so it's pretty clear they're not (yet) committed to making this more than a hipster bar that serves overpriced food with fancy names (good marketing), but without a lot of substance.  I think they can definitely improve to strive for a higher standard of excellence in many areas, so this can be a diamond in the rough spot looking to shine and sparkle in the future.   The service was friendly and somewhat attentive as one sexy barmaid can be while servicing the entire restaurant of patrons and juggling multiple tables.  So, she deserves credit.  Oddly, they have bathrooms located up steep stairs, which in a bar, with drinking, spills and darkness is a recipe for a future disaster and accident waiting to happen.  I also heard the bathrooms were kept in a little less than to be desired condition.  Parking in the area is of course on par with what to expect in San Francisco, if you know how to parallel park and don't mind walking it's not that tough to find legal street parking.", 
    "review_date": "2013-05-21"
  }, 
  "4c2RYnS2mdDSMwyY9xWBaQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julia P.", 
    "review_text": "A reincarnation of the previous Solstice bar, this place has the same feel and essentially the same feel. It's as if someone took a bar and renamed it for marketing purposes...oh wait that probably IS what happened here.  I've been here a few times - the fried and greasy bar food is always decent. They've got some good sliders, potato wedges, nachos, and awesome wings. They've got what seems to be a full bar too so you get can your Irish Car Bomb on on 3/17.", 
    "review_date": "2014-05-14"
  }, 
  "wgi7oSjVRChj0cGgWiyZrQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sara J.", 
    "review_text": "I booked my boyfriend's 30th birthday party here after searching other venues for weeks.  I highly recommend hosting an event in the semi-private Peacock Room. It was the best bargain in town (no rental fee!), they allowed outside cupcakes, provided exceptional service (thank you, Olivia!), accommodated our large crowd, and food/drinks were great. I'm still getting compliments on the great party, and it was the least stressful event I've ever thrown thanks to Olivia and the awesome staff.", 
    "review_date": "2013-07-16"
  }, 
  "OHG8Vsy6k1z2LtdqBS1Xzw": {
    "user_rating": 1.0, 
    "user_location": "Saratoga, CA", 
    "user_name": "Mark N.", 
    "review_text": "I have never, in my life, felt so disrespected. While this place might be convenient for many reasons, there are so many other bars that I and my friends would rather attend just to not let this place continue the type of discourse they presented to us.", 
    "review_date": "2013-10-12"
  }, 
  "Ow_oHwqaBBRuUAiNrL8rRw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Susie S.", 
    "review_text": "Arrived there on a Friday afternoon 5:30 and the place was jumping. So crowded and loud. I guess everyone took off early from work that Friday. We had not problem securing a table.  We ordered food, and the sandwiches are big and tasty. I had the Pastrami and I took a Crab Sandwich to go for my Husband and he wolfed that down. It didn't hurt that the bar back Chris looked liked Ryan Gosling.  Lots of people just hanging and having a great time, I will go back and see what its like on a different day.  Check it out.", 
    "review_date": "2013-05-06"
  }, 
  "fC5qwh1Pm1mMFl2toUz6sw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie R.", 
    "review_text": "My visit to Wild Hare was a little bit of a rollercoaster, all made better by the amazing new friends made at one of the community tables.  To be fair, I did come to Wild Hare for brunch on a LivingSocial ticket so to speak, and just about everyone else in San Francisco had purchased the same deal, so finding a table was a nightmare!  Tip for you all:  the servers or bartenders will NOT seat you, all seating is first come, first served.  Luckily, I had a rather crafty friend in tow - we made some arrangements with other patrons getting ready to leave to plot our way to food heaven.  Like I said, it was VERY busy, but when I order bottomless mimosas, I really don't want to see the bottom of my glass.  Also, the servers brought me the wrong order 4 (count them, 1, 2, 3, 4) times in a row.    When my food arrived (eggs benny), it was DELICIOUS and my friend's crab scramble was divine as well.  Our server was very gracious and brought us a couple rounds of shots on the house since she felt bad for our sometimes-empty mimosas and wrong orders.  Overall, I LOVED the food and the excellent drinks.  I will come back, but maybe on a weekday next time!", 
    "review_date": "2013-12-10"
  }, 
  "2rjI5rXwoAcLKOii7tT49A": {
    "user_rating": 2.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Ehren H.", 
    "review_text": "Came in by myself on sunday morning to have a bite to eat. I wasnt greet or acknowledged for the first 10 min after i walked in. I found a place to sit by the window and waited a other 10 min for the server to approach me. She seen me when i first sat down but never came over. Finally i made eye contact and about 5 min layer she came by to take my order. Took about 15 min to get my food. Ordered the hash plate, and it was good but it was sittin in a pool of oil. After she dropped my check it took 10 minutes to pick my credit card. Dissapointed and wont come back.", 
    "review_date": "2014-08-10"
  }, 
  "S-pogcHooYAxJl51ZC5l6w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shvonne A.", 
    "review_text": "Super impressed with how good the service was given how many people were there. Loud and busy but our table was not neglected or forgotten at All. Thursdays : twenty bucks for surf and turf including wine. Yay for steak!", 
    "review_date": "2014-01-30"
  }, 
  "3o3UmnVJ-F0uX_w_1GC3Mg": {
    "user_rating": 3.0, 
    "user_location": "Wailuku, HI", 
    "user_name": "Maria C.", 
    "review_text": "My friend &amp; I got here at about 1130 on a Saturday and right when we walked in the music was blaring &amp; the place was packed with people. We stood at the door awkwardly for about 5 minutes &amp; no one greeted us.  Thinking maybe we could just sit anywhere, I walked around &amp; there were no seats/tables available.  Finally found some seats 5-10 minutes later &amp; put in our order...  We got: - Strawberry &amp; blueberry marscapone stuffed french toast - Dungeness Scramble - Mimosa (bottomless spritz) - Watermelon &amp; Lime  (bottomless spritz)  Honestly, we weren't really impressed at all with the food. The french toast was more like a sandwich &amp; dry. You could barely taste any crab in the scramble. The drinks/spritz were ok &amp; they're bottomless; great option if you're with a bunch of friends.  Got a deal from LivingSocial &amp; I'm glad I didn't pay any more than that.  Seemed to serve more of a college crowd &amp; everyone was trying to talk over the loud music. Definitely not the place to be if you're looking for a quiet place to have a meal.", 
    "review_date": "2014-02-16"
  }, 
  "sTZwwAUY18o8N4mACC6Cxg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marc C.", 
    "review_text": "Thought I would give this place a second try after getting ice cold tater tots with my burger last time.  Bad idea.  Went on a Sunday night, not super busy.  Sat at a table for 10 minutes without anyone taking my order.  The server must have walked by me 5 times and never stopped to take my order.  Stay away from this place!", 
    "review_date": "2014-05-11"
  }, 
  "yspziN93UZr17Ks5BgxYXQ": {
    "user_rating": 5.0, 
    "user_location": "San Mateo, CA", 
    "user_name": "Ashley N.", 
    "review_text": "Great cocktails, especially The Combover (kind of like a cucumber mojito). The food is exactly what you want when you're at a bar or watching a game on one of the many TVs. The service is awesome and everyone that works there has always been super cool. Sold! They have big punch bowls to drink with bigger groups and good food specials on Tuesday (20 tacos, $20) and Thursday ($20 - filet mignon, shrimp, fries, and a beer).", 
    "review_date": "2013-11-09"
  }, 
  "0PcgmRf0HkG4QuuDCyj8bw": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Aditi A.", 
    "review_text": "Really good spot for happy hour in the area (we were heading to Lion Pub but stopped here because it looked airy and uncrowded). The girl bartenders were sprightly and fun, dude 'tenders on the stank side. Satisfactory cocktails but nothing to write home about. I would come back just for the fresh air and HH prices, but otherwise there's nothing particularly special about Wild Hare.", 
    "review_date": "2013-10-08"
  }, 
  "ZNpDFb2t1l8Asn2-0ZDm7A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gregg W.", 
    "review_text": "Had Sunday Brunch, which was my first experience at Wild Hare, and it was awesome.  Got a Blonde Bombshell (which was great) and a crab/egg dish.  My wife and I were really impressed with the food, which is saying something given how often we eat out in the neighborhood.  Glad they took over this local spot and look forward to visiting again.", 
    "review_date": "2013-07-09"
  }, 
  "Zv9Ha6OkYLLoq3kCn2b2jw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mary L.", 
    "review_text": "Food was ok, but service was not.  Nice young woman was our server, and we were a bit demanding (in a polite way) in the beginning of our service, so we ended up getting almost no service at the end.  Problems began with a warmish bottle of champagne and dirty wine glasses.  The server took my husband's dirty wine glass with lipstick smears on the rim, and came back with the same glass that was mostly cleaned and also with the same warm champagne that was in it in the first place!  We had to ask her for another clean glass with fresh champagne.  Due to this fiasco I stupidly decided to keep my glass when I later found dirt stuck on the outside bottom of it. We became really paranoid when I lifted a fork from the container in the middle of the table and the handle was gooey, Perhaps our server is inexperienced, but this restaurant really needs some quality control in terms of cleanliness.", 
    "review_date": "2014-05-11"
  }, 
  "wNnP7UGBC8KIzDCE7zsJMw": {
    "user_rating": 3.0, 
    "user_location": "Rockville, MD", 
    "user_name": "Caribina A.", 
    "review_text": "Did the Living Social deal and came for brunch. This is a seat yourself type of place, so find a table and stalk it!! The food was alright. We started off with the tatchos, I had the dungeness scramble with garlic potatoes, and my friend had the veggie scramble. We did the bottomless mimosas and the fireball shot. I'd prefer that we just had our own carafe in front of us instead of having to wait at times, but whatever. Also, our waitress just assumed we wanted a certain flavor, and seemed annoyed when i asked her for the other options for our next drink. I've had better...", 
    "review_date": "2013-12-28"
  }, 
  "0yHBTgFQIKWnqjCAiuNRAA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John R.", 
    "review_text": "Solstice was one of my favorite bars, but I'm not so much a fan of Wild Hare.  The renovation itself is good. I like how they've opened up the space, and especially like that they kept the fantastic wooden bar.  The food is meh, in common with the other establishments these folks own. The signature burger-in-grilled-cheese is a total joke. It's far too big a meal (about 7 times what you should be eating for dinner), difficult to eat, and not tasty enough to justify the serious excess involved. Other appetizers were reminiscent of Solstice but a pale shadow of their former excellence.  Drinks: the namesake Wild Hare ale is actually pretty good. Others reported their were \"ok\". Compared to other places in the Bay Area, they serve a notably limited selection of local beers - just the really big brewers and their own brand.  Service: Appalling, just like all their other locations. Staff having long chats while we wait for drink order taking, about 10 minutes to get drinks in an unpacked bar, about 25 minutes to get food, served luke warm.  People: If it's not prime-time, it's a nice crowd. Other times: smells worse than Harry's Bar (man-BO times 100), and at least one person is going WOOO at all times. Unfortunately, that's the crowd this place is aimed at.  I'll probably come back again to see if they've tuned things up along the way and give them a second chance, at least.", 
    "review_date": "2013-05-03"
  }, 
  "JKIkdVqAJLEXTq92gF98bA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike L.", 
    "review_text": "A few months ago, I wrote in my review for Stock in Trade that I've seen bottomless mimosas either be a great start to the day, or a great way to end it prematurely.  On this occasion though, it was BOTH.  While I had a great time, Voldemort (aka she-who-must-not-be-named for her sake, as well as mine) just wanted to go back to bed...  Things actually started out well enough, with our planned reunion happily coinciding with the last day of Wild Hare's Living Social deal (two entrées, two shots of Fireball whiskey, and bottomless mimosas).  However, thanks to our fellow procrastinators, the wait for a table was almost two hours!  At least we were able to start on the mimosas while we waited (for better or worse...).  -- TOTCHOS...$10 (<a href=\"http://www.yelp.com/biz_photos/wild-hare-san-francisco?select=MAquFxxStipfCcBrY5mWWQ#qc8-DfdMCAaVFKqL7QHSDg\">yelp.com/biz_photos/wild…</a>) Tater tots served like nachos.  Not much else to it, but what's not to like?  The tots were really crispy and made for an awesome bar snack.  While I wish they had the Dungeness crab tots on menu instead, I'd definitely get these again.  -- THE BURGER served with Farm Cheddar (choice), Butter Lettuce, Tomatoes, and Pickles...$9.50 (<a href=\"http://www.yelp.com/biz_photos/wild-hare-san-francisco?select=qc8-DfdMCAaVFKqL7QHSDg#c--4Bz030-4iAA2rNT937Q\">yelp.com/biz_photos/wild…</a>) Even though the LS deal covered for as many condiments as we wanted, we only added Bacon (+$2), Avocado (+$2), and a side salad (+$3).  For the most part, the burger was fine but unremarkable.  The bun was dry/burnt and while the patty was cooked nicely, it didn't have a ton of flavor without the cheese, bacon, and avocado.  Given the large headstart we had on the mimosas, Voldemort was already starting to fade when our food arrived.  By the time we got our shots of Fireball, she was done (we gave them to the girls sitting next to us).  Can't help but wonder how much easier it would have been if Harry Potter only had a carafe or two of mimosas!  Although I wouldn't mind coming back for the Totchos or to try the Dungeness Crab Tots, I doubt I'd come back for the mimosas without a deal.  I've seen it busy here regardless of the weekend and they don't take small party reservations.  Still, I can't say I had a bad time, even with the wait.  Now Voldemort, on the other hand...I have't talked to her in weeks, but I wouldn't be surprised if she's still hungover.", 
    "review_date": "2014-04-16"
  }, 
  "d8p8vcumg3rlRtKpRPIBow": {
    "user_rating": 2.0, 
    "user_location": "Studio City, CA", 
    "user_name": "Andrea C.", 
    "review_text": "The best experience here was the server by far! She was very helpful. I was not impressed with the food 1 bit. I possible chose the wrong dish. Shared a Caesar salad that was just ok.   Everything sounded reading my dish on menu, cilantro mango shrimp.   Not at all what I expected once it arrived.  Asking the server recommendations she said that's the dish she ordered for herself. So, I was in...  Chunks of mangos and avocado with the tiniest shrimp I've ever seen.   Not flavorful at all and highly salty. Highly disappointed as this was my 1st stop in San Fran hadn't eaten all day and this was my experience. I literally probably could have eaten dirt at that point.  Pricy, maybe go there for the bar but the food didn't do it for me.  On top of it, I thought I was in Woodstock this evening we were enveloped with pot stench as the door was open while everyone are. Once we left it continued happening in the front of establishment.   Literally we were immersed in a pot as we exit the place!!   Damn smoke your weed at home people.", 
    "review_date": "2014-04-30"
  }, 
  "vNasIeIJzFQT3c2rleSJRA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yum N.", 
    "review_text": "I've been here 2 or 3 times since this place changed over from being Solstice. Aside from changing the menu (a little) and removing the bar in the small room to the left of the bar, I am not sure what exactly is different. It's still an average place to grab a drink with friends before going out for the evening.  As the three stars would suggest.... Meh.", 
    "review_date": "2013-07-30"
  }, 
  "wTMqZ2jxgw5WUOGuUaLZ8w": {
    "user_rating": 4.0, 
    "user_location": "Sonoma, CA", 
    "user_name": "Tyler B.", 
    "review_text": "Great tater tots and a nice selection of local beers.   I met with a friend here for some beers after work.  Waitresses were very friendly and service was excellent. The toter tots were delicious.  I definitely want to come back for more!", 
    "review_date": "2013-05-14"
  }, 
  "d-O0G6Rspr9NJeZRudK5tQ": {
    "user_rating": 4.0, 
    "user_location": "Inner Richmond, San Francisco, CA", 
    "user_name": "H M.", 
    "review_text": "This place is great. Awesome drinks, excellent bar snacks and food (It's all about the homemade corn dogs), and a great atmosphere.   Even though it's a stones throw from Lion Pub, the clientele at Wild Hare is way more varied than the average Marina-ite who wandered too far from their usual watering hole. The vibe can be laid back, but also fun.    If you're here with three or more people definitely consider the punch bowls. They bring you a bottle of your choice of alcohol on the side and you add as desired. Delicious and great bang for your buck.   Also, $2 Taco Tuesdays! The tacos are delicious (even the veggie ones) and the margarita bowls are discounted to $20.   It looks like a lot of the bad reviews came from underwhelmed brunchers, but this place ISN'T really a brunch place... Wild Hare is definitely better as a post work drink spot or a place to kick off your weekend.", 
    "review_date": "2014-11-13"
  }, 
  "hpNVVC5eZJAk_N-BMEaumg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brendan S.", 
    "review_text": "I needed to get a martini glass. Not only did the bartender help me, but she was (i swear) ridiculously attractive.", 
    "review_date": "2013-12-28"
  }, 
  "wlWfLA1oYYZmTzn4U2SiYw": {
    "user_rating": 5.0, 
    "user_location": "Vallejo, CA", 
    "user_name": "Tiffany K.", 
    "review_text": "OK, first off let me just say that I love the through the looking glass style of this place! That being said they also have a great menu, who doesn't love a tater tot! with truffle oil to boot!  I also love their creative special menus, they always have a fun quirky twist.  But the best are their cocktails, pick any one and you will love it. The Combover  is my fav! I also LOVE that they have elegant punch bowls for big groups, I have never seen that anywhere and I think its the best bar idea I have seen in a long time. Check it out and you won't be disappointed!", 
    "review_date": "2013-11-09"
  }, 
  "jxDkshPcSQnSFB1qxDcNpA": {
    "user_rating": 1.0, 
    "user_location": "Long Beach, CA", 
    "user_name": "Chandra H.", 
    "review_text": "Terrible service. After showing up for our reservation, ordering drinks and food, and waiting for over an hour, they kick us out of our table just as the food is showing up. Apparently the reservation after us was more important then letting 10 orders of food and drink finish. Plus the music is played so loud you can't hear the person sitting next to you.", 
    "review_date": "2014-03-25"
  }, 
  "f_4_L2W_o67_Ooc9nEW1uQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amanda B.", 
    "review_text": "Went for game 6 of the World Series.  Prices were great, margarita bowls were fantastic. Best tater tots I've ever had.  But the atmosphere was just awful!  They played INSANELY loud music between innings.  The played music OVER God Bless America.  And it just didn't feel like they cared about the game.    I've been there when there isn't a game and it's great, but definitely not good to watch sports.", 
    "review_date": "2014-11-07"
  }, 
  "_xzu_cuxhcbbfx6ASYev_g": {
    "user_rating": 5.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Sunny L.", 
    "review_text": "This is an awesome place to go to; expect a wait anytime of the day. I really enjoyed almost every aspect of the place besides the waiting time. The staff was really nice as well as the bouncer/host. The decorations were fitting to the theme.  We sampled all the spritzers and I could say that the one with Hugo was best. The dishes we tried were crab scramble, burger, toasts, and turkey sandwich. I would say that they were all good. They won't disappoint. Definitely come here if you have a chance. Pros: Food, staff, place Cons: Waiting, seating situations Stars:4.5", 
    "review_date": "2014-04-01"
  }, 
  "fUSsb6zgdAWAAYxvTapr2g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emma B.", 
    "review_text": "3.5 stars. Wild Hare is owned by the same people as Tonic/Bullitt/Lightning/probably some others I haven't been to, all of which have impressed me with their food. While Wild Hare did not disappoint me and I would certainly return, I have had better experiences at some of the other restaurant of the group.   I came in for brunch on a Sunday with four other people, three of which were already there when I arrived and had gotten a table in the middle of the room. I was a bit shocked to see it so empty, when pretty much everywhere with brunch (much less bottomless) has a huge wait on Sundays. However we must have gotten there at the right time because it filled up quick.  While the menu looked good, and different enough, I felt that it disappointed slightly, as did many in my group. I ordered the chipotle eggs benedict and it was good, but I just expected better. I tried some of the dungeness crab scramble and it was tasty, but again I was very underwhelmed with the lack of flavor. One of my friends ordered the kale caesar salad and was presented with an inedible pile of kale with about a tablespoon of dressing on the side.  The service was the main reason for my lack of star(s). It was extremely slow and though they were quite busy by the time we were leaving, it was to the point where we were seriously annoyed. Their priority seemed to be keeping our mimosas bottomless, and believe me - no complaints about that! However we weren't even able to order our food for about an hour. And getting the check was quite the process.  Despite it's shortcomings, Wild Hare is a fun place to go for brunch and I will probably return.", 
    "review_date": "2014-08-19"
  }, 
  "jvPKzJ5bqA6QzB3p9PPzPQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brianna C.", 
    "review_text": "Terrible service! If you want to wait 15 minutes for you drinks and another 15 for your bill then by all means, stop in. Horribly understaffed and the waitress accused us of not paying our bill, we had to show her our signed out tab to remind her that we already paid, apparently she forgot within that 5 minute lapse. Disastrous!!!", 
    "review_date": "2014-04-07"
  }, 
  "q_cYc9EJN1fzV7zwzc6MkA": {
    "user_rating": 4.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Analisa S.", 
    "review_text": "It made me sad Solstice was gone but Wild Hare is pretty cool. A friend and I stopped in to grab drinks so I didn't get to try the food, although they look like they have a really good menu selection. The place was crowded, but we found a seat easily. Our server was great - attentive to our drinking needs and not annoyed we weren't ordering food.  I'll definitely be back to try the food, especially the tater tots everyone keeps talking about.", 
    "review_date": "2014-02-27"
  }, 
  "f9YEtXi6M6CLlsxCCWQV-g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Claire D.", 
    "review_text": "My husband and I went there Sunday and were. Very pleasantly surprised to see a restaurant so close to pacific heights that wasn't a snotty yuppie wasteland.  Our server was a rock star and had the whole restaurant to herself but was on it and friendly. Food was great! So stoked they point out on the menu what's vegan and gluten free. Real sf people in there. Love it!", 
    "review_date": "2014-04-27"
  }, 
  "HorQ90eiUPfnesQlIraaJA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amy W.", 
    "review_text": "7 of us went for \"TACO TUESDAY\" ($2 tacos or 20 qty for $20) There are 6 flavors if I am remembering correctly: -pork -shrimp -veggie -chile verde -steak -chicken  Not to state the obvious, but they are soft tacos, on the small side (but double tortillas) we ordered a mix of all of them.  You could not really tell the steak pork or chile verde ones apart, but they were all decent.  They also have a margarita bowl (which is large and meant for sharing) for $20.  I have been wanting to try the rueben egg rolls for a while and they were good and as expected - I would have maybe liked them a bit meatier, but overall they did not disappoint.  There were also several ordered of tater tots happening, and they were well cooked to crispy.  It is 2 blocks from my house so I would indeed go again, but note that the single drinks are pricey.", 
    "review_date": "2013-11-06"
  }, 
  "n3GtyNZp5kamye4ugceIng": {
    "user_rating": 4.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Mikey B.", 
    "review_text": "I and the gf came here on a Saturday afternoon to meet a group of sports fans for some college football watching.  We ordered the crab melt and a chicken club sandwich. My chicken sandwich came with some slightly limp (but still tasty) fries. Her crab melt came with tomato soup and a \"salad.\" The salad was just some mixed greens and a bit too much vinegar dressing. Nonetheless, we argued over who ate more or deserved more of the sandwiches... and I polished off her soup. All very tasty. Service was prompt. I ordered a two of the house drinks. Both were alcohol light / mix-heavy (sour mix, juice, etc.), so I don't recommend those. I had a few good beers however, and gf liked the cider.  My only suggestions would be that the proprietors lower the TVs (so patrons don't leave with stiff necks), and maybe close the front door when the chilly SF wind starts blowing. I'll be back.", 
    "review_date": "2013-11-20"
  }, 
  "ht92oogYI-2vT39yQ9tMnQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "mike m.", 
    "review_text": "It sucked this time.  Weak service and it's easy to make a decent burger and salad, or overcook it with yesterdays wilteds is the way they chose to go.  BUT, if you are hipstery liking the smooth urban tunes scene with plenty of good beer you'll probably like this place.  Hoping for better stuff this end of Divisadero...please.  BTW, the Croatian guys two doors down do the best burger and beer you'll find around here.  You can always eat there and return to the Wild Hare later for a little 'stache twirling.", 
    "review_date": "2013-05-15"
  }, 
  "OFi92Xc2QyIr787GNKtgZA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Steven C.", 
    "review_text": "Part of the Tonic group of bars &amp; lounges, this revamped lounge is now Alice in Wonderland themed but honestly it feels like a mild change from the previous owners.   Beer served out of mason jars, check. Tater tots with a twist (truffle oil &amp; cheese anyone?), check. Themed bar, check. Knowledgeable bartenders, check.  It has all the makings of a neat bar &amp; I like the new middle raised bar area, but its missing a bit more character. Don't get me wrong, I'm actually a big fan of their more eccentrically themed \"Dr. Teeth &amp; the Electric Mayhem\" bar down in the Mission but this bar, it just doesn't quite come off as awesome.  Maybe initial expectations were a bit off, but Wild Hare still makes for a very solid neighborhood bar in the Lower Pac Heights, where it's mostly void of drinking establishments. I'd probably swing if I happened to be in the area.", 
    "review_date": "2013-07-19"
  }, 
  "_5uZ9Ur33MnFvpjeryyKMQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Krystle S.", 
    "review_text": "Vibe-wise it feels just like Solstice to me, but with TVs (yay), and louder music (it's a wash - depends on the music). I'm a big fan of Bullit and Dr. Teeth but this bar falls a bit short for me. I've tried it a couple of times but the totchos don't seem quite as tasty yet (Bullit seems to have better toppings), the punch bowls are too sugary (I'd rather spend my calories on totchos than try to get a buzz from a few shots of vodka hidden amongst 4 liters of sugar juice), and the bar doesn't really transport you anywhere decor wise. In spite of all this, I trust these guys enough to give it another shot every couple of weeks to see if it improves. Keeping the kitchen open until 1:30 is definitely awesome on their part. Some of their fresh fruit cocktails are pretty on par with those from Lion's Pub so if you want a but more breathing room and bar bites head here.", 
    "review_date": "2013-06-12"
  }, 
  "x74YWHmjki6F4FmFCEfIFQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Clyde M.", 
    "review_text": "Went in for the fries a la Wild Hare (aka Poutine) and was very disappointed. The cheese curds are blended into the gravy..so they are non existent..and the bartender/waitress did not do her best to try to help me get a side of curds. I had to beg to pay for a side...willingly..really just wanted some curds to go with my dish.And even after all the pleading to get decent service...the food was...gross.", 
    "review_date": "2013-08-30"
  }, 
  "4q3_TTmXkmAevyN9a0n0Tg": {
    "user_rating": 5.0, 
    "user_location": "San Rafael, CA", 
    "user_name": "Chris F.", 
    "review_text": "Best brunch in all of San Francisco.  Food is as good as anywhere else, no crowds and good service.  Will never go anywhere else again.", 
    "review_date": "2014-10-25"
  }, 
  "wdGY5WVr1oysJ4RJy7dEEw": {
    "user_rating": 5.0, 
    "user_location": "Oakland, CA", 
    "user_name": "Steven H.", 
    "review_text": "try the tots", 
    "review_date": "2013-06-30"
  }, 
  "g50E0aUjHPOrGsIa2HwIOw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Yvonne G.", 
    "review_text": "Drinks ok. Nachos suck!", 
    "review_date": "2013-07-18"
  }, 
  "UgOhVGUOMfCPFt7AF5MWog": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lindsey G.", 
    "review_text": "Setting: 8+ 20 somethings (and 1 two year old) are getting cold at Fort Mason and need an indoor spot to gather.  A few are hungry, a few want to watch some March madness, and a few just want to keep boozing.  Wherever shall we go!?  Enter Wild Hare:  perfection!  Yummy food, strong drinks, great vibes, AND shuffleboard!  Seriously this spot had everything I could've asked for, including a ridiculously exciting Badger victory - On Wisconsin!  Love the layout of this bar, super chill without being too divey.  Really nice bartenders and an overall fun crowd.  Will be back for sure!", 
    "review_date": "2014-03-24"
  }, 
  "QzEQLaqqzsKoCYrBnexJiw": {
    "user_rating": 5.0, 
    "user_location": "Wooster - 26th, CA", 
    "user_name": "S R.", 
    "review_text": "Amazing!!!! We had a party of 10 and the service was amazing! We came with a living social voucher and got bottomless mimosas, entree, and a fireball shot! I had the Chipotle Eggs Benedict, which was great! Defiantly will be back!!!", 
    "review_date": "2013-12-22"
  }, 
  "af6ayEH9BzsOPQRoxKNE0Q": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Courtney A.", 
    "review_text": "Second time here for brunch. Food was consistent to last time though I'm very disappointed with the service today.   Something happened to their computers - mistakes and technical difficulties happen, we all know that - but after an hour they still had not resolved the issue and have now forced everyone to pay in cash. This wouldn't be a big deal if they told people about it earlier, but now my party was forced to pay almost $6 to get money from their in house ATM (two of us) just to pay our bill. I would've gotten $$ from my own ATM had I knew.   The waitress said they have no manual card reader or Square and that we had to use their ATM. No discounts for the $5.50 we had to spend just for the privilege of paying our already overpriced bill.   Crap happens, this was just a really annoying and pricey way to handle it. Not coming back here anytime soon.", 
    "review_date": "2013-12-29"
  }, 
  "k_0zNmr6Tr_juw69f6JXDg": {
    "user_rating": 4.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Charmaine T.", 
    "review_text": "Great Happy Hour $3 bottled beer and $4 well drinks. 5-7pm. The bacon stuffed Mac and Cheese was Bomb! Definitely would go back with co-workers and friends again! Only complaint would be that the servers weren't that attentive and the bathroom is kind of dark and creepy.", 
    "review_date": "2013-07-12"
  }, 
  "UTiAz3HIF_AKg9gh3twUdw": {
    "user_rating": 4.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Anh T.", 
    "review_text": "I came here on a Saturday for brunch at 1 and i was asked to return in an hour because people were sucking down their bottomless mimosas longer than usual. It was nice to explore pacheights so don't let the wait bog you down!  Had the biscuits and it was so delicious. I don't typically like biscuits and I thought these were well done.   I also had the dungeness crab which was really delicious.   The drinks were all right and I probably wouldn't have gone if it wasn't for the living social deal. Definitely make a day of the city and check it out right when it opens to avoid lines!", 
    "review_date": "2014-03-30"
  }, 
  "hISdXpIirjDYi8hSKB-_Sw": {
    "user_rating": 1.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Mulberry S.", 
    "review_text": "corn syrup in their drinks.  food  is either deep  fried greasy tasteless gluten or  emptied from a Costco bag.  dressings  are bland. beer is average, yet  pricey.  anyone who thinks this place is average is far below average.    example:  ordered kale salad. giant white mixing bowl. wilted/yellow kale mixed with wilted iceberg lettuce, covered with bland white dextrose and xantham gum dressing, topped  with hard rubber parmesan cheese gratings. I've had better food at truck stops.   and to polish off the unremarkable food and drinks,  the service is slow to non-existent.   was told the egg  rolls  were a whole meal.  not even close.  had to wait ages after emptying the bakery to order again.  they never come by and ask how you're doing.   people in this place,  the several times I visited,  looked exactly the  same.  boring cardboard  looks and personality.  marina crowd", 
    "review_date": "2013-08-26"
  }, 
  "VwyaczEH9F3_0rylVskPWg": {
    "user_rating": 5.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Jamie Y.", 
    "review_text": "I'm a big fan of their Taco Tuesdays. 20 tacos for $20!! Plus happy hour specials (I can't say no to $3 bottles!!). There are 6 different tacos to choose from, and I recommend trying them all. I come here just about every week, and it's nice to go to a place for in the city where happy hour isn't just limited to the \"bar area\".   The bartenders are always very friendly, and the place is spacious and in a great location. Seating usually isn't too hard to find here. It's a great place to watch the game while you grab a drink. Or to catch up with friends over happy hour.", 
    "review_date": "2014-04-16"
  }, 
  "z1ow8uAA3TLnse9rgjxAbA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Andrew A.", 
    "review_text": "I expected it to be a little pricey for what you get because of the location, and it was.  I couldn't figure out if it was a bar with fancy food or a place to eat that had a good bar. There is no host and it's set up like an up scale cafeteria, and I was told to hover around the tables until someone left, awkward. Once we were eating people started hovering around us and we felt rushed.  The set up just doesn't work for me, I want to try more of the menu but will probably only come in if it is empty.", 
    "review_date": "2013-06-13"
  }, 
  "Z2WdY65rvPIlDobwvO7OlA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "L H.", 
    "review_text": "Solstice it is not. I feel about at home here as my grandmother's trailer home -- except a plastic-covered couch might be a PLUS here.  Food is maybe two shades above palatable unless you're getting the tots, but I wouldn't exactly rave about them. Conclusion, definitely pass.", 
    "review_date": "2013-09-27"
  }, 
  "aHYG3bEKmwiHsbo2-ZZwpA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abraham L.", 
    "review_text": "I was strolling home the Wednesday night during the ninth inning it was the diamondbacks and the giants and decided to grab a drink !  It was all good until the female bartender wearing a red knit cap asked me what I ordered from the dude behind the bar and I asked them what their name tag would say, they replied \"chief weapons inspector\", no really what's your name and they displayed a middle finger !  How do you understand welcome ? Fifteen minutes was to much time at a bar where the bartenders don't deserve five minutes !  Avoid the wild hare ! I left a phone message and Olivia from tonic productions replied and apologized !!", 
    "review_date": "2014-04-09"
  }, 
  "t4ePmQZaKjlgRyd_WUztfA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Needles K.", 
    "review_text": "It's not Solstice.  I miss the macaroni &amp; cheese with Granny Smith apples and walnuts.  But it's solid.  The cocktails were good and reasonably priced-- $6 for a greyhound with fresh grapefruit juice, fancier cocktails for about $10.  I'm on the fence about the crowd.  It didn't seem super young and annoying, but the overall atmosphere is LOUD.  People are screaming at each other to be heard.", 
    "review_date": "2013-04-17"
  }, 
  "jZbkODBXFDVoZXLm28tjYQ": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Duffman D.", 
    "review_text": "Waited about 20 minutes at a table, waitress never came over, she did sit and talk to her friends at the table next to us for 15 of the 20 minutes. There were maybe 4-5 groups in the restaurant. We got up and left.", 
    "review_date": "2013-10-22"
  }, 
  "3OkmLIQMq67J-YrZtAsqRw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "alex y.", 
    "review_text": "Finding #1: This would be a 5 star review, but I was extremely disappointed about the single blades on the ceiling fans. I spent a lot of time staring at the missing blades.  Finding # 2: Stained glass window indicating that there was an smoke room. With the lack of smoke coming from the room, I was able to deduce that this was not a real smoke room.  Finding #3: Baby at the bar; both awesome and questionable at the same time. Baby was probably only drinking milk.  Aside from these \"flaws\", the wild hare is my new favorite spot to catch a Bay Area sports event. The hostess was very gracious in offering bottomless mimosas upon arrival. We showed up early to avoid any misunderstandings and lost opportunities for getting a table.  While we were waiting, the hostess provided status updates on available tables which we greatly appreciated.  At about 1115 we sat with a and a carafe of the finest mimosa around town.   The ratio of champagne to orange juice was exceptional.  The splash of orange in a dominant champagne world is a world that I want to live in.  My main man Jonathan kept the drinks flowin' and the party goin. Versace Versace Versace....migo  Melissa runs the show!", 
    "review_date": "2013-12-08"
  }, 
  "XeOGjshZq7xHEE195TbZJA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kristina L.", 
    "review_text": "Fog Cutter Grilled cheeeeese Fog Cutter Truffle Popcorn Fog Cutter Garlic crab tots! Finished off with you guessed it...Fog Cutter!", 
    "review_date": "2014-12-03"
  }, 
  "qX9pphvNYNq6RhgeT3aYUA": {
    "user_rating": 3.0, 
    "user_location": "Fremont, CA", 
    "user_name": "Nicole M.", 
    "review_text": "Tator tots heaven! Drinks are good and lots of appetizer choices.  Looks like good choice of appetizers but only ordered tots and chicken. Not bad", 
    "review_date": "2014-08-13"
  }, 
  "cbehkbJXi_sauQbjco9iaw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Derek S.", 
    "review_text": "Fun place to watch a game and have some drinks. The food was average and service was friendly but a bit slow. Overall I'd recommend if drinking is your primary concern....the po boy sandwich was good, not great and the nachos (and i know this is controversial for some) had the fake nacho cheese...which is like the worst thing ever for a nacho with real cheese lover. I'll be back though...for the drinks.", 
    "review_date": "2014-09-12"
  }, 
  "aVaa64zb_-d6VTY3XcXyIQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jane A.", 
    "review_text": "I LOVE A BEING A MIMOSA-MESS (4.5 stars)  Their menu is pretty awesome (brunch, lunch, dinner, latenight). LOVE THIS PLACE (especially on Saturdays). Last time I had came here, it was just to taste their gastopub food. They had yet opened up Brunch. Many months later, I'm back for another run. Sunday brunches are packed, Saturday brunches has its wave of crowds. SATURDAY BRUNCH!!! We came around 11 and sat ourselves at the booth. Bunch is from 10-3, no rush.   On that LS deal... $25 its 2 brunch plates, bottomless mimosas, and shots of fireball.  HEFER STATS.  BOTTOMLESS SPRITZ MENU ($18) - bottomless mimosas. My favorite of the list was the Hugo. I stuck with Watermelon&amp;Lime and Hugo. Hugo - prosecco, elderflower, soda water and fresh mint = BOMB DOT COM. The watermelon &amp; lime - prosecco, soda water, fresh watermelon &amp; lime. My date had the Basil &amp; Blueberry, Hugo, and Aperol Spritz and the favorite of all was the HUGO. They serve them in little small mason jars, cute idea.   DUNGENESS SCRAMBLE ($14) - Dungeness crab, fresh tomato, scallions, avocado &amp; chipotle aioli servered with toast. THIS WAS SO GOOD. when a place serves r-e-a-l crab you cannot complain. it reminded me of the tater totz with crab, except it was just with eggs. We shared food, worth it.  THE HASH PLATE ($9) - Corn beef hash &amp; two eggs, topped with farm cheddar served with toast. The eggs covered the cornbeef hash. The hash was okay, more hash then corn beef but it was still good. i love cornbeef hash, this was good just different texture then what i'm use to. we shared food, worth it.  FIREBALL SHOTS (??) - By the end of the meal, we were on a good one. Topped it off and start our Saturday with Fireball shots. WHO DOES THAT!!! lol, apparently, we do.   COFFEE (?) - It was strong and legit coffee. Not sure what kind of beans they use, forgot to ask.   Will I be back? DUH!!!! you dont have to ask me twice.   JABA APPROVED. Until the next review....", 
    "review_date": "2014-01-25"
  }, 
  "N4798mdSTF4_l7H2czh2aQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Esembee B.", 
    "review_text": "Rented the Peacock room to host a happy hour.  For a fee they reserved the back room just for our group.  Food and drink was on top of the room rental fee but it was worth it to have the space to ourselves.  Not sure how it compares to other places that just require an order minimum without a rental fee.  The food was pretty standard bar fare.  Sliders were well-seasoned, loved the truffle popcorn.  Wish there were more vegetarian appetizers, and finger-food options that weren't fried.  Also wish they had beer on tap.  Enjoyed the house red wine very much.", 
    "review_date": "2014-06-14"
  }, 
  "asTBsT7G_WiOl8AKawLWeA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle C.", 
    "review_text": "I miss Solstice! This place needs to change a few things to better cater to the crowd, first TURN THE MUSIC DOWN, everyone is screaming to hear each other. Also hire more wait staff, 2 is not enough, also improve the quality of the food. It's basically all junk and I think the novelty of tater tot tacos will pretty quickly wear off on the weight-obsessed Pac Heights ladies. It should focus on being a cool bar- gastro pub catering for the local crowd ( over 28, not Frat Boys, with more sophisticated food tastes.) and then it might be more successful.", 
    "review_date": "2013-04-26"
  }, 
  "Ed8JmiYnZYMe86vyKpcEwQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Betty P.", 
    "review_text": "BOTTOMLESS MIMOSAS!!! MMM MMM MMM MY FAVORITE!!!  Checked out this place because living social was having a deal and I definitely enjoyed my time there. The living social deal included 2 brunch entrees, 2 fireball shots, and bottomless mimosas for only ____ (I forgot but it was worth it). Ordered the French Toast and I absolutely loveeeeee it! It was soft and fluffy and the fruits tasted fresh! My boyfriend got the Corn beef hash which he thought was okay. I tried it and it was meh. BUT THE TACHOS made up for it. Who doesn't love Tater tots and gauc and all that good other stufff! My boyfriend and I also witnessed a proposal and everyone there got free \"LOVE SHOTS!\" A very lively, new, chic bar/brumch spot to check out! The only thing that sucks is that everyone else waiting to grab a table is gonna have to wait a long time because there really is no time limit to the bottomless mimosas.", 
    "review_date": "2014-03-28"
  }, 
  "u9HVR2HPTemdFkzya602Ww": {
    "user_rating": 1.0, 
    "user_location": "Larkspur, CA", 
    "user_name": "Andrew S.", 
    "review_text": "1 one star review is for a bartender. Don't know her name, but management will know who she is when they read this review. As a little background, I live up the street so I often stop by for a quick drink. Anyway, despite the fact that I'm friends with the manager, I was mistreated by this bartender on two occasions. The first time a tame argument started between my friend and another patron, we were asked to leave. The other patrons were allowed to stay. Rude, but I understand. Drunk people in bars often get asked to leave and the bartender isn't going to see the entire sequence of events. However, the second time was totally unacceptable/malicious. I stopped by the bar to say Hi to the manager on Saturday. I was with three friends at the time one of whom was from work. I had seen the manager at the bar Friday, and she told me she would be working Saturday starting at 5:00 PM, and I should stop by and get a drink. The second I walk in the bartender from the first incident starts pointing at me and shaking her head. She refused to serve me and insulted me in front of a co-worker. Very awkward situation. Ironic, that the manager told me to stop by, and someone who works for her had the gall to be so disrespectful.Moreover, as an aside I like everyone else in the bar and often tip north of 30%. I would appreciate an apology.", 
    "review_date": "2014-08-03"
  }, 
  "uC4bN2InArpm0T9KPRh2ug": {
    "user_rating": 5.0, 
    "user_location": "Eureka, CA", 
    "user_name": "Humboldt C.", 
    "review_text": "Stopped here on a random adventure in the city. Two for one margaritas on Tuesday. Food was served fast and the margaritas were tasty. Check it out.", 
    "review_date": "2014-09-23"
  }, 
  "4SjHixRcpM5HxWpXJBDlEg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Eric S.", 
    "review_text": "GET THE MAC N CHEESE STUFFED GRILLED CHEESE. I cannot emphasize that enough, it is spectacular. Comes with a tomato soup that perfectly compliments the sandwich. You will not be disappointed.", 
    "review_date": "2013-06-10"
  }, 
  "30z-PZ_PJsiErki4AH25Mg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Theresa O.", 
    "review_text": "Oh god, stop it, stop it now.  This place is the Miley Cyrus of Lower Pac Heights....a raunchy imitation of it's predecessors.    Food is passable only if you are drunk....however, you will only enjoy the overpriced drinks if you arrive already drunk.  The formula seems to be working for the Marina crowd but that's about it.  RIP Solstice.", 
    "review_date": "2013-09-01"
  }, 
  "8RDqrYJ4ZkszNo29KgNfNw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Gill P.", 
    "review_text": "Sure, it is a bar, it has beer and cocktails.  Otherwise, it was pretty awful.  I had the Fish tacos, which were three fish sticks in a tortilla with shredded lettuce on top.  Thats it, nothing else, I could have microwaved a better meal and not been left with such a dry taste in my mouth.  The wife had the bacon chicken wrap, and there was no bacon.  The wrap at least came with some sort of sauce, but maybe shouldn't be named a bacon wrap, if there is no bacon.  It gets two stars because we didn't get any sort of food born illness.", 
    "review_date": "2013-04-22"
  }, 
  "c4u44Vmr2SnnypS_pRJJqg": {
    "user_rating": 5.0, 
    "user_location": "Pacifica, CA", 
    "user_name": "Jacqueline O.", 
    "review_text": "I've been here twice now and would definitely recommend it to anyone. Service was awesome, we had order drinks and of the six one was the fernet cocktail listed on the menu. I love fernet and typically enjoy the cocktails made with it, this one however leaves more to be desired. Because it was the birthday girl's order and she was less than impressed we politely asked for a different drink while sending the fernet cocktail back. The waitress was extremely nice and took the drink off the bill. Such great service will keep the clientele happily buzzed and coming back for more.", 
    "review_date": "2014-08-07"
  }, 
  "t2YUMstrcqWPl-3Kmi9yxA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sean B.", 
    "review_text": "This place is meant for getting your drink on paired with gourmet bar food. You are probably asking if that makes sense? Well, it does. The staff looks like they all came back from an Endless Summer film-shoot.   There is plenty of booze with both specialty drinks and beers. The food is nachos, tater-tots, and other \"get your grub on food\". This place is not for getting a fine dinning meal but if you are interested in a good drinking experience, then this will definitely work for you.", 
    "review_date": "2013-10-28"
  }, 
  "8PKpcbNKQudsvZGZ57kynQ": {
    "user_rating": 4.0, 
    "user_location": "Pacific Heights, San Francisco, CA", 
    "user_name": "Jeanna B.", 
    "review_text": "Awesome addition to a neighborhood that's had a minimal bar scene that's largely focused on low-key or older people spots. Don't pay attention to people complaining about liking Solstice over this - Solstice was more of a restaurant, this is more of a fun bar scene with communal tables to meet others and a freakin awesome menu. And it feels unjust to rate a place bad just because it's not the spot you liked that went out of business. Derrrr Yelp users. More than five different types of tater tots?? Yes please. However, skip the fried bacon and corn dogs (too greasy). I think the ambiance/decorations could be kicked up a notch, as their very minimal on-tap beer list, but overall this adds something the Pac Heights hood is missing, and my friends and I are huge fans.", 
    "review_date": "2013-05-15"
  }, 
  "tjceqULNTB9I1tj36p_tyw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kirsten Z.", 
    "review_text": "Been here 4-5 times now. It's solid. Good quality and variety of food. Great salads, burgers, apps. Bartenders amenable to making custom (and very tasty) cocktails which I always appreciate.   What prompted this review was my last experience at Wild Hare. I was eating at the bar and it became evident (probably by the fact that not much was missing from the plate when I gave the sign I was finished) to the bartender that I did not like what I had ordered. Not because it was bad, per se. It was just too fried and too rich for my taste. Anyway, the bartender noticed and proactively asked if I wanted something else. I was impressed. Had a burger that was very tasty and went home happy.", 
    "review_date": "2013-07-27"
  }, 
  "SP0cHwPCEMzfk1mKMP1Wfg": {
    "user_rating": 5.0, 
    "user_location": "Westlake Village, CA", 
    "user_name": "Anna H.", 
    "review_text": "I was visiting the city and stumbled upon this place and it was out of this world!!! I would FOR SURE go back again!! Told all of my friends who are frequent San Francisco visitors to go here and they loved it as well!! A+!", 
    "review_date": "2013-11-27"
  }, 
  "JSPE5bMOg6rAKvKVEdfIXw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Alita M.", 
    "review_text": "Bring back Solstice. The food menu looks tempting, but then you can never get served. Their special drinks are atrocious and the service is overall horrible.  We walked in on a Friday night at about 9pm and were told that the kitchen had stopped serving temporarily. No explanation given. When we asked, all we got was, \"I don't know.\" Highly doubt that. When asked if we wanted to grab a seat anyway, she then told us she'd check on the kitchen status, so we decided to take a seat and relax.  15 minutes go by and we are waiting still for our drink orders to be taken. When the waitress finally comes by, she doesn't mention anything about the kitchen, so we ask her if she found anything out. Her response was that they'd stopped serving until they can catch up with the order flow, which made a ton of sense. We asked her if she could keep us posted, which she agreed to do, and then took our drink order.  No joke, 20 minutes go by, the only drinks that were delivered were to our two friends that ordered the tall Tecates in a can. And she walked by our table at least a dozen times with no explanation. She finally came over and mentioned that our drinks would be coming soon, that they're just a bit backed up. As for food, they are still not serving. Meanwhile, 2 other friends who arrived 15 minutes after us went up to the bar and got handmade cocktails in under 10 minutes. I would have gotten up, but she'd already taken our order and we all thought it'd be rude to go over her head and make the complaint.   Finally, our drinks arrive and they were horrible. The blackberry whiskey I think it was? concoction had no flavor and the tequila lime option must have had a pound of sugar. We had waited so long, we just drank our drinks. But back to the fiasco with service...  Around the same time our drinks came, our friends saw another table open up in the downstairs area, where Solstice used to have a second bar that is no longer there. They sat down and within 5 minutes their waiter offered to put in a food order for them and got food in under 15 minutes. Now, I find it rather odd that there were 5 other people at another table only 20 feet away who asked 3x if there was a way to get food and didn't get any. Especially as we were super super polite, being funny eager with her about wanting the tater tots, MUST HAVE TOTS type mantra, while we had waited a decade for our drinks, patiently.   I know when places get hit hard it's not always possible to keep up, and yes, the job is hard. But when you're a new establishment, you should be better prepared. Also, you should give you waitresses the power to help make the experience better, like giving a free drink as apology for waiting a half hour for service and a drink. Either get more servers or ones that can be more consistent with their service.", 
    "review_date": "2013-05-07"
  }, 
  "LU7ikPXZ5R8tv4oNQZQkKw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Fatty A.", 
    "review_text": "Chill bar with some cute chicks.  I'll go back once I lose 50 pounds", 
    "review_date": "2014-03-23"
  }, 
  "cAvKxcZD57zBXD0x9b7g-g": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S H.", 
    "review_text": "What a mess.  I was here for a birthday party.  The private room that my friend rented was likely a storage closet previously.  Getting a drink at the bar was a nightmare.  Ten or so minutes to purchase my $6.25 beer.  Normally when a restaurant turns into a bar/club they remove the extra tables and chairs.  Not this place.  It was a maze of people and bar stools to get a drink as well.  The number of people I saw trip over and run into bar stools was pretty astounding.  I don't plan to return.", 
    "review_date": "2014-10-11"
  }, 
  "C469FeAyiATdaNmgXjZYWQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christophe C.", 
    "review_text": "Oh man, this place. We walked in just in time to see Stanford best Kentucky here and went nuts on the mimosas. Mind you, we had to wait a while for seats, so we were crushing it with the drinks by the time we even saw a menu.  Alright, since I don't really recall the food, I will say that there's an interesting twist with the mimosas - different flavors! And orange champagne is not in my top two. So how do my rankings play out?  Well I don't remember that either, but you should be trying them all anyway.", 
    "review_date": "2014-04-05"
  }, 
  "1ljC2JgUafYC9wtEUXJ3bQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer L.", 
    "review_text": "Wild Hare is a typical gastropub - nothing too special or out of the ordinary.  It's a little \"old timey\" as someone else mentioned... comparable to Shotwell's or Comstock, but with an Alice in Wonderland theme.    Since Wild Hare is located on a corner, it is big (for a San Francisco establishment)!  There are a lot of tables / bar stools / seating, so it's a great place for huge groups.  Food is on par with the food at Lightning, Dr. Teeth &amp; the Electric Mayhem, and Bullitt - which makes sense because Wild Hare is owned by the same people.  So if you - like me - enjoy the tater tot nachos at Bullitt, the burgers and fries at Lightning, and the truffled mac &amp; cheese at Dr. Teeth, you'll probably like the food at Wild Hare.", 
    "review_date": "2013-08-24"
  }, 
  "PqYyZCXh5SI67fj06QP7Yg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sean K.", 
    "review_text": "Great space. Even when it's crowded you never feel cramped. Amazing and friendly staff also sets wild hare apart. Solid bar food options and stiff drinks. My favorite bar in the city.", 
    "review_date": "2014-06-29"
  }, 
  "Cqzo3kjNoxe5BhXh3BXTng": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Maya S.", 
    "review_text": "I come here for happy hour on Friday's.  To drink. And eat tater tots.  Nothing better then a Jameson and some tots smothered in random sauce and meat to end a long week. The happy hour menu is solid.  Deep fried bacon?  Yes please. I don't really give a shit what the place looks like.  If they do their job right (and they do), I'm sufficiently inebriated 20-30 minutes after walking though the door.  Then I just ride out the tater tot happiness well into the evening.", 
    "review_date": "2013-07-26"
  }, 
  "KheemzNvPqrxDtOqdrOQ5g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meredith M.", 
    "review_text": "New neighborhood spot for drinks and food! Bye-Bye Solstice thugs and hello Bullitt-Lightening Tavern wannabe hipsters. SCORE and UPGRADE.   Burgers where grilled cheese acts as the bun?! Taxidermy galore? Yummy fresh cocktails? DUH- I'm in.", 
    "review_date": "2013-04-12"
  }, 
  "M0mONsg1ZJIKA30ad1qE1w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tina A.", 
    "review_text": "TATER TOTS GALORE!!!   crispy. golden. potatoey. goodness.  my personal favorite was the truffle tots, OMG my stomach is growling just thinking about it. just mouthwatering truffle oil tots and aioli.  totchos were basically tator tots topped with low quality nacho toppings (oxidized guacamole, thick sour cream).  i probably would not go for these again  garlic crab tots were a little fancy.  i loved the garlic and the use of real crab meat, however the crab was over salted.    by the time my crab grilled cheese came out, i was way too full to enjoy it.  the avocado was fresh in the sandwich and the crab meat was of similar quality as the one in the fries.   our waitress was a very attentive blonde lady.  i appreciate that she checked up on us often, unlike when i came a few years ago (Solstice) where i received no service  our group was a party of 6 and unfortunately reservations are not taken unless you have a party of 10 or more.  plan ahead and expect to wait for a booth to open up.  not gonna lie, the tots have been on my mind for a week now, and i'll likely be back", 
    "review_date": "2013-11-26"
  }, 
  "xRJyMR1_QPuZuUhUuVaooQ": {
    "user_rating": 4.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Marcin M.", 
    "review_text": "On a weekday evening the scene was pretty mellow so we were able to pull up straight to the bar.  Bartender was friendly as were many of the other patrons at the bar that evening.  Drinks were great (I had the manhattan/campari drink and a fernet on the rocks) and weren't crazy expensive as some other places.  Shared some sliders - beef and reuben - and they were great.  Seems like there are plenty of tables for seating along with a good-sized bar.  A nice addition to the area.", 
    "review_date": "2013-09-22"
  }, 
  "u9KhzES5reUljwccEyFdJw": {
    "user_rating": 4.0, 
    "user_location": "Oakland, CA", 
    "user_name": "NATASHA F.", 
    "review_text": "My rating is just based on the drinks and a couple appetizers.   Came here a few times to have HH. Drinks are always made strong which I like! The staff is pretty accommodating with large parties which is not always an easy thing to juggle. Their tatortot nachos are goood ! Different but good! Also surprisingly the clam chowder is delicious! I'm not one to order chower at a bar but something drew me to ordering it and Im glad I did. It is thick and super tasty! Ill definitely be back", 
    "review_date": "2013-08-02"
  }, 
  "mWovMFEZgWE40UVchWHlWA": {
    "user_rating": 2.0, 
    "user_location": "Rockville, MD", 
    "user_name": "Kevin F.", 
    "review_text": "Sorry but this place is doomed unless they 1. De-emphasize the whole \"We are a bar, and that's it\" theme, v/v food, TV, etc 2. Turn on the dang heaters 3. Serve hot drinks (non-ETOH)  on cold days/nights! Duh! 4. Open at 4 or 4:30 5. Reduce the sleaze factor", 
    "review_date": "2013-12-09"
  }, 
  "2NWKoTSkkF-s80oxPjHZSw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie T.", 
    "review_text": "Drinks are ok. Food was meh. Liked the old solstice :(", 
    "review_date": "2013-07-03"
  }, 
  "FZq2Tk_pjgs0Vt7vt5JawA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Charley B.", 
    "review_text": "Awkwardly, I'm writing this review while I'm at the bar. I've never felt compelled to do something like this before but the service/ambiance/pricing of this place warrants it.   Service: I was ignored by the bartender for a good five minutes while standing directly in front of her with nobody else other than a guy who had already ordered a Guiness was waiting for a beverage. Not that I need to be served immediately but the way she glossed over me three times without acknowledging that I was waiting to order something rubbed me the wrong way. Not only that, but when taking my order I was made to feel as if I was an inconvenience by doing so.   I was ordering a draft beer.   Ambiance: whatever. Lots of empty tables and TVs all over the place. Could be a good place to watch a game or two with a mid sized group? Music is a good vine but terrible selection. Weird techno 80s remix. That's not too bad though.   What's bad is the fact that I was served a beer in a mason jar. I do not like this \"concept\" or trend or whatever it because: A) it's played out.  B) mason jars are not designed with the beer drinker in mind so they suck to drink beer from.  C)I don't take bars who serve all their drinks out o mason jars seriously if they over charge for their beverages (see below)  Pricing: I just paid $6.25 for a Lagunitas IPA at 6:15PM on a Thursday. Out of a mason jar. In 2014. No happy hour? Even if there is no happy hour, why is it $6.25? Most other bars charge $4-5. Maybe $6, but that extra quarter is obnoxious.   Given the pricing, service, and ambiance of this spot I can safely say I will never return and I do not recommend it to anyone.", 
    "review_date": "2014-12-18"
  }, 
  "tl3MYd8JTNe-Uwuat2SBUw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Thomas P.", 
    "review_text": "Gotta give some love to this place! I live walking distance to this bar and I'm relieved to find it's a place I can go for a drink close by without feeling like I need to be carrying in a briefcase and familiar with tech lingo. Not a lot of bells and whistles, but still a definite date spot, or place to hang out with friends.  Great for groups too! Plan your next party here, and reserve the downstairs space where they've got... Big Buck Hunter for arcade?? I was with a group here on Thursday, and we got treated like kings from the bartenders and servers. Yes, this place is a lot of fun!", 
    "review_date": "2013-11-24"
  }, 
  "ncql7fwLPIDCIy2Ih-zlkA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jennifer H.", 
    "review_text": "Could be a good place to repeat but just TOO LOUD! The city could always use more bars where you can chill with friends and drinks and actually converse. I'm not sure why they insist on turning up the volume so high - who goes to a gastropub for the bass? I like the interesting decor and the menu, but a laid-back bar would actually fit the theme and this neighborhood better. They should try to make the atmosphere more inviting than that of one stop along a bar hop..here's hoping they'll improve.", 
    "review_date": "2013-04-17"
  }, 
  "JzmJ6U20uJ9pZonwKGvMuA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua W.", 
    "review_text": "Great bar food, nice atmosphere, brings in some of the Marina crowd but not excessively douchy, horrible service away from the bar, great service at the bar, standard Marina drink prices ($6 pints, $5 bottles, $10 cocktails). Not a horrible place by any means. Would be a good spot for a few in that neighborhood once the new wears off and the crowd thins out a bit.", 
    "review_date": "2013-05-08"
  }, 
  "gW3tX6YmxMrUHsyhkFqSmg": {
    "user_rating": 2.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Robert l.", 
    "review_text": "We came here with a reservation of 12 people so this might have been our first problem. The waitress was nice and attentive with refilling our bottomless Spritz. However majority of the drinks we received were full of ice definitely was not worth the money. When they ran out of champagne, they offered us a shot of fireball for us to wait for more refills. The food however was horrible, I ordered the breakfast burrito and all I could taste was egg and tortilla... My brother ordered the chipotle eggs Benedict, and my wife ordered the Dungeness scramble both did not taste very well. The only good thing about this place other than the waitress, was they had TVs everywhere", 
    "review_date": "2014-03-25"
  }, 
  "BLdjU7aci4excf9LAd7mQw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Casey M.", 
    "review_text": "Came here yesterday to watch the 49er game. They could definitely use bigger TV's. some of the details were hard to see.   My group ordered the pineapple mint punch bowl. It came with a 350ml bottle of mid-level tequila to spike the punch with--- I liked that we had control over how much alcohol was in the punch bowl (I mean, we poured the entire thing in, but we could have been conservative if we wanted to be).   As far as food, it could have been better. We ordered buffalo wings, fully loaded tater tots, and the fried pickles. Pretty standard bar food-- nothing spectacular.   Our servers were extremely nice but overall, the place is somewhat understaffed.", 
    "review_date": "2013-09-16"
  }, 
  "PVpeB-fTAd5qi1vxDTSehw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "S. M.", 
    "review_text": "It shouldn't take 10 minutes to get a drink when there is only 4 other patrons in the establishment. the bartender was too busy chatting it up and changing TV channels. Luckily another cocktail server emerged and was able to take our order.  Prices are decent, decor is cute, good lightening for a bar. Didn't try the food. May be back because it is close to my new office but lets speed up the service a bit, ladies.", 
    "review_date": "2014-01-09"
  }, 
  "XkLK2iBsgqF6mWwDfRgqqQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Seong P.", 
    "review_text": "Met some friends for brunch on a Sunday, and it was relatively easy to get a table.  Once football started, it got more crowded and loud.  It's spacious and open, with a lot of windows, so it was nice and bright.  We got the totchos for the table and they were good.  I ordered the crab scramble with egg whites since it sounded light, but it was too salty for me.  It did not come with tater tots, but almost everything else did.  I ordered the pancake battered corn dogs to go for Tintin, and while they tasted ok, they were dense.    The 4 bottomless mimosas options looked really refreshing.  Each option was pretty, and my friend seemed to enjoy them.  I ordered 2 bloody marys.  The first one was somewhat bland,  so I specified spicy for the second, but it came out smokey.  That is not a taste I like in beverages, so I would pass on bloody marys here.  The service was good, and food and drinks came out at a fairly good pace.", 
    "review_date": "2013-10-29"
  }, 
  "iK5oMORPCmoWUmannptD-Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Paul W.", 
    "review_text": "This is a pretty cool spot to check out for happy hour.  Decent priced beer and pretty good bar food.  In fact the crab tots are pretty delicious.  (and i usually abhor tots).   They have a bunch of TVs so it's a pretty good spot to catch a game.", 
    "review_date": "2014-04-13"
  }, 
  "eKUGKQRE-Ywi5dY55_zChg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Cherylynn N.", 
    "review_text": "Pac Heights Funktified.  The guys behind Bullitt, Tonic, Dr. Teeth and my personal fav of Soda Popinski are bringing much needed funk to the most bougiest neighborhood of Frisco (you know!). *ahem* Excuse my ghetto side as I grew up on the other side of town.  Wild Hare (previously Solstice) is the latest addition to these guys' already 743667 bars in SF. Its Alice in Wonderland theme is complete with a huge queen of hearts card, bold reds and mute greys, and a stuffed wabbit head. There's several flat screen TVs for watching the game too.  Their gastronomical grub and libations menu is extensive. From yummy cocktails ($10), lush friendly punchbowls ($32) to buzztastic eats ($5-$16) of Dungeness Crab Jalapeno Poppers, an assortment of Tater Tots, Salads, Burgers, Bucket of Fried Chicken to even Steak Frites with a Bearnaise sauce, there's something for everyone.  *Cocktail Menu: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FYXhRby&amp;s=306d23ec7466b93e363acd907581d715a76e71d2bb9a73ba083a36dffc2910a8\" rel=\"nofollow\" target=\"_blank\">bit.ly/YXhRby</a> *Appetizer Page 1: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FZwaHqr&amp;s=4779997d5c20b2d9d20efd98e325302619a99f30199156dbfbd81c1269e9fe37\" rel=\"nofollow\" target=\"_blank\">bit.ly/ZwaHqr</a> *Appetizer Page 2: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F10XDOoP&amp;s=9883812a955e9d99cfb9e8d32486e8f79f167da3159cd4930b7a42390c60771f\" rel=\"nofollow\" target=\"_blank\">bit.ly/10XDOoP</a> *Soup, Salads &amp; Light Bites: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FZWa49w&amp;s=8c8383b74b6559937535c8efb98ccc46d713866955e45014d33f43e4ab5ff0a4\" rel=\"nofollow\" target=\"_blank\">bit.ly/ZWa49w</a> *Sandwiches &amp; Entrees: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F104QE9u&amp;s=739ca7c663f9c37250e7a3121651759baf8fdd6ef1759ce4f5c2f6b810504521\" rel=\"nofollow\" target=\"_blank\">bit.ly/104QE9u</a>  Since we have several, why not clog an artery with The Deluxe, a half-pound burger with two grilled sammies used for buns? I don't have any arteries to spare so please try it and let me know okie? Thanks!   And for all you Fernet lovers, they have that on tap too: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FWS92kx&amp;s=49d7255bc757d8d0b07d70d4de967e51bd0b3313b4406fbe2b1c775420a40c1a\" rel=\"nofollow\" target=\"_blank\">bit.ly/WS92kx</a>! *Woot*  Food is served till 1:30 am. Stay tuned for their brunch service!  With a choice of booth seating, the communal table and two top table seating, we decided to sit at the bar. Luckily we did, as Josh was our awesome bartender. The staff at all of their 743667 bars are always friendly, down to earth, and attentive so the owners are definitely doing something right.  The Fog Cutter ($10) was my choice of poison: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F115QOuf&amp;s=4f18ad12be129f0c83803e26d7d842675cfe8a03bc46721d0406612caf4da7ff\" rel=\"nofollow\" target=\"_blank\">bit.ly/115QOuf</a>. The gin, raspberry and ginger beer concoction was deliciously refreshing and after two, I was WHOOO HOOO status.  Being a fan of Dr. Teeth, we had to get an order of their tots. The Dungeness Garlic Crab Tots ($11) to be exact which were gut-bustingly good: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2F17BCtsW&amp;s=abfdc1cd3f7a0f8a1ca7606884f7ee0aaa3342c464fe7b9a28246268a5fa5839\" rel=\"nofollow\" target=\"_blank\">bit.ly/17BCtsW</a>. The Tempura Bacon ($9) however, sounded better then it tasted: <a href=\"/redir?url=http%3A%2F%2Fbit.ly%2FZlklQB&amp;s=20a6ac7900a34c3c173cc28fa627064a4068065b78a71125862013f42cab31f6\" rel=\"nofollow\" target=\"_blank\">bit.ly/ZlklQB</a>. The batter was more like a soft corndog batter then an airy, crunchy tempura batter but bacon is bacon right? You can never screw up this delicious porker.  Parking is a biatch in the area so come early. But not too early like me. All my WHOOO HOOO pre-dinner cocktails made me a grandma and I spent my Saturday night passed out in front of the TV sleep watching \"Thank you for being a friend...traveled down the road and back again...\"  Don't hate, you know you can't get enough of Blanche, the southern belle who made being a slut A-OK! Who else can get laid left and right with shoulder pads and hideous Hammer time pants? Love her.", 
    "review_date": "2013-04-15"
  }, 
  "rR_5neGv4_2-IL7EUqE7DA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Dasha O.", 
    "review_text": "I have tasted your Reuben and I want more! Great transformation of an old bar into something exciting and yummy as well. I will be back.", 
    "review_date": "2013-04-27"
  }, 
  "zORQY85qUfWiIEltLOxG1g": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Jacquelynne S.", 
    "review_text": "We went here for bottomless mimosas.  They do not serve pitchers here.  Instead, they would circle around and refill any empty glasses.  The only problem was that there was only one waitress working.  So good luck trying to get a refill.  The food was so-so.  My open-faced bacon sandwich tasted like 2AM drunk food.  The only thing worth raving about was their garlic potatoes.", 
    "review_date": "2015-01-27"
  }, 
  "txHPItxD15t4HjcKE1Z2iw": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Keyser S.", 
    "review_text": "No, it is not Solstice, but i actually like it better. Most of the food is tasty and they are open late, or so I thought. I've been eating there 1 or 2 nights a week since they re opened. Last night the service was embarrassing. The bar is full of dead drink glasses, and a hand full of people. I don't want to sit at a dirty bar so I stand at the bar trying to order for what seems forever. Finally one of the bartenders asks what I want. I order 2 drinks and a sampler platter. I then go sit at a clean table not 5 feet from the bar. The waitress comes over and asks what was the vodka drink I ordered again. Then comes back again to ask what I ordered on my appetizer platter. Order 3 times for a 3 item check? OK. Now we are waiting forever again. The 2 bartenders are talking to 4 people with balloons ignoring everyone else at the bar. I tell my girlfriend \"I bet our food is just dieing in the window while she talks\". My girlfriend goes and looks in the kitchen, sure enough there's out food. Bonnie has to ask 5 times and get loud before the bartender realizes someone else exists other than her friends. She brings our food, now lukewarm at best. We eat, and sit there forever again until I go up to the bar and ask for our check. There are 2 bartenders and 6 people at the bar, but yet I can't get my bill? The bartender is not happy and gives some shity smirk before she rings me up. Then when she hands me a check she says\"Just so you know we don't have waitresses\". Why are you serving food then? How the fuck am I supposed to order if there is no service? Do I go to the kitchen and order? Or do I go to the computer and put my order in? As stated I liked this place and have been going there since they opened. But since there are no waiters to serve me anymore I won't be eating there anymore. Good luck treating the few customers you have like shit.", 
    "review_date": "2013-10-16"
  }, 
  "SA6VpUZiG29LneMTa9Xu6g": {
    "user_rating": 3.0, 
    "user_location": "Berkeley, CA", 
    "user_name": "Mea H.", 
    "review_text": "I was super excited to come here, having heard about their great tater tots and tasty cocktails. And, well, that much is true. Ladies and gentlemen, they have great tater tots and tasty cocktails. My fella and I had the Seek and Destroy and the Cloak and Dagger drinks (MMM!), which were very creative and paired interesting flavors together: rum-chartreuse-pineapple-mint for the former and whiskey-blackberries-mint for the latter.  But there are problems. For one, we got a 3-tot sampler as an appetizer, and this was definitely listed under \"appetizers.\" When we ordered, the server had told us that the normally $15 sampler would be \"priced up\" for the more expensive kinds of tots, so we figured the difference would be $4-5 extra.   Believing this to be a typical appetizer-sized appetizer, we also ordered entrees: the burger with Swiss cheese for me, and 12 BBQ wings for him. We expected maybe 7-10 each of the Wild Hare tots, buffalo chicken, and totchos. What we got was a plate of THREE full orders of each kind of tot. While you might say, awesome, what a deal, it was shocking. We gaped at the plate and when the server came back, asked if the entree orders had not been put in yet, to cancel them. The kitchen had already started cooking them, so we just had them put straight into to-go boxes.  The tots were totally good, though the totchos (tater tots covered in nacho fixins) were little more than novelty. The Wild Hare are basically poutine tots, which is always great in my book, and the buffalo chicken sauce was pretty tasty. But it was just huge. This is a two-person meal. And it was NOT $4-5 extra, the sampler came out to $25. Which is essentially $3 off of actually ordering the three full orders of tater tots. Had this been what we were hoping to have for dinner, that would be great, but we had two other entrees in boxes, which ended up being the wrong order anyway.  Finally, the decor would lead one to believe that it's a classy, old-timey style gastropub, but the place contains 5 TVs showing ESPN. A strange and not quite fitting detail.", 
    "review_date": "2013-07-08"
  }, 
  "Duu2eOYkCeUBrO6GPQvo5w": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ben B.", 
    "review_text": "Decent cocktails, nice bartenders, well-decorated big space - rather D-baggy marina crowd, won't be frequenting.", 
    "review_date": "2013-04-19"
  }, 
  "aaXANaiPk9xzMEqo3t5l_g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sumit C.", 
    "review_text": "Neighborhood bar with good food (gastronomic bar?).  We had a LivingSocial coupon for brunch, from them that we wanted to use. We had a 1 hour 45 minute wait (yep!). I almost gave up, didn't want to eat there given how crowded it was, assuming service would be spotty.  We got excellent service, the staff didn't lose their cool the guy at the front was super cooperative and to top it off the food / drinks (try their \"hugo\") was excellent.  The service/staff deserves kudos!", 
    "review_date": "2014-03-23"
  }, 
  "3FAb-ch2K3K9uQz7N49ITA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Light Bulb J.", 
    "review_text": "Told my group the wait would be 30 minutes and that we could wait and we could start our bottomless mimosas (included with our livingsocial deal which brought us there) while we waited. 1.5 hours later they finally sat us. Food was good but they charged us separately for the mimosas ($80) on top of our voucher after we moved from the bar). Ripoff", 
    "review_date": "2014-03-03"
  }, 
  "Lzck7Im0rktjvJUZNmgHZw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "jules w.", 
    "review_text": "As a former Solstice fan i had high hopes.. alas. The bar staff are as friendly and professional as ever, but clearly the new bar is not aimed at anyone who appreciated the pretty good food Solstice offered or said goodbye to their twenties a while ago. I had Chinese lettuce cups, the fact they were topped with chopped tomato should have warned me. My friend who eats pretty much anything has tatter tots, maybe okay to soak up way to many drinks but really not that good. My food was tasteless and pretty terrible; the first time in this space i have not eaten what I've ordered. My friends and i loved Solstice because it was a great place for a few drinks and some decent appetizers or a meal- we;d probably come here for a last drink or maybe before going to eat somewhere else, but not to eat. Or to talk, maybe because they got rid of a lot of the wood and soft furnishings but its unbelievably loud. I will give them a few more chances as they just opened, but the food can only get better...", 
    "review_date": "2013-04-17"
  }, 
  "Qza0EVW1J_k0u8BIqMRbHQ": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Cara C.", 
    "review_text": "Tater tots. I mean... tater tots. Any way you can imagine them.  We came here for a friend's bday happy hour/dinner. The drink selection was great, the menu is great and their food is pretty darn good. We got a table right away at 6pm (but it got really busy around 8pm- this was a Thursday night). I really liked the atmosphere and the vibe and the location is pretty nice as well.  I would definitely come back here for drinks and dinner as there were several other things on the menu I wanted to try. But I'm telling you- try the tater tots.", 
    "review_date": "2014-01-20"
  }, 
  "x2mNTY-gX06kocOTJiYygA": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "John S.", 
    "review_text": "Went here last night for dinner and drinks....Basically i ordered a Tri Tip which i chewed like gum for 30 mins...its was disgusting and the waitress was a disgrace.....She never came over once to see if we wanted anything...there was 12 of us and she was useless...We spent the whole time looking for her and waiting for drinks....If she had done her job properly, we probably would have spent a couple of 100 dollars more...This place is nothing to write home about...Only go here if you have to.", 
    "review_date": "2013-11-24"
  }, 
  "4RUXeyp_Af2C5t9JFyJlBQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nina Y.", 
    "review_text": "Decent place. Came here after a great lunch, then early happy hour, and this was the last stop of the night. Ton of seating - and on a Wednesday night, it ended up filling up pretty quickly.   I ordered the tatchos. I will say that I wish she had told me (or the menu showed) what the toppings were because I hate olives. HATE OLIVES. and I wish I could have told her none on my dish. My coworkers were a little healthier with the salads, and they looked great (and pretty big as well).   I wish that the waitress had told me that my drink was going to be a little spicy because then I wouldn't have ordered it. It was like a margarita but spicy and it was just awkward. I probably had too much to drink at that point, anyways, that night, so it was a good idea to stop.   BTW, apparently Wild Hare is the name of one of the director's baseball or softball team. Cute.", 
    "review_date": "2013-09-20"
  }, 
  "TRpI4fgC5SAZzjKV2iRSMQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Robyn S.", 
    "review_text": "I live 2 blocks away from Wild Hare and I must admit that it is the main reason I come here so often. Its a central place to meet friends and there is almost always a table available. The staff is nice but the service tends to be a bit slow and the food is just okay.   There are tons of tv's so if you are looking to watch a game, it's a good spot for that.   They are also coming up with new deals, like taco Tuesday, which I believe will be $20 for 20 tacos...we will see how good they are!", 
    "review_date": "2013-11-05"
  }, 
  "K1NLdTfT1IizE-6smhsSug": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ayrn H.", 
    "review_text": "1 star for the food and drinks and extra star for the nice server that is not to blame.   Just walked out of the joint with the worse tummy ache and horrible end to the beginning of my Saturday funday.  Craving a Bloody Mary and so I start off with that. So damn salty it was undrinkable. Returned it and got one of the tequila grapefruit drinks which was okay.   Craving a Ruben sammie. Ordered and was delivered a pile of fat in between white un-toasted bread. So disappointing. Ended up dissecting my lunch just so I could cut apart the meat to separate the massive amounts of fat. It was nasty. Ate the sauerkraut and fries which were decent.  We walked out after the soap dispenser in the bathroom exploded all over my shirt. Just not the best day at Wild Hare. Now home and grumpy with horrible stomach pains. Ugh. Thanks for the waste of money and calories. Not coming back in awhile.", 
    "review_date": "2014-06-21"
  }, 
  "mS-4O56dx6wt5fWxbbx-LQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Priya S.", 
    "review_text": "Love this new Pac Heights hot spot. Maybe I'll finally be motivated to hang out with my Pac Heights friends in their own neighborhood!  It's perfect to unwind after work over some cocktails/beer and some tantalizing bites. It's also perfect to add onto your Friday/Saturday bar hopping spree.   They have a great selection of cocktails - describe what you're in the mood for and your waiter/bartender will guide you to the perfect pick. However, what primarily differentiates Wild Hare from its competitors is the delicious bar food. I tried the fried chicken bucket, mac and cheese and the fish tacos, all of which were equally delicious.   So not only is Wild Hare a watering hole, but its also an eating hole, if that's even a thing. Give it a whirl on your next trip to Pac Heights!  P.S. There are a lot of tables to sit down with large groups of friends so you won't have to stand by the bar during peak hours - total bonus points in my book!", 
    "review_date": "2013-04-18"
  }, 
  "rocDFDgw5uO594m9J_Ztpg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Lauren O.", 
    "review_text": "Used to be a huge fan but on Sunday the service was unforgivable and embarrassing. A party of 10 arrived at 11am on Sunday, we mentioned that we tried to make a reservation but never heard back and they sat us down at the high table in front. We proceeded to order and drink bottomless mimosas (which were small and they were slow to fill them up) for an hour and a half when our waitress came over and said that she made a huge mistake and we were sitting at a reserved table and we had to get up right away. She said we could stand and wait for another table and hold our food (that was already untouched and already getting cold). They continued to apologize but no solution was offered and the manager said that we should still have to pay. We were forced to walk across town and had a delightful brunch and bottomless at Harry's on Fillmore which has way better food anyways. Avoid Wild Hare at all costs.", 
    "review_date": "2014-03-17"
  }, 
  "x1bWGa-W8PXmmKwynf9Rcg": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julia W.", 
    "review_text": "It started off poorly until we met Clare! She was the greatest! Enjoyed our meals and the bottomless mimosas. Basil and blueberry was good!! Fun spot but make sure you get Clare", 
    "review_date": "2014-03-02"
  }, 
  "qoGi6_Yya5PUEZu7gcGbwg": {
    "user_rating": 3.0, 
    "user_location": "Larkspur, CA", 
    "user_name": "Lilia D.", 
    "review_text": "It's a bar with bar food. That said the food is pretty good. Crab jalapeño poppers while not very crab tasting were made with real jalapeños and had quite the ass kick. Fried chicken was slightly sweet, cooked perfectly and of course served in an actual bucket. Grilled cheese wasn't all the way melted but tomato soup was great. Didn't get one of the many tater tot options but will next time. Great music. Punch bowls if that's your thing and beer in jars. Decent for a quick bite and a brew", 
    "review_date": "2013-10-20"
  }, 
  "6ukodHcVxcl2FxlAPPi-tQ": {
    "user_rating": 2.0, 
    "user_location": "SOMA, San Francisco, CA", 
    "user_name": "Daniel D.", 
    "review_text": "Tasty cocktails and delicious food. But when paying $11 for a cocktail, you expect a decent service standard. Our server was MIA for 30 minutes and we had to make an active effort to hail down our server when our glasses emptied. Will not return, would not recommend.", 
    "review_date": "2014-02-15"
  }, 
  "4rscUhRnHPie0Uv3VEcoOQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Meredith R.", 
    "review_text": "I've been in SF long enough to have experienced this space three times. 1st was the best (Razzela's), 2nd was great (Solstice), and sadly, this round has gone down hill. I think if we would just have had drinks, we'd be fine. It's the menu that needs (a lot) of work.  Basically... imagine going to Trader Joe's and buying a bag of pre-washed kale and iceberg lettuce. Now imagine bringing it to the back of a restaurant kitchen, opening it, and pouring half and half of each into a large bowl (and maybe not even freshening it up). Then sprinkle on some parmesan. And some pre-made grilled chicken. And bottled dressing that you don't really toss in. That's their version of a Caesar.  Moving on, imagine buying Trader Joe's mac-n-cheese in bulk and serving it from the microwave from said restaurant kitchen. As in, when it hits the table, it's already gelled.  You get the gist. Burgers were decent (I think someone actually cooked them), corn dogs decent.  Management: You have a wonderful space Wild Hare: please make tasty use of it to match your lovely cocktail menu and bar.", 
    "review_date": "2014-03-04"
  }, 
  "TLJZzsqtDW-loSGsuvTcwg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Adele A.", 
    "review_text": "The only reason I would come back here is for a mediocre happy hour drink.   We got food here and......yuck. The coleslaw was super mayo-filled. The \"tachos\" are gross, a pile of tater tots with fake cheese and crappy canned nacho toppings. We also got the gimmicky \"bucket of fried chicken.\" Four pieces of previously frozen fried chicken came in some circus-looking bucket. The breast was ice cold in the middle and when we sent it back, they just dropped that same piece in the fryer and brought back a super dark re-fried chicken breast.   Yuck.", 
    "review_date": "2013-06-03"
  }, 
  "tlSw5qoLmkNzzEvFXLROog": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Miharu y.", 
    "review_text": "Came with some friends on the weekend.  Unfortunately they do not accept reservations for parties under 10 so we waited for over an hour.  It's a loud atmosphere and caters to those who brunch without really wanting to converse with their friends.   Ordered the totchos, 2 burgers, dungenous scramble and salad. We also ordered drinks. While the drinks, scramble and salad were ok one of the burgers was ordered with no cheese but came with it. When I reminded the staff they took it away and brought it back within a minute and there were still some cheese on it. They just peeled it off - I just hope not with their fingers - oh well....  The service was slow but at least the bottomless mimosas lived up to their names.  Probably will not be back.", 
    "review_date": "2014-04-10"
  }, 
  "l20MTXXZq6ydgig4cPBK3A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jocelyn B.", 
    "review_text": "Wild Hare is supposed to be an ode to Alice and Wonderland, which had me stoked to head down the rabbit hole.   Disappointing at best, Wild Hare leaves almost everything to the imagination. It's almost as if the theme was an afterthought-- it's just like any other bar on divisidero, stuffy, filled with drunk 20-somethings, uninspired. Uninspiring.", 
    "review_date": "2013-05-06"
  }, 
  "37LPw7HeiAa9-fcK5Tp3cg": {
    "user_rating": 2.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Rachel B.", 
    "review_text": "Friends &amp; I purchased a groupon-type deal for this place that was an amazing bargain. For $25, we got two entrees, two bottomless spritzes, and a shot. Normally, the bottomless spritzes alone are $18, so we were excited to use our deal here. Unfortunately the experience was a little disappointing. We arrived around 1115 since we knew from other reviews that this place would be crowded and still ended up waiting about 45 minutes. While we waited, we started our bottomless beverages at the bar, so that helped to make up for it. However, the bar was crowded so we had to stand the entire time. Additionally, a group had reserved a certain number of seats, then told the staff that a certain number wasn't coming, and so the host led us to sit next to them. (Which I wasn't thrilled about, as the tables weren't separated.) Right as he led us down to our seats, the other group responded that the rest of their reservation was, indeed, coming. IMO, if you tell a host that they're not coming, then you lose your reservation, especially in a place with a very long waiting list. However, the host obliged and apologized to us instead and said we would be next up. Fine, whatever. We'll just have another drink. We did sit down about ten minutes later and got immediate refills in our drinks. I didn't really like the champagne they used as it was too bitter and didn't add much flavor besides that. The drinks are truly spritzers, ie, they are not heavy on the taste at all. I was very exciting to try to Hugo but was disappointed. Honestly, they tasted watered down. I will say that they were great about getting us refills, though. The food was unremarkable at best. My friend ordered a veggie scramble and was served a crab scramble. My breakfast burrito arrived cold and didn't have any flavor to it. Country potatoes were meh. My companions had similar experiences with their food, including scrambles, breakfast sandwiches, and the hash. We did, however, love the tater tots - they were fried perfectly and had a great garlic taste to them. They were the favorite. The shot we had was Fireball and was so good we decided to get another round, which I believe cost in the vicinity of $25 (expensive for a low grade liquor.) The place was packed with the typical 20-something mixed bag San Fran crowd. Music was a plus. It was one of those \"hip\" places, you know, where you can go to pick up a one night (day?) stand and hope it turns into something real. We won't return. It's not worth the price or the wait.", 
    "review_date": "2014-03-24"
  }, 
  "sjXC5pTebfGMZzP-9fpxTw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Joshua L.", 
    "review_text": "Bro central with. So. Much. Tater tots. It comes with everything! The rainbow array of mimosas is super classy and awesome.", 
    "review_date": "2013-10-27"
  }, 
  "u_38Wg1EZ0LrysSta5FM7g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Carolyn K.", 
    "review_text": "The Mac and cheese is delicious! The corn dogs dipped in mustard are glorious. The crab jalapeño poppers are uber spicy - watch out!", 
    "review_date": "2014-11-28"
  }, 
  "mgof5X-rGvqsOMKSmsCU_A": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Julia F.", 
    "review_text": "Come on down the rabbit hole! Friendly staff and fun cocktails in a quasi-Alice meets the Queen of Hearts setting. With the Big Buck Hunter Pro arcade and free wifi, this place gets 6 stars in my book.", 
    "review_date": "2014-03-16"
  }, 
  "klPSHRgkCHyNAtGlN1Wuow": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Brendan M.", 
    "review_text": "Lightning with fewer douchebags and much better service. Tip: they play the sound on football games, plus!", 
    "review_date": "2013-12-29"
  }, 
  "MaZ4V9imUIjA6Neqq01fmQ": {
    "user_rating": 5.0, 
    "user_location": "Nevada City, CA", 
    "user_name": "Lynette W.", 
    "review_text": "Went in for Sunday brunch. Food was great. Atmosphere was fun. Service was fantastic . Im 50 and my daughter's 26. It was perfect for both of us.", 
    "review_date": "2014-01-06"
  }, 
  "Z88N6qly3Dp5C06XbZ9IMQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Janice C.", 
    "review_text": "Supposedly, this place should've rocked it being owned by the same guys who started Bullitt, Tonic and Dr. Teeth in the Mission.  The food is not good.  Save for the tater tots and truffled popcorn, everything else was a miss. The burger was a fail ... please don't put a ciabatta bun on a grass fed burger!  Your \"poutine\" needs work.  Your corn dogs are a disgrace!  The drinks?!  I actually liked my Daybreaker made with vodka (gasp!), strawberries and aperol.  But you totally ruined my friend's Old Fashioned by putting cherries and oranges in it.  Obviously, you guys have never seen an episode of Mad Men!  I appreciated the nice service but I basically wasted $80 worth of hard earned cash here. Bring back Solstice instead!", 
    "review_date": "2013-07-03"
  }, 
  "HKC-j6ShF_wUfB0q1BH5cw": {
    "user_rating": 3.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Sebastian F.", 
    "review_text": "Wild Hare, are you a bar, restaurant, brunch place, dating (Tinder!) hot spot, or all of the above? I'm not sure. Apparently it's the number one Tinder bar in the city (if you don't know what Tinder is, good for you).   I'd say get here early on a weekend to continue your clubbing tour from the nite before (loud and pumpin' electro music) and/or keep on drinking (full bar).  On the other hand, you can also get decent brunch/breakfast here (Eggs Benedict, $10) , only the coffee seems a bit overpriced ($4.50 per cup). Portion size was good and food came super fast.  Downside: the service - waited for about 20 minutes without being recognized by the one waitress serving the whole place, which wasn't packed at all at 11.30am on a Sunday.   The bar is intriguing though and I'll definitely give it a shot next time (literally).", 
    "review_date": "2014-07-27"
  }, 
  "rVs5Ttf3TcjX952G289c9w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina C.", 
    "review_text": "Was in the neighborhood and wanted a drink after a hot day and shopping haha. Stumbled into Wild Hare and was very, very pleased. Really hard to get seats (there was a Giants/Niners game on), but I enjoyed their Greyhound (with freshly squeezed grapefruit juice) and they had these amazing tator tots. I think they were their tator tot nachos (instead of nachos, they used tator tots, which I'd much rather eat.) Nom nom nom!", 
    "review_date": "2014-10-24"
  }, 
  "iFXMgBuqkF6w9cIIqpBS3A": {
    "user_rating": 3.0, 
    "user_location": "Foster City, CA", 
    "user_name": "Courtney O.", 
    "review_text": "I had my first experience at Wild Hare this past Labor Day weekend &amp; it was interesting. Not great, not horrible, but just OK.  We went for bottomless mimosa/spritzer brunch on Saturday at 12pm. The place was completely dead, which I thought was weird (but it was a 3-day weekend, so that explains it). But since the place was dead, you would think the service would be great, right? NOT THE CASE.  The service was slow &amp; shotty. Our waitress while really nice but ordered 1/2 the tables food at one time, then did the other half at another point. Weird. Then, for bottomless mimosas I constantly had to ask for refills. What's the whole point of BOTTOMLESS if I'm constantly asking for refills? Sorry for being a whiny B, but I'm trying to get day drunk!  The food &amp; drinks (when I had one) were pretty good! Big menu with lots of options for all diets. I ordered Chipotle Eggs Benedict &amp; it was delish! My friend also ordered Totchos to share and they were SO GOOD! I also enjoyed the variety of spritzers -- my favorite was The Hugo.   We stayed all afternoon until bottomless ended (3PM) &amp; I left happy, but not drunk like I have at other restaurants. While the food was good &amp; they had a good variety of things available, I'll probably go elsewhere for bottomless &amp; brunch in the future!", 
    "review_date": "2014-09-03"
  }, 
  "hJ6oyFylKAE004-6IbdezQ": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike W.", 
    "review_text": "I came here with the wife and friends. They kindly accepted two groupons which was awesome. The service I have to admit made up for what was lacking. The people working there are sooo happy and wow talk about never letter your bottomless mimosa sit empty. They kept filling it even without asking.  The bad parts. I really wanted to love this place location great! Drinks and libations great! Nice digs inside, meh it was nice especially with the tvs and a great bar counter, service fantastic! food so-so. Sigh the food sounded sooo good on the menu. Friends did enjoy their breakfast sandwich and veggie omelet. I had the bis cuts and gravy, hmm bis cut was tepid at best but fresh but the gravy was cold and egg not that hot either. Wife had the marscapone french toast which was a mess and soggy. Eeeh the drinks made up for it and the fantastic service. I mean like amazing service.  I do definitely want to stop by for the taco Tuesdays!", 
    "review_date": "2013-11-18"
  }, 
  "xdRwm7nreWcnRI27-Vtnmw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Chris B.", 
    "review_text": "Staff was super nice and a lot of fun.  The drinks were delicious and they were playing great music for the atmosphere.  I would totally come back to bring a group of friends before we head out or for the whole night.", 
    "review_date": "2014-06-30"
  }, 
  "NGdzcR5RaB_nVXaIBF1UJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Stephanie T.", 
    "review_text": "Purchased a LivingSocial- totally worth it! Wasn't too crowded at noon on a random Sunday, about half the rather large restaurant was filled.  I got the crab omelette, which honestly wasn't my favorite (hence the minus 1 star) though recommended by the waitress. Barely any crab, very saucy. I don't know. My friends ordered the beet/goat cheese salad with grilled chicken, however, and that was DELICIOUS. Coming back next time for that.  Bottomless mimosas were great since there are multiple bellinis/mimosas you can order, and the waitress kept coming around. We were in a huge group and they accommodated us! We also got a Fireball shot w/the LivingSocial.  I would come back without the LivingSocial deal, since service is great, the salads seem delicious, and the atmosphere is a great fun brunch place in Pac Heights. No complaints, very typical brunch-SF-SundayFunday feel!", 
    "review_date": "2013-12-28"
  }, 
  "UQFE3BT1rsIYrcDvu_XVow": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Mike V.", 
    "review_text": "New name, same \"first date\" spot. Loud and lively.  but for some reason, they have the heat up to an abnormally high level.  yes, we all know the rule about raising the temp and people take off more clothes, but seriously, it's like EIGHTY in here.   can we bring bathing suits tomorrow night?  (indoor pool, just a suggestion)", 
    "review_date": "2013-10-05"
  }, 
  "kCQRWc_C4F8pgQE_yVp1KQ": {
    "user_rating": 4.0, 
    "user_location": "Petaluma, CA", 
    "user_name": "Rick W.", 
    "review_text": "Really enjoyed the evening @ wild hare. Service was friendly and attentive. Surf and turf lettuce cup appetizer was excellent especially with a dab of Louisiana hot sauce. Battered fish tacos were well prepared, light and tasty even though I usually like the fish grilled. I would have preferred a broader beer selection but the 4 on tap were adequate. Also, the chopped salad could included more ingredients but nonetheless was fresh and a nice complement to the rest of the meal. Atmosphere was fun and lively. TVs were showing a couple ballgames so all was well. Definitely a solid thumbs up.", 
    "review_date": "2013-09-14"
  }
}