{
  "nF-UM092NAxzdGqERXGZLw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "T.J. H.", 
    "review_text": "This is a new-ish bar, located where Root Thai used to be (very briefly, not sure what happened).  I've been here twice now for happy hour since we live nearby and have really liked it so far.  Their drink theme is a bar and a shot - mostly separate, but also a few that are mixed.  My personal favorite is the Black Butte Porter and Ancho Reyes.  Food-wise, it's pretty good bar food.  We really like the loaded tater tots and I like the dry chicken wings (my girlfriend prefers saucy wings).  The prices a bit high and the happy hour deals aren't anything special, but it's SOMA so we're used to it.", 
    "review_date": "2014-07-01"
  }, 
  "a1-PwqYjCRTK_vC4Y3azIg": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "May Y.", 
    "review_text": "They have some good specials, good food.  But waitresses seemed giving us pressure and felt uncomfortable.", 
    "review_date": "2014-04-17"
  }, 
  "dkkMQorZE0EF-F5wOiqA7w": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Danielle V.", 
    "review_text": "3.7 stars for me.   I went to meet a friend here who had just returned from Mt. Everest. It was great to catch up with her.   Since there wasn't a Giants game it wasn't packed, but it wasn't empty either. Perfect spot to gather with co workers or enjoy a beer. I would check to make sure there isn't a game before heading here. (Unless of course, you are looking for a close spot to the stadium to have a beer before YOU are going to a game)  I had the wheat rascal, which I enjoyed, not too sweet. Service was excellent.   The food looked delicious for what it was. My party ordered the tater tots and the sliders. I had one tot which was delicious. The menu was good, prices seemed reasonable. My only problem was that there was no option to order something healthy.  A side of broccoli would have been great, a soup? Small salad? Asparagus? Sautéed Brussel Sprouts? All of these would be a compliment to the other food already on the menu.   I would go back, especially if I was with a party who wanted to order beer and fancy bar food.", 
    "review_date": "2014-05-09"
  }, 
  "i5h0mqGsqtOerEa05ar-Vw": {
    "user_rating": 5.0, 
    "user_location": "Chino, CA", 
    "user_name": "Shalay C.", 
    "review_text": "Fantastic bar with an even better bartender. We were in San Francisco for about 24 hours while on a road trip. After leaving the Giants game, we stumbled upon this place and hoped it would fulfill our wish for creative cocktails and a cool vibe. Woodbury was exactly what we hoped it would be.   I always call myself a \"beer and wine kinda girl,\" not because I don't like cocktails, but because I'm so damn picky about them. I don't like sweet. I don't like sour. I don't like the taste of vodka. A sour apple martini basically makes me want to puke. This is pretty much what I told the bartender, Kinson. (See, my experience was so good, I made sure to get his name before we left, knowing I had to write a review when I got home.)  Anyway, Kinson whipped me up something that was the perfect balance of fresh and spicy. I can't exactly remember what it was, but I know it had basil in it. A lot of drinks followed, each one more inventive than the last. Each person in my group had at least 2 or 3 drinks, and our bill was half of what we expected it to be. We walked out feeling like we hit the jackpot of all bars. Too bad I live in So Cal and won't be going back any time soon, but I definitely recommend it if you're in the area.", 
    "review_date": "2014-07-10"
  }, 
  "P5bUL3Engv-2z6kKohB6qQ": {
    "user_rating": 4.0, 
    "user_location": "South Bay, CA", 
    "user_name": "Kim N.", 
    "review_text": "I enjoyed the Alchemist the last time I was in the area so I figure I'd check out the groups new concept in Woodbury. Met a bunch of old co-workers after they attended some conference nearby,. I got their a bit earlier than them and caught both a Warriors and Giants game on the tvs. Then I found something more fascinating: two people busting out Mortal Kombat and Mario Kart on the video game consoles. Now that's cool. They've got two separate bar areas and have some interesting ideas in the drink dept. A \"Pop In\" menu where they have beers with liquor floats and spirits \"paired\" with beers in complementary fashion. Went with the Oaktown Brown Ale and Averna Amaro float and it was pretty tasty. When the crew showed up we ordered a ton of the menu. Loaded poutine (with skirt steak/bacon), loaded tater tots (with 4505 hot dog). sliders, Woodbury burger, Dry Rub chicken wings. Everything was solid but I really liked the tots and wings. Bree our server took really good care of us and for a 2nd night open they seemed pretty steady. Im imagining the game crowds before hand must have been torture, so Im glad we caught the mellow time while the game was going on", 
    "review_date": "2014-04-17"
  }, 
  "9B2b-oSQbSryBYvkxX5pIQ": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Gina G.", 
    "review_text": "What do you do once 5:00 pm (4:30 for me, whoo) hits on a Friday?! Go to the nearest bar and beer yourself.  I've been to this spot when it was previously the Thai restaurant, but coming into Woodbury for the first time gave off a whole different feel. It is much better use of space with ample booths, standing tables and seating along both bars. The decor makes it feel very rustic/hipsterish...stuffed animal heads hanging on the walls, unicycle looking chairs at the bar and to my surprise, the coolest thing I've probably seen in any bar was an original Ninetendo game console with Street Fighter playing. Whaaat?! I'm sure the rest of you 90s babies would go crazy for this as well.  My coworkers originally were supposed to go the The Alchemist bar next door but since they weren't open yet, we decided to grab a drink here and check it out. It was still fairly empty but we still sat ourselves in the back bar where there was more space. We saw the beer and shot specials and went straight for those. $8 for a shot of tequila and a modelo, not bad! By the time it was well past 5:00pm, next door was open but we literally came back here in less than 5 mins because it was so dead next door, plus they had the 80s/90s jams playing, the type that'll make you do a couple body rolls here and there.  We didn't bother looking at the menu for any beers or cocktails and just went for another round of the beer and shots. At this time, spots were well taken over all over the place and I would only expect it to get more crowded on game days. I definitely would come back and try more on the menu, happy hour from 5-7. Good vibes here!", 
    "review_date": "2014-07-14"
  }, 
  "WDsr8RnPqbceR3s2yZYr3Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Aaron M.", 
    "review_text": "Yessss they really have old school video games like Street Fighter!  And Poutine?  Sort of.  Instead of cheese curds they serve it with Ricotta cheese.  OK.  But what really made it money was getting it \"loaded\" which added skirt steak (YUMMMM the seasoning!!) and some bacon (just OK).  They also had Black Butte on tap which is one of the best dark beers ever.  And a mini (7 oz!) Pacifico which is almost too cute for words.", 
    "review_date": "2014-09-26"
  }, 
  "CCNT9Hx9E2iLoLQ3zT6Hxw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Reyana F.", 
    "review_text": "this place is... interesting.  i don't really think the people who made this bar know what they wanted to do judging from the deer/moose heads on the walls, to the beer and shot and tater tot menu, to the super nintendo and atari games in the corner. but hey i'm not complaining!  anywhere where can get a shot of whiskey, modelo, chili cheese tater tots while kicking ass in street fighter i'm down for. and it's right in soma so super close to work, i'm happy.  service is a little slow, but it's a hipster bar! it all makes sense!", 
    "review_date": "2014-08-19"
  }, 
  "eZNhFI6m07dvu1zfLfJc-g": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Nancy N.", 
    "review_text": "Great new pub in the area with delicious bar bites. There's plenty of tables in a very spacious area so it's a great spot for happy hour. Their bar stools looks like unicycles!! So cool!  The chili cheese tots and the regular loaded tots were delicious! Highly recommend getting that. One thing I was surprise to find here is the Frito Pie! These are so popular in the east coast and I'm so glad I can find it in my hometown in the west coast. Frito Pie was delicious as well. Dry rub wings was blasting with flavors.   Staff are friendly and they have a host for your table so don't worry about having to go to the bar to order. Tables are first come first serve; help yourself.", 
    "review_date": "2014-08-23"
  }, 
  "PoK0M9esGH35nHbNYKQaaw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt P.", 
    "review_text": "I crave the POUTINE!!!  And beating everyone else here at Street Fighter 2.  I beat the owner and he had to walk out of the bar ashamed and sad.  I love this place - it's very comfortable and I will be here many more times.!  Kinson is baddass!!", 
    "review_date": "2014-09-26"
  }, 
  "9FGshBE-kMrIeYmhKTVWxg": {
    "user_rating": 5.0, 
    "user_location": "Downtown, San Jose, CA", 
    "user_name": "Melissa D.", 
    "review_text": "I organize my company's happy hours and we LOVE this place. This place is so stunning. Great location, within walking distance to the Caltrain station and ATT park. Full bar with excellent beer menu. The bites are scrumptious: my favorites were the mini burgers, and the faux vegan sushi roll. Also, we got to compete against each other playing old-school video games for free! How awesome is that?!   Service is outstanding too. The managers always make sure to stop by your table and make sure you are enjoying yourself.   This is a great stop. We will be coming back frequently.", 
    "review_date": "2014-06-02"
  }, 
  "y6I7waddCQUpHKelJ9sC2g": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Beatrice W.", 
    "review_text": "I wasn't that interested in their beer selection and it was the end of the night so my liver couldn't handle a beer and a shot, so I just tried the food.  The tots were great, nice and crispy.  The dry wings were pretty good - very crispy skinned, but the seasoning was just mediocre.  The loaded poutine was huge (well, I suppose it WAS the cost of an entree!) and was overall pretty good but just needed a little more salt.     I feel like Woodbury is more of a party scene for a younger crowd or rowdy Giants fans.  I encounter enough drunken Giants fans on my Caltrain commute, so personally, I'll be at the classier Alchemist upstairs.", 
    "review_date": "2014-05-03"
  }, 
  "O_0yNszoWjH3oZ0J5DZEXA": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Matt F.", 
    "review_text": "This will be the 4th place in 3 years at this location. Is it all the same owner, just trying to rebrand?? The food is never that good, and this place hasn't changed. The food is a 3.5 but the service was soo bad. Somehow it was packed and it took forever to get our food. And my girlfriends dish was cold. Lame.  Add a cool happy hour!!", 
    "review_date": "2014-07-16"
  }, 
  "1ncQ1FQYSKVUJAW6Yndlhg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "G L.", 
    "review_text": "Finally.... a real restaurant with real food and a real atmosphere. It just goes to show you the difference between posers and professionals.  Food still needs refinement.  But it's only their 2nd day.  Atmosphere....simple and inviting.   Staff....still needs to pay more attention.  But, again, it's only their 2nd day.   Way better than 3rd Street Bar and Grill....and you don't have to deal with a grumpy old waitress/owner with an ego.  My favorite appetizers are the beer and shots!  This place is your local hangout just to meet, eat and have fun!", 
    "review_date": "2014-04-18"
  }, 
  "6wDflRlPFOM_I3QVoVQaZA": {
    "user_rating": 5.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Tommy H.", 
    "review_text": "Stopped in on a slower night, Met Kinson who was working. Made me and my friends feel like we were old friends. Had a blast and he made great drinks as well. These are the type of people that make a spot great! Grab some drinks and get nostalgic and play some mario cart", 
    "review_date": "2015-01-05"
  }, 
  "djxnI8Ux8ZYQJhiOQkrRhA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Abby S.", 
    "review_text": "Shots 'n' tots! That's what Woodbury is good for - whether it's a post-work happy hour or a special celebration. Or you just need to get messed up.  Though it might sound like a good idea at the time, tequila and chili cheese don't sit well in the stomach. Even fast food junkies can agree it's a bad combo.   Happy hour? Yes! Dinner? Nope. Make this a first stop of your afternoon/evening and eventually stumble to somewhere with non-greasy bites and you'll be ok!", 
    "review_date": "2014-10-14"
  }, 
  "imivnF0CzhXf0Eco1mQbTw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Drew L.", 
    "review_text": "Chill spacious bar and drinks were decent. +1 star for the working SNES.", 
    "review_date": "2014-11-03"
  }, 
  "qstOF_b3pvyVPyq4Qsyw-A": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "edward k.", 
    "review_text": "Another great new bar! This place used to be a Thai restaurant but clearly, it wasn't doing well. Now that the owners of Alchemist took it over up stairs, they turned it into an awesome new bar with great bar food and wait for it.... SNES and Atari video games! The vibe of this place is a lot more laid back and has ESPN on which is always nice if you ask me. They have two full bars and the place is pretty spacious with plenty of seating. I highly recommend coming here for HH or before a giants game.", 
    "review_date": "2014-05-24"
  }, 
  "XLVebrhL5n2ePfE7GUN_VA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura M.", 
    "review_text": "Stopped in here on July 3rd right about happy hour- with a holiday - it's almost like a Friday night. The atmosphere was good, nice decor - I love bench seating across the back of the bar. It was full, but not too crowded and we were able to find a seat. Like most bars these days the design looks snazzy, but also makes for a loud venue if trying to talk - but I figure that's expected.  They were out of the mushroom burger which made me sad, but I got the salad with the savory almonds &amp; poached egg - a poached egg makes everything more awesome.  My guy had the basic cheese burger and it was tasty - the fries - of which I stole TWO were good - crispy but not skinny. I was a fan.  Our friend had the spicy brat which she said was delicious too. We also had beer and cocktails - I love a Paloma (tequila and grapefruit) - Everything was good and fresh - some reviews say it's pricy, but it seems pretty normal for SF to me. The standout was our service. Jamie M (I think) was super nice and attentive -offering suggestions and keeping the water and the cocktails flowing.     Oh and while it was full at 5-6-7pm - by 8-9-10 it wasn't very full - maybe that's the holiday and no game, but it was totally chill and the guy girl ratio was most certainly in favor of the ladies.   We will be back - thanks for a nice easy fun evening out.", 
    "review_date": "2014-07-04"
  }, 
  "bZulaajLvMzYFvb604pugQ": {
    "user_rating": 5.0, 
    "user_location": "Danville, CA", 
    "user_name": "Marc R.", 
    "review_text": "A great addition to the ballpark area. Wings were really great and enjoyed the drinks. Wish I could remember which ones. . .  Our server, Brie, was really top notch.   The atmosphere is casual and very cool. The moose on the wall is a nice touch.   I'll be brining my team back again soon.", 
    "review_date": "2014-07-19"
  }, 
  "HqJWYdsJ8zF4cINpe6ekuw": {
    "user_rating": 2.0, 
    "user_location": "Novato, CA", 
    "user_name": "JM G.", 
    "review_text": "Highly NOT recommended!  For starters, the drinks were horrible. We asked for a Moscow Mule and received in return something far off from that (and of course, NO copper cup in case you were wondering!) We also were interested in a shot of Fireball but instead the bartender informed us that they did not have that and instead made us their substitute drink. By that I mean whiskey with chili flakes. One of the most disgusting things I've ever tasted!!  Second, my next complaint comes from my experience with the bouncer. I happened to walk into a stall with puke everywhere. The guy before me yacked everywhere in the restroom. Unfortunately the bouncer happened to walk in one person late and blamed me for the mess. I denied the incident and he proceeded to escalate and kicked me out. How about instead of worrying about throwing people out who just spent an arm and a leg on your disgusting drinks, you worry about cleaning up your restrooms? Wasn't going to continue to argue so my group of friends left. If I'm going to yack, Id own it. But at least in the end, I'm not the one who gets to clean the restroom - Poor guy.    I will admit, however, that any bar with a video game system is a plus. So that, and only that, will this bar earn TWO stars.", 
    "review_date": "2014-09-21"
  }, 
  "gZmEZvZwLJH7JiQfIdbkRQ": {
    "user_rating": 4.0, 
    "user_location": "Milpitas, CA", 
    "user_name": "Joe N.", 
    "review_text": "This bar is dope! We left the bar upstairs and walked into Woodbury and felt like this is where we belonged all along! They were playing gangsta rap, had TVs with sports on, TVs with video games on, and the vibe was on point. Great drinks like the bar upstairs but a more lively surrounding. I'll definitely be back to try their food items and to kick it again and again.", 
    "review_date": "2014-05-28"
  }, 
  "ihKIv3lo8IFz7O-djya-fQ": {
    "user_rating": 2.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Derrick S.", 
    "review_text": "Let me start off by saying, when I first walked into this place last weekend, I loved it. The atmosphere is super nice - a bit dark, with dark wood everywhere - just looks really nice. One look at the menu and again, awesome - they have beer and shots in one drink, or pair them up based on what goes well together. And then, I saw the video games! Who doesn't love a place that has Mario Kart on Super NES at a bar? Sounds great, right?   Well, I've now had two service-oriented issues that took my 5-star rating down to 2 - a shame.  Long story short, the first time I was there, my friends and I were ready to pay up, but were told that the POS is down and they can't take credit cards. I get it, that happens... but to wait until we're done and then tell us is super inconvenient. I told this to the bartender (instead of just running home to post it on Yelp), but he could have cared less.  Then... this weekend... I went back. Arrived at 6:45 and the door was locked (which was odd since we were there at the exact same time the week before - and, Yelp showed the opening time as 6:30). A couple of seconds later, an employee opened the door and let us in, saying they just opened. Great! Well, we sat down at the bar, and the bartender refused to serve us until 7 - he made the comment that they're closed and just ignored us until 7:01. A couple of other people walked in and didn't know what to do. They asked if they could at least sit down he was ready, and he just kind of shrugged and said \"I guess, but I'm not serving anyone until 7\". Sure enough, we sat there and watched him peel oranges and stock fridges. Then at 7:01, he asked us what he can get for us - almost as if we just walked in the door. It was odd, and was very poor service. I get it - you don't open until 7 - well adjust your hours online, and at the very least, tell your doorman not to let people in the bar.  Hopefully this can be addressed. If so, the place is definitely worth visiting.", 
    "review_date": "2014-08-10"
  }, 
  "u9puWE0vMhedUrIFjOQk0Q": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Ayele A.", 
    "review_text": "This is a cool neighborhood bar. Really good cocktails, you can also get a beer and a shot with top shelf alcohol for $10. They also have super Mario on big screens in the back. The bar stools also have peddles - my one complaint is that they don't move so I can't work out while I'm boozing.", 
    "review_date": "2014-06-26"
  }, 
  "R1Be4mB4AexoUYtglHtUng": {
    "user_rating": 4.0, 
    "user_location": "Daly City, CA", 
    "user_name": "Kathleene E.", 
    "review_text": "Came here before going to the Bey-Z concert a few weeks back. Arrive around 6pm, just in time for happy hour, yay! Ordered two blue moons ($6 HH price) and the loaded tator tots ( [~$12] cheese, ground beef, green onions) and it was amazing paired with beer. After about an hour people getting off work and wanting to get a drink started coming in and by 7pm the place was jam-packed!   It was pretty difficult getting a seat in this place, but managed to get a little spot at the bar thanks to the bartender with the curly hair and cool necklace (right on, dude!)   Overall, cool spot to hang out before heading for a night out on the pier/ ballpark/ etc. I definitely will be coming back to have more of those delicious tots and try the rest of the menu.", 
    "review_date": "2014-08-18"
  }, 
  "luyUrnNhffCOHtVMhwnknQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "stephani p.", 
    "review_text": "Was lucky enough to attend the pre-opening party at Woodbury last night. As a perfect compliment to its sister bar, Alchemist, it fills in the gaps that you might not find upstairs... Woodbury has T.V.'s, video games, snacks, lots of beer, and a Moose head! Can't wait to go back!", 
    "review_date": "2014-04-14"
  }, 
  "vjwLL41-EOQQkLSonUMdGw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Johnny W.", 
    "review_text": "Been meaning to check out the new kid on the block for a while, especially since I roll past them every day to and from work. Finally dropped in a few weeks ago for a friend's friend's birthday party, and got to check out the space.  Turns out that this is actually run by the same people who run The Alchemist upstairs, which I'm a fan of. And while I didn't try much of the food (took some nibbles from the fries and tots, which were solid), and sort of cheated with the drink (one of the guys I know from the Alchemist made me an off-menu cocktail, since they mostly focus on beer and straight liquor here), I thought Woodbury was a pretty solid space overall, if not a bit on the loud side - whether or not this was because we came in on a game night, I can't say.  A solid three stars, only because I'm a fan of fancy cocktails and places that are a bit more conducive to non-shouting conversations, and Woodbury doesn't cater to that really. If you like something a bit more pub-y though, definitely come check it out.  ***Accessibility Info***  Venue - Plenty of space to maneuver about, until it gets crowded anyway. Unfortunately, from what I recall, all the seating is bar counter height.  Bathroom - Didn't check them out.", 
    "review_date": "2014-06-11"
  }, 
  "ljHsu7YzZmN7JaNrI9aciQ": {
    "user_rating": 4.0, 
    "user_location": "San Bruno, CA", 
    "user_name": "Katie H.", 
    "review_text": "Went there for the first time for happy hour with mom and sister.  My sister beat us there by almost an hour, and said the place was awesome when we arrived.  We were greeted by a nice enough bartender.  I saw Dogfish head 90 minute IPA and excitedly ordered.  Small mason jar, but hey, it's strong beer.  Mom didn't know what she wanted.    Asked bartender for Mexican coffee... He checked, they don't have coffee.  Ok fine.  Mom looked behind the bar at the \"just the classics\" liquor, and asked what kind of martinis he could make her.  Bartender said \"well, it can have gin, or vodka, and vermouth...\", not understanding.  I ordered her a cosmo.  He made a damn good one.  Mom asked \"so what's the happy hour price for this?\". Bartender says it's not part of happy hour.  I pointed out that we ordered a well cosmo, and well drinks are discounted.  Female bartender stepped in, easily  and confidently saying it's $2 off.  Fine, cool, whatever.  Maybe he's new...    Mom ordered mushroom sandwich, she said it was tasty. Her salt and peppered fries were awesome.  Sister and I ordered loaded poutine.  Mushroom gravy was overseasoned with a mystery ingredient, but overall yummy.  I had a full conversation with male bartender about my desire for jalapenos, and after confirming he had some, they never came.   Sister also ordered the bratwurst sausage, which she was looking forward to, but never came.  Isok, half order of poutine was enough food after all.  Food was good, little overpriced for what we got, and no happy hour food specials like we had hoped for.    Sister and I agreed to go back a little later next time, as it started to fill up as we were leaving, and just drink beer, eat fries, and be open to the scene.", 
    "review_date": "2014-07-14"
  }, 
  "MZrXqCuPRipOunniNNUs5w": {
    "user_rating": 5.0, 
    "user_location": "Arden-Arcade, Sacramento, CA", 
    "user_name": "Nichole P.", 
    "review_text": "This place is super close to home, we have been here a few times! Bar-tending and wait staff are awesome and super friendly. Always suggesting drinks and making creative new ones. Taste the watermelon pepper shooter it's amazing! Not sure what's it's called. But it's awesome!!   Food and ambiance is good, defiantly bar food. Tater tots are great.  Beware on giants game days! It gets pretty packed :-)", 
    "review_date": "2014-07-20"
  }, 
  "H_DAhIymP_8kpu1kw07Xtw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Christina L.", 
    "review_text": "i was really happy with this place!  have bookmarked it for a while now, and was excited to stop by last night for drinks with a girlfriend. the bartenders were really chill and friendly, and the foood was delicious!  we got shishito peppers, the dry rubbed wings, and fries - which were SOoooOoo crunchy and thicker cut and the dipping sauces were great. practically everything comes with dipping sauces.  we also ordereed a bottle of wine, and the glasses are mini mason jars, which was interesting!    a friend ordered the mac n cheese sandwich and the brussels, which also looked quite nomsies.  anyhoo - will be back soon hopefully to try other things, especially since it's right around the corner from my apartment!", 
    "review_date": "2014-12-31"
  }, 
  "PcEA6B2wN1j0ejKzSlSOzw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sneha P.", 
    "review_text": "Cool place, weird seating that isn't comfortable, and good wings. I asked for a whiskey neat and got 5-6 fingers which was surprising and excessive. So guess order for whiskey neat for two people? I'm not complaining. : ) I doubt it'll happen again anyway.   Service was decent. The servers were busy but did their best to help and were friendly. I'd definitely go back to try the food and see how much whiskey I get this time around..", 
    "review_date": "2014-07-26"
  }, 
  "f3JJczzAPLSbDdHmYEjKTg": {
    "user_rating": 3.0, 
    "user_location": "San Jose, CA", 
    "user_name": "Sarah H.", 
    "review_text": "Me and a friend were on our way to SF giants game and came across this little gem! Honestly it was the 6$ mimosa sign they had that steered me right in! lol! So both of us ordered the mimosa's which were poured into a slender mason jar! pretty neat and strong ;p ! and then ordered the breakfast...we got the basic eggs, bacon,and all that other jazz. I was definitely admiring the moose heads and shot bar near the back...it kinda gave me a feel of a game of thrones bar...lol..I immediately thought of king baratheon...anyway I can see how this place may be popular since AT&amp;T park is 2blocks away...the only thing I wish this joint had, is bigger flat screens, if your sitting directly across from the bar, the TV is not big enough to see score and the game too much...I found myself squinting...anyway I see myself stopping by again no doubt..but mainly for drinks and the shot bar next round!", 
    "review_date": "2014-05-02"
  }, 
  "-bu2wcgpVdLNd8_kLmun4g": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "sole a.", 
    "review_text": "Let's see... Mouth-watering sliders, ridiculously good gluten-free wings, video games, delicious cocktails, and a separate bar where you can order beer and shot if you don't want to wait for me to get my fancy drink, really nice wood design throughout, lots of seating (I have no patience for crowded bars that force me to stand and balance my drink), excellent game-watching screens that manage not to make it feel like a sports bar (oh, it is also around the corner from the ballpark so perfect pre/post gaming), what else...?  Oh! Did I mention the food?!", 
    "review_date": "2014-04-14"
  }, 
  "kRyDAgbXZWHCs4b3WquxKA": {
    "user_rating": 3.0, 
    "user_location": "Los Angeles, CA", 
    "user_name": "Alvin C.", 
    "review_text": "I would've given it five stars based on my past visits but my last visit left me feeling annoyed. Bartender was rude and gruff considering how empty the place was. I had asked for something they didn't carry apparently--but I know they had it previously based on my past visits.   Otherwise, the place is fun. Good bar food. Tater tots are amazing especially when loaded.", 
    "review_date": "2014-12-30"
  }, 
  "n2lKPfuoSoUl3lRY9RPZ5A": {
    "user_rating": 3.0, 
    "user_location": "West Los Angeles, CA", 
    "user_name": "David W.", 
    "review_text": "So my main gripe here is that the bartender never returned my credit card. Yes it is my fault for forgetting to get my credit card, but the bartender just assumed that I was going to keep a tab and never asked me (I have a bad short-term memory and usually always never keep a tab for fear of forgetting my card).   Other than that...the place seems to be a nice chill place to grab a few drinks and see some old (new) friends. However, the music was way too loud for a bar...there was no dance floor...so it might be wise to lower the music so people can actually hear each other.  I wasn't sure if there was a special or not, but I got charged $8 for just a blue moon. Pretty pricey for just a beer.  I did have a good time as I saw a bunch of old friends. But I'm not sure if I would come back given the aforementioned.", 
    "review_date": "2014-05-21"
  }, 
  "rO2YKN1PqAJjd6YgP0PM0A": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Karen S.", 
    "review_text": "Ok I get that they just opened. and there was a Giants game...I feel like this place will only get crowded because of the proximity to AT&amp;T Park.  Pros: Strong drinks. Comped our SUPER SALTY shroom burger b/c it took 40 minutes.   Cons: No Happy Hour. People next to us got their fried food/sliders way before us when we ordered 20 min before them. Same thing with table on the other side of us. Took about 3 asks to get water.", 
    "review_date": "2014-04-16"
  }, 
  "LPic4zdfo7Ai6rDbu6fTMQ": {
    "user_rating": 2.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Emily H.", 
    "review_text": "I really wanted this place to be great because I live a block away. Cool location and decor (like the bike tile/pedals stools). But the margarita drink of the day was really sweet with no salt option. The food was all bland and dry(!), especially for what should be flavorful, indulgent bar food: jalapeño cornbread (with weird cheese whiz butter), poutine fully loaded (with stouffers-box tasting gravy) and trio of sliders (one of them is literally bacon and bun, not in a good way)...unfortunate.", 
    "review_date": "2014-06-17"
  }, 
  "I-FmdvI28N7OIIt4JZOgIg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tiffany D.", 
    "review_text": "Fun and chill bar!  Video games, beer in mason jars and TV for the Giants game or whatever games that are going on!  They serve up bar food too!  Extra perks to just linger and have a good time!", 
    "review_date": "2014-10-17"
  }, 
  "AxyeEvYviF1Zh8-phpnNHw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Coco F.", 
    "review_text": "I was there, I guess day 3? No usual opening hiccups, for me and my friends.  Nothing but great beer, great food , great whiskey and unbelievably friendly service.  We had about 3 different servers at various times and all of them were incredibly gracious and friendly, without being fake. Will definitely be going back on a regular basis, just need a payday first. :-)", 
    "review_date": "2014-04-19"
  }, 
  "5l_CvfZLe-IKI8pPN11tCA": {
    "user_rating": 4.0, 
    "user_location": "Sacramento, CA", 
    "user_name": "Wendie R.", 
    "review_text": "Awesome stools - 5 stars.  No stout - zip, zero, zilch stars.   When I sat down I was greeted and told that they don't open for another 15 minutes.  It was 4:45pm.  I guess I am not in Sacto anymore where even the liquor stores have \"happy hour\".  So, he was kind enough to let me watch tv and use the restroom until they opened.  I asked for a stout and ended up with an Anchor IPA.  The menu looked good, but I can't share a review on that because I only came here for the beer.  I am sure this place is rockin' after a baseball game because of its location.  I am a cyclist and totally love the bar stools!", 
    "review_date": "2014-11-21"
  }, 
  "a2f1XlIspFS0yz5mRSySfw": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Jay S.", 
    "review_text": "My industry friends talked the place up but I found the service dismissive. The bartender can only walk by so many times before you realize it's something personal or extreme incompetence. The staff simply didn't want to work. I'd rather spend my money where they acknowledge I'm trying to spend my money. I suppose if you're the sort of douchebag that likes to yell at the bartender \"Hey, Buddy!\" You'll be fine. Enjoy.", 
    "review_date": "2014-10-15"
  }, 
  "lhOnk5bwc_U9lt6P1HkMUg": {
    "user_rating": 4.0, 
    "user_location": "Millbrae, CA", 
    "user_name": "Ian J.", 
    "review_text": "Definitely a cool place. The wings were a solid choice and the burrs are great. They have some awesome and personable people on staff too. 100% vibes", 
    "review_date": "2014-06-28"
  }, 
  "evBgHn0yiLMAVMoaCy6W9g": {
    "user_rating": 4.0, 
    "user_location": "Emeryville, CA", 
    "user_name": "Ray R.", 
    "review_text": "awesome place for a drink and some grub. They have the best grilled cheese, honest. Only thing they are City prices. :)  The beer come in small glasses but if your in for a drink watch a little tv and lounge, its a must stop by", 
    "review_date": "2014-08-01"
  }, 
  "HHml91c4FCfutBuRNJTvDg": {
    "user_rating": 3.0, 
    "user_location": "Santa Clara, CA", 
    "user_name": "Casilda M.", 
    "review_text": "cool atmosphere pricey drinks poor service worthy of a 3 star rating wish they would be more attentive to the guest you have to approachnthe bar for anything you need no service at the tables avoid the loaded tots the bonita flakes are sooo fishy!", 
    "review_date": "2015-01-31"
  }, 
  "eUmVXP9UnoWtz9NSBwY4jA": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "phil h.", 
    "review_text": "The first thing we noticed at Woodbury was that new bar scent. I'm sure it will dissipate after another Giants homestand or two but for us it was the perfect spot to meet up pregame. We got there before the crowds and had no problem getting a table, our waitress Bree was super friendly and had some great suggestions, and the tater tots were pretty great!  Also, the prices are pretty reasonable considering the proximity to AT&amp;T Park ($8 for a PBR and shot of Fernet is a pretty great deal anywhere in SF actually)  Good stuff, I'll be back to try more of the food menu...you can find me over at the vintage Atari 2600 playing River Raid.", 
    "review_date": "2014-04-17"
  }, 
  "U8BeSM0NhMLcGGNPWCu6CA": {
    "user_rating": 4.0, 
    "user_location": "Marietta, PA", 
    "user_name": "Stephen B.", 
    "review_text": "What a cool place!   Woodbury is put together pretty well. It has a rustic-like, open wood, dark saloon kind of theme, but classy; a shabby chic. The bar area was very nice with stools for each patron, but it was really the Nintendo NES and the Atari that caught the eye of my friends and I. Next to the bar they offer both of these systems and wall mounted TVs free to play. A few beers and some video games took us right back to our childhood and sparked some fun competition in Mario Cart.  Unfortunately, despite the great atmosphere, the great beer and drink selection, I have to deduct a star because of one incident. After my friend and I continuing to order drinks without providing a card or opening a tab, our other friend shows up and hands the bartender his card; all seems normal. It wasn't until about 15 minutes later, when we wanted to close out, that we're told that the card processing system is down and we need cash. The bartender admitted to knowing this since the 45 minutes we have been there. To resolve the issue, we each had to go to the adjacent building and use the ATM. While not a huge inconvenience, it could have been mentioned much sooner and avoided altogether.  I will still recommend Woodbury to friends and family in the area based on everything that is great about the place.", 
    "review_date": "2014-08-04"
  }, 
  "gfyW0vuJls8ARoHmogfcmw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marilyn T.", 
    "review_text": "Alchemist was getting really stuffy (literally and figuratively), so we moved downstairs to Woodbury.  It's much better ventilated, more spacious, and much more chill downstairs.  They also had some pretty good tater tots and mushroom poutine fries, which are awesome right around midnight.", 
    "review_date": "2014-09-28"
  }, 
  "mLHgb6eufSegCbLkqPS-EQ": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Sami B.", 
    "review_text": "This is a great new bar that just opened up in the soma. It has come great drink combinations for very reasonable prices. The bartenders are wonderful, and there is a good selection of liquor thats able to satisfy everybody. There is also a lot of space to sit or stand.  I've been here about 3 times, and I was always very impressed. Keep it goin' guys!", 
    "review_date": "2014-07-03"
  }, 
  "jdGKRKVYotSgMf9xZOlqKQ": {
    "user_rating": 5.0, 
    "user_location": "Sunnyvale, CA", 
    "user_name": "Samantha C.", 
    "review_text": "Super cool and chill space, with plenty of seating, large screen TVs, and even small area with a video game console (people were playing Street Fighter when I went haha!) The bartenders are friendly and accommodating.  The cocktails ($9-10) are legit! They rotate the menu every week; I just asked the bartender to surprise me ;) and he gave me some delicious pineapple concoction. They also serve all their beers in glass jars. +1 star.   The lounge is located near public transit and ATT Park, so it's overall very accessible!", 
    "review_date": "2014-07-22"
  }, 
  "DQ550klyMQpntNaKnILzFA": {
    "user_rating": 5.0, 
    "user_location": "South San Francisco, CA", 
    "user_name": "Laurie D.", 
    "review_text": "Came her before giants game. They have nice set up of TVs which they were playing the World Cup games. Score! Super knowledgable mixologist who helped me choose a great cocktail the Passarinho. Will come back for this drink and the great service and oh did I mention they have Mario cart to play!?", 
    "review_date": "2014-06-13"
  }, 
  "lLptGOYUfQ-Ir47UYJv0dw": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Kimberly G.", 
    "review_text": "There is nothing like coming from a long day of work and stepping into a world where you can be adult and kid at the same time. Beer/Shot in one hand, and a video game controller in the other. If you are a Manly man ,Woodbury is the place for you. Or if you are a women who can handle a beer or shot and can enjoy real liquor (no long islands, margaritas here) also, if you don't mind dead animals on the wall, then this is the place to go!  Highlights:  Decor: Tavern style, wood paneling, antlers on the wall and hanging from the ceiling. This is a mans dream bar, the bar that he wishes his wife would let him have at home.   Booze: This bar features beer both on tap and canned. Selection on tap changes so you can always come back for something different.   Liquor: Very straight forward list, they have basic scotch, whiskey, rye, gin and tequila selection. If you are looking for cocktails, then head over next door to Alchemist for a more extensive list and tasty cocktails.   Food: They have different selection of bar foods. Sliders, fries, Poutine and burgers . No frills and thrills , straight forward and delicious.", 
    "review_date": "2014-04-20"
  }, 
  "o6Dyk-73MhSG3RPM4rLrhw": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Amjad S.", 
    "review_text": "Cool space.  Didn't love the cocktails.", 
    "review_date": "2015-01-07"
  }, 
  "lLfcbYGTeVxQN5Ig0ompJg": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Elena N.", 
    "review_text": "Woodbury has Hours of happiness: Mon - Fri, 4:30pm - 7pm. How could I not drop by?! Who doesn't want a couple hours of happiness on a Friday night?  The specials on the board were: $2 PBR (12oz) $6 well drinks $10 mystery shot &amp; beer  We decided to try the mystery shot and beer. The mystery shot was something sweet with hints of cinnamon. I didn't care for it, but it wasn't hard to shoot.  Food wise, we ordered: *Poutine ($8): mushroom gravy, house ricotta, fried shallots; Get loaded (+$5): skirt steak, bacon *Brussels sprouts ($8): bacon, shallots, garlic confit, white wine, herb butter, korean chili flakes, parmesan *Shishito peppers ($5): blistered, citrus oil, lemon garlic aioli *Tots ($5): with dipping sauce *Chili cheese tots ($10): house chili, cheese sauce, creme fraiche, scallions  My favorites were the Shishito peppers and Chili cheese tots. The peppers had a nice smoke. I barely used the citrus aioli since it was a little too think for dipping. Plus, the peppers were good on their own! The chili cheese tots were also delicious. The chili didn't have beans which was great for me since I hate beans. And the cheese was ooey, gooey and comforting! The rest of the dishes were okay. I didn't care for the poutine though. It was hard to get a bite with everything and I didn't care for the ricotta.  We came on a Friday night, so the place was pretty busy. Luckily, someone left right when we got there, so I snagged a table along the wall.  Fun bar. I'd definitely go back for drinks and snacks!", 
    "review_date": "2015-01-16"
  }, 
  "7cL0wq8QwMGlUQnG2ruLSA": {
    "user_rating": 3.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Casey U.", 
    "review_text": "Casey U. muses on the formula to make a new bar in San Francisco sucessful:  A new, popular bar should focus on fancy-ass liquor, and pour beer for a dollar or two more than anywhere else. It should have black butte porter for seven dollars, and P.B.R. for four bucks, and bad wine, but it should be alright because they're served in mason jars. It should have poutine on the menu, and tater tots, and a burger for over 15 dollars. The poutine should be mediocre, with sad wilted fries, sad, flavorless gravy, and an artesinal cheese which does not resemble the classic curd in any way, shape, or form (which is a travesty guaranteed to offend any self-respecting Montrealer). The bar should have a SNES in the corner with Mario Kart and Super Mario Brothers for children of the nineties with too much disposable income to get their daily bath of nostalgia while indulging in their long-repressed competitive impulses. A hip bar should have meats with a pedigree, and menus printed on high-quality paper that looks like its been through a war.  Walking in to this hypothetical bar, you should feel unworthy if you make less than 75k a year. The clientele should range from 21-35 (in this town, if you're any older, you're finished), and everyone should have full heads of hair. There should be conspicuous displays of taxidermy (which means the bar is edgy), and strange chairs, possibly in the shape of unicycles (which means the bar is unique), and bartenders in ball-caps (which means that the bar is cool). It should be a place in a formerly bad part of town where you feel great taking profile pictures, and using your new selfie-pole (which I just found out is not a euphemism for a beef bayonet...if you know what I mean), and Instagramming your night for the world to see. It is a place of style, rather then substance.  Well, hello Woodbury. It seems I've accidentally described you, right down to the tragic Poutine. You do the generic new bar thing well, but, to my untrained, impoverished, and unhip eyes, you're a totally unremarkable place.", 
    "review_date": "2014-09-10"
  }, 
  "Co_Q6WPBN31E3fao1x74kA": {
    "user_rating": 4.0, 
    "user_location": "Menlo Park, CA", 
    "user_name": "Andrew C.", 
    "review_text": "Fun bar. I've yet to hit up the old video games in the back corner, but just knowing it's an option makes me happy.  I haven't really had any of the cocktails, I mostly come here for the beer and bar grub. They have some fun snacky foods like tater tots and the beer selection is reasonably interesting, although i'd appreciate a couple more hoppy beers on the menu.", 
    "review_date": "2014-11-14"
  }, 
  "EGvptPOz6SDKdxvbeqQ7Vw": {
    "user_rating": 4.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Marc T.", 
    "review_text": "8 dollars for black label and a beer. Decent poutine, and some solid tater tots.  This place is solid. Easy area to find parking if there are no games, and if there are, its another option to pregame at!", 
    "review_date": "2014-05-20"
  }, 
  "4LnTxJVyR_6k-56pw2DFGQ": {
    "user_rating": 4.0, 
    "user_location": "Spring, TX", 
    "user_name": "Hugh M.", 
    "review_text": "Friendly, knowledgeable staff, great drinks, and delicious food! Stopped in here when in San Francisco on business and decided on a little pleasure mixed in. The Woodbury delivers on the experience.", 
    "review_date": "2014-06-03"
  }, 
  "hgUSn_pO-HWU949eY4hCOA": {
    "user_rating": 4.0, 
    "user_location": "Atherton, CA", 
    "user_name": "Stephanie D.", 
    "review_text": "Came here after a giants game, many others had the same idea.  Fun little bar with awkward metal stools and cool vintage video games.  I didn't drink but my boyfriend had an old fashion and seemed to enjoy it.  I didn't interact with much of the staff but they definitely looked like they were hustling to make drinks and keep everything clean.", 
    "review_date": "2014-07-10"
  }, 
  "2-5-gHmVhFEhbs9EC8tmJw": {
    "user_rating": 5.0, 
    "user_location": "Encinitas, CA", 
    "user_name": "Tamas G.", 
    "review_text": "My favorite new local spot. Not a sports bar, though they'll have the games on tv - no audio. Not a dive, but affordable and staffed with great people, with some tasty grub.", 
    "review_date": "2014-09-23"
  }, 
  "zfHGAGtr_QCE8rbSy1Ffqg": {
    "user_rating": 1.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Laura C.", 
    "review_text": "BAD SERVICE! Nothing impressive about the food.", 
    "review_date": "2014-10-20"
  }, 
  "0HTPnBiBzPgCYLI6qIt9xQ": {
    "user_rating": 2.0, 
    "user_location": "Ventura, CA", 
    "user_name": "Gabrielle A.", 
    "review_text": "service was good. was drunk and in need of some food, this was not the place. saw a bunch of great reviews but the food lack salt or any form of seasoning.", 
    "review_date": "2014-09-15"
  }
}