{
  "AQGXEhf-1K8EiptBHbLE8w": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Shawn S.", 
    "review_text": "Loved the Yuzu pork and fried chicken. Makgeolli is a bit of an acquired taste but if you want to try authentic Korean rice wine this place has the best selection in the city. Plenty of good old fashioned grape wine and craft beer too.", 
    "review_date": "2014-12-12"
  }, 
  "dpjefr6FM4Rxsglx3Ml3zg": {
    "user_rating": 5.0, 
    "user_location": "Mill Valley, CA", 
    "user_name": "Ted L.", 
    "review_text": "Jade rules!   Best Korean BBQ, tartare, and pancakes ever.   Nice Pinot as well.   Our new go to spot pre and post any Fillmore show.", 
    "review_date": "2015-01-09"
  }, 
  "s7xM4j427FbmX4BkCodHeQ": {
    "user_rating": 5.0, 
    "user_location": "18ème, Paris, France", 
    "user_name": "Sarah K.", 
    "review_text": "Fun spot for makgeolli cocktails! The manager has a lifetime of traditional Korean cooking experience in Korea but has developed this menu as fusion drinking foods served up similarity to tapas. The fried brussels sprouts with gochujang chilli sauce is insanely addictive and a perfect pair to a round of drinks. Also love the creative makgeolli cocktails and in particular the fresh fruit blends that taste like smoothies.  Get to know the voluptuous lady behind the bar. She's a hoot!", 
    "review_date": "2015-01-21"
  }, 
  "-njXz5nC63_7Eh0uxGA6cA": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Hyes W.", 
    "review_text": "I wish there is a way of choosing 'Makgollie' bar instead of wine bar.  This place has a good selection of wine and beer but what it makes unique is Korean sweet rice wine Makgollie and Makgollie cocktails they serve. My boyfriend and I ordered 5 small tapas dishes and they all came out yummy and beautifully plated. Price is reasonable, too.  We waited for this place to open for months.", 
    "review_date": "2014-12-04"
  }, 
  "dwusuWk3JpcuD_2UVWZ3RA": {
    "user_rating": 5.0, 
    "user_location": "Burlingame, CA", 
    "user_name": "Yulia M.", 
    "review_text": "We had a great time last night, I enjoyed my drink. Zoomaak's version  of appletiny was outstanding  I appreciate the recommendation. Will be back to try the food.  Overall, it was a pleasant surprise.", 
    "review_date": "2014-12-20"
  }, 
  "sY_uz6P1sux3tKt1TEGqjA": {
    "user_rating": 4.0, 
    "user_location": "London, United Kingdom", 
    "user_name": "Rachel Z.", 
    "review_text": "New place on Fillmore Street!   Really interesting idea of taking old Korean tavern to a modern setting. The space is lit with cold neon color (from bar tables too). Two floors, can take about 40 people. I went on a Friday evening and it wasn't too crowded yet. The host/bartender Benjamin is very friendly.   I ordered Icing Grapefruit and I liked it, but I'm not sure if it's good news for you. I dislike the taste of alcohol so any drink that I like tend to be sweet and have very slight trace of alcohol =P It's very fruity and refreshing.  With the (relatively) recent addition of Izakaya Kou, Social Study, Origin and the expansion of State Bird Provision, this one block is more happening than ever. Now we just need a real boba place, a froyo shop and a good Chinese restaurant to complete the collection. Oh maybe also a Sephora.", 
    "review_date": "2015-01-24"
  }, 
  "U-gPI5JtAQZOpZJUZGNYKQ": {
    "user_rating": 5.0, 
    "user_location": "San Francisco, CA", 
    "user_name": "Tamas K.", 
    "review_text": "amazing 80s retro-cyber neon vibe place with super tasty food and fast, great service. the lightning and the tables looks like they are straight out of a william gibson's sci-fi novel. i'd highly recommend the honey fried chicken and anything else the owner of the place might recommends. beautiful interior design, great atmosphere, awesome kitchen and good drinks.", 
    "review_date": "2014-11-29"
  }, 
  "o7JJTi3oEtFfgRoVUTd8zw": {
    "user_rating": 4.0, 
    "user_location": "Diamond Bar, CA", 
    "user_name": "Frank C.", 
    "review_text": "Stopped by here for a night cap and it was definitely a treat. Especially coming from Southern California. I don't know what I had because our host chose the drinks for us. Loved the ambience and would definitely make a stop by here again.", 
    "review_date": "2015-01-26"
  }, 
  "mUsinyIk1L0w3CQaOWjw1w": {
    "user_rating": 5.0, 
    "user_location": "East Orange, NJ", 
    "user_name": "Robert A.", 
    "review_text": "Small delicious plates, great drinks, and energy make this a great late night stop.  The fried chicken is to die for and the tofu salad and Brussels sprouts will make a vegetarian weep with joy.  Don't skip the traditional Korean drinks either.  You'll thank me.", 
    "review_date": "2014-11-29"
  }
}